import { useState } from "react"

function App() {

  const [regionN, setregionN,] = useState(0)
  const regions = [
    {
      name: "Գառնի",
      titel: " Գառնու հեթանոսական տաճար",
      description: `Ենթադրվում է, որ տաճարը նվիրված է եղել արևի աստված Արեգ-Միհրին։ Հայ արքաները, մասնավորապես Տրդատը, 
      իրենց աստված-հովանավորն էին համարում Միթրային, և բնական է թվում այն ենթադրությունը, որ հզոր Հռոմի դեմ հաղթանակից ու նրա
      իսկ կողմից թագադրվելուց հետո, վերադառնալով հայրենիք, իր գահանիստ վայրում կկառուցի Գառնին, տաճար՝ նվիրված հենց իր հովանավոր-աստված Միհրին։
      Միհրը, իբրև լույսի, ճշմարտության խորհրդանիշ, հաճախակի պատկերվել է ցլի (խավարի) դեմ մենամարտելիս։

      Ա. Կ. Տրևերը գրում է․
      
      ․․․ Գառնու հեթանոսական տաճարը նվիրված է եղել Արևի աստծու պաշտամունքին, հնարավոր է, որ այդ աստվածությունը ժողովրդի մեջ դեռևս
      կրում էր Արեգ անունը, իսկ Արշակունիների թագավորական առօրյա կենցաղում կոչվում էր Միհր, այսինքն՝ Միթրա։	
      4-րդ դարի առաջին տարիներին տաճարի ներսում և դրսում կատարվել են բարենորոգման աշխատանքներ. այն վերափոխվում էր իբրև «տուն հովանոց»։ 
      Վերացվել են դրսի զոհասեղանները, ներսի կուռքը, ծածկվել է երդիկի բացվածքը, վերացվել երդիկից թափվող ջրերի հեռացման համար հատակի վրա 
      ստեղծված քարակերտ հարմարանքը, և այդ մասը սալահատակվել, վերափոխվել է տաճարի մուտքը՝ այն հարմարացնելով բնակության համար։

      Գառնու պեղումների ընթացքում հայտնաբերված որոշ բեկորների ուսումնասիրությունը Մառին բերեցին այն եզրակացության, 
      որ քրիստոնեական կրոնի ընդունումից հետո հեթանոսական տաճարը վերակառուցվել է և նրա ցելլայի մեջ ստեղծվել է եկեղեցի։
      Այդ տեսակետին են Խաչատուր Դադայանը, Յա. Սմիռնովը, Կ. Վ. Տրևերը։ Դրան համակարծիք չէ Ալեքսանդր Սահինյանը։ Ըստ նրա՝ եկեղեցին եղել է,
      բայց այն կառուցված է եղել անտիկ տաճարի արևմտյան կողմում։ Այդ քառաբսիդ եկեղեցին կառուցվել է 7-րդ դարում, որի ավերակները ցարդ 
      նույն տեղում են։
      1679 թվականին Գառնու տաճարը խոնարհվեց ուժեղ երկրաշարժի հետևանքով։ Կործանված տաճարի մասերը, նրբաքանդակ սյուների կտորները և պատերի քարերը,
      խոյակներն ընկած էին տաճարի շուրջը. դա հնարավոր դարձրեց տաճարի վերակազմությունն իր նախնական տեսքով։ Մինչ այդ, հարկ է հիշատակել այն փաստը,
      որ տաճարի վերականգնման հարցը բարձրացվել է դեռևս 1880-ական թվականներին, երբ հնագետ կոմս Ա. Ա. Ուվարովի առաջարկությամբ նախատեսվում էր 
      տաճարի քարերը տեղափոխել Թիֆլիս և վերականգնել այնտեղ։ Քարերի տեղափոխումը հանձնարարված էր Երևանի նահանգապետին, որը, բարեբախտաբար,
      չկատարեց այդ հանձնարարականը՝ հիմնավորելով տեխնիկական անհնարինությամբ։

      Գառնու տաճարի հետազոտությամբ զբաղվել են Նիկողայոս Բունիաթյանը, Բաբկեն Առաքելյանը, Ն. Տոկարսկին և այլ հեղինակներ։
      Եռանկյունաձեւ հրվանդանի վրա վեր խոյացող Գառնու տաճարը հայ հեթանոսական մշակույթից պահպանված եզակի օրինակն է:
      Տաճարը հունա-հռոմեական եւ հայկական ոճերի միացման ծնունդ է: Այն կառուցվել է մ. թ. առաջին դարում Տրդատ Առաջինի հրամանով եւ նվիրվել է 
      արեւի աստված Միհրին: Հայաստանում քրիստոնեությունն ընդունելուց հետո երբեմնի հեթանոսական տաճարը վերածվում է արքաների 
      ամառային նստավայրի: Այսօր էլ տաճարի շրջակայքում կարելի է տեսնել ամրոցի եւ արքայական պալտների այլ ավերակները, ինչպես նաեւ մեծ 
      հետաքրքրություն առաջացնող թագավորական բաղնիքը ՝հատակի գունավոր խճանկարով:`,
      img: "https://upload.wikimedia.org/wikipedia/commons/1/10/Garni-msu-wlm-3121.jpg",
      photo: "https://www.panorama.am/news_images/854/2560318_1/f6135c7aa3c487_6135c7aa3c4c7.thumb.jpg"
    },
    {
      name: "Գեղարդ",
      titel: "Գեղարդ վանական համալիր",
      description: `Գեղարդ վանական համալիրը կամ Այրիվանքը գտնվում է Կոտայքի մարզում՝ Գողթ գյուղում: Տեղակայված է Ազատ գետի աջ ափին: 
      Հայաստանի այն եզակի հոգևոր կառույցներից է, որոնք միաձուլված են շրջապատող ժայռերին: Այրիվանք անունը ստացել ի շնորհիվ 140-ի հասնող այրերի:
      Վանական համալիրի կառուցման պաշտոնական տարբերակից զատ՝ գոյություն ունի ավանդական տեսակետ, որի համաձայն, մի ազնվատոհմիկ ընտանիքից քույր 
      և եղբայր որոշել էին թողնել աշխարհիկ կյանքը և ձորի մեջ տաճար կառուցել։ Նրանք խնդրում են Աստծուն օգնել իրենց։ Առավոտյան արթնանալով՝
       տեսնում են իրենց բրիչը՝ խրված լեռան կատարին, և քրտնաջան աշխատանքով աստիճանաբար ժայռի մեջ բացում են մի տաճար, որտեղ էլ կնքում են իրենց
        կյանքի մահկանացուն։
        14-րդ դարի վերջին Հայաստանը ենթարկվում է միջինասիական զորավար Լենկթեմուրի արշավանքներին։ Լսած լինելով Գեղարդի վանքի հրաշագործությունների
         համբավը՝ Լենկթեմուրը (1336-1405) որոշում է անձամբ փորձել այն։ Անթիվ զորքով հարձակվում է ամայի ձորի վրա և հոխորտանքով ու ծաղրաբանությամբ 
         հրամայում է բերել իր մոտ Գեղարդի Սուրբ նշանը։ Հենց որ բարձրացնում են նիզակները Սուրբ նշանին հարվածելու, անմիջապես բյուրավոր աներևույթ
          զրահավորված զինվորներ՝ գույնզգույն համազգեստներով, ամեն կողմից հարձակվում են թշնամու վրա։ Իրարանցում է ընկնում Թեմուրի զորքի մեջ.
           ոմանք փախուստի են դիմում, ուրիշների ձեռքերն են գոսանում, շատերը կուրանում են։ Տեսնելով այդ՝ սարսափահար Լենկթեմուրը թողություն է խնդրում,
            Սուրբ նշանից և մեծամեծ պարգևներ խոստանալով՝ ետ է վերադառնում։
      ՅՈՒՆԵՍԿՕ
      2018թ. Գեղարդի վանքն ու Ազատ գետի վերին հովիտը ներառվել են ՅՈՒՆԵԿՍՕ-ի «ուժեղացված պաշտպանության կարգավիճակ» ունեցող հուշարձանների ցանկում:
      Այս կարգավիճակը տրվել է աշխարհի տարբեր երկրներից ընդամենը 17 հուշարձանի: 
      
      Այս կարգավիճակը տրվում է միայն մարդկության համար բացառիկ նշանակություն ունեցող ազգային և մշակութային արժեք ներկայացնող հուշարձաններին:
       Այս որոշումն իրականացվել է «Զինված ընդհարման դեպքում մշակութային արժեքների պաշտպանության մասին» 1954թ. կոնվենցիայի շրջանակներում: 
       Կարգավիճակ ստացած հուշարձանները պաշտպանվում են «…միջազգային կամ ոչ միջազգային զինված հակամարտությունների ժամանակ: 
       Մեխանիզմը պահանջում է հակամարտող կողմերին ձեռնպահ մնալ նման հուշարձանի վրա հարձակումից, ինչպես նաև այն կամ դրա անմիջական շրջապատը
        ռազմական նպատակներով ցանկացած օգտագործումից»,- սահմանված ՅՈՒՆԵՍԿՕ-ի տեղեկանքում: 
      
      Գեղարդ անվան ծագումը
      Վանական համալիրն ի սկզբանե անվանել են Այրիվանք՝ բազմաթիվ այրերի և ժայռերի պատճառով: Վանական համալիրում 140-ի հասնող այր-խցեր են եղել՝ 
      նախաեսված մենաստանի, ճգնելու համար: Բացի այդ, վանական համալիրում կան չորս ընդարձակ ժայռակերտ սրահներ, որոնք ինչ-որ առումով նման են 
      Քոբայրավանքին, որտեղ կառույցները միաձուլված են շրջապատող ժայռերի հետ:
      Գառնիից 9 կմ հեռավորության վրա, Ազատ գետի ափին է գտնվում 13-րդ դարի հայ ճարտարապետության անգերազանցելի գլուխգործոցը՝ Գեղարդը: 
      Համալիրի բաղկացուցիչ մաս կազմող եկեղեցիները եւ վանական խցերը մեծ վարպետությամբ փորված են հսկայածավալ ժայռաբեկորի մեջ: 
      Ի սկզբանե վանքային համալիրը կոչվում էր Այրիվանք, իսկ հետագայում ստանում է Գեղարդ անունը՝  ի հիշատակ այնտեղ պահվող Գեղարդի, 
      որով ըստ ավանդության հռոմեացի զինվորը խոցել էր Քրիստոսի կողը: Գեղարդավանքը հարուստ է նրբակերտ զարդաքանդակներով եւ բարձրարվեստ խաչքարերով:`,
      img: "https://heroesofadventure.com/wp-content/uploads/2019/07/Geghard-Monastery-Armenia.jpg",
      photo: "https://armadventure.com/wp-content/uploads/2020/05/Geghard.jpg"
    },
    {
      name: "Ծաղկածոր",
      titel: "Ծաղկածոր",
      description: `Ծաղկաձոր (Կեչառիս, Ծաղկոցաձոր, քաղաք Հայաստանի Կոտայքի մարզում, Թեղենիսի արևելյան լանջին։
         Կլիման մեղմ է, առողջարար։ Քաղաքը գտնվում է ծովի մակերևույթից 1841 մ բարձրության վրա, մարզկենտրոնից 6 կմ հյուսիս-արևմուտք։
          Նախկինում գյուղն ամառանոցավայր էր, ապա՝ ավան, 1958 թվականից՝ քաղաքատիպ ավան։

        ՀԽՍՀ Գերագույն Խորհրդի 1984 թվականի փետրվարի 16-ի հրամանագրով Ծաղկաձորը դասվել է քաղաքների կարգին։ Ծաղկաձորը լեռնակլիմայական առողջավայր է։
         Այստեղ են գտնվում մարզական բազան, քաղաքից Թեղենիսի գագաթը տանող 6 կմ երկարությամբ ճոպանուղին, մանկական առողջարանը, հանգստյան տները և 
         տուրիստական բազաները։ Քաղաքի մեջ է գտնվում Կեչառիս վանական համալիրը (XI-XV դարեր) իր Կաթողիկե (XV դար), Սուրբ Նշան եկեղեցի (XI դար) և 
         Սուրբ Գրիգոր Լուսավորիչ եկեղեցի (1003 թ.) եկեղեցիներով, համալիրից 200 մ արևմուտք՝ Սուրբ Հարություն եկեղեցի (1228 թ.) (Կոնստանտինովկա)
      Ծաղկաձոր քաղաքը (“Ծաղիկների ձոր”) համարվում է Հայաստանի ամենահայտնի եւ հյուրընկալ վայրերից մեկը:
      Հնում կոչվել է Ծաղկոցաձոր, հետագայում՝ Ծաղկունյաց ձոր։ Միջնադարում հայտնի էր նաև Կեչառիս կամ Կեչառոյք անունով․ այդպես է կոչվել 
      11֊13-րդ դարերում կառուցված Կեչառիս վանքի անունով։

1947 թվականին բնակավայրին վերադարձվել է իր պատմական անվանումը։
Ծաղկաձորում սկսել են բնակություն հաստատել դեռևս III―V դարերում։ Վաղ միջնադարում (IV―V դարեր) այս հողերը պատկանել են հայոց թագավորի կալվածքները 
տնօրինող Վարաժնունի տոհմին։ VI դարում հովիտն անցավ հայկական ազդեցիկ Կամսարական տոհմի տիրապետության տակ, որը սերվել էր Իրանի 7 մեծագույն տներից
 մեկի՝ Կարին-Պահլեվիդներից։ Կամսարական տոհմի հետնորդ, Պահլավունի տոհմի առաջնորդ Գրիգոր Մագիստրոսը 1033 թվականին հրամայեց Ծաղկաձորում կառուցել
  եկեղեցի, որը կոչեցին Գրիգոր Լուսավորիչի անունով։ Այսպես հիմնվեց Կեչառիս վանական համալիրը։

XVII դարի սկզբին քոչվորական ցեղերը, գրավելով «Ծաղիկների ձոր»-ը, տեղանքը կոչեցին Դարաչիչակ, որը Ծաղկունյաց ձորանվան թուրքերեն թարգմանությունն է։
 Քաղաքը կրկին Ծաղկաձոր վերանվանվեց 1947 թվականին։ Իսկ երբ Արևելյան Հայաստանը միացավ ռուսական կայսրությանը (1828 թ), Ծաղկաձորը մտավ Էրիվան նահանգի 
 մեջ։ Այդ տարիներին Ծաղկաձորում բնակություն հաստատեցին հազարավոր հայ գաղթականներ Արևմտյան Հայաստանից և Պարսկաստանից։ Այստեղ իր ամառային
  նստավայրերը սկսեց կառուցել արդեն նահանգային հասարակության սերուցքը։

Քաղաքը պահպանեց իր հայտնի հանգստավայրի կարգավիճակը նաև խորհրդային իշխանության օրոք։ Ծաղկաձորում հանգստանում էին ոչ միայն Հայաստանի քաղաքացիները,
 այլև այստեղ գալիս էին ԽՍՀՄ ողջ տարածքից։ Հովտում գործում էին երկու տասնյակ պիոներական ճամբարներ, հանգստյան տներ։ Ծաղկաձորը տեղակայված
  է նույն բարձրության վրա, ինչ Մեխիկոն։ Ուստի Մեքսիկայի մայրաքաղաքում կայանալիք՝ 1968 թվականի Ամառային Օլիմպիական խաղերի նախաշեմին հենց 
  Ծաղկաձորում կառուցվեց ԽՍՀՄ գլխավոր սպորտային համալիրը։ Այստեղ օլիմպիադաներին և աշխարհի առաջնություններին են պատրաստվել աշխարհի տարբեր 
  երկրների հավաքականները։ Իսկ երբ 1972 թվականին Թեղենիս լեռան լանջերին կառուցվեց ճոպանուղին, Ծաղկաձորը հայտնի դարձավ նաև որպես լեռնադահուկային 
  հանգստավայր։

Ավանդություն
Ասում են, թե օտար մի բռնակալ ավերելով ու ավարելով իր շուրջը, գալիս հասնում է Մաքրավանք և Կեչառիս գյուղերին։

― Ի՜նչ լավ վանքեր ունեն, ― ասում է նա, երբ տեսնում է այս գյուղերի գեղեցիկ վանքերը։

― Ես լսել եմ, որ այս վանքերին տեղացիք քույր ու եղբայր են համարում, ― ասում է նրա զորավարներից մեկը։

― Հա', ― մռնչում է բռնակալը ... Դե որ այդպես է, հրամայում եմ քարե շղթաներ պատրաստել և կապել իրար քրոջն ու եղբորը, որպեսզի նրանք բանտարկված
 լինեն և հայերը չկարողանան մոտենալ և միայն հեռվից նայեն նրանց ու մղկտան։ Այդպես էլ անում են։ Քարե շղթայի ծայրը մի վանքից բերում, միացնում են
  մյուսին։ Դրանից հետո Կեչառիս գյուղը կոչվում է Ժնջրլու շղթայված կամ շղթայակիր, մինչև որ հայերը հանում են քարե շղթաները և ծաղկաշատ բնակավայրն 
  անվանում են Ծաղկաձոր[4][5][6][7]։

Ավանդություն ըստ Հայոց պատմության

Ըստ ավանդության՝ Պահլավունյաց տոհմի օրիորդներից մեկի կամքով մի ձորահովտում կառուցում են ամրոց և դրա կողքին՝ մի շքեղ ծաղկանոց, որտեղ աճեցնում
 են աշխարհի ամենագեղեցիկ ծաղիկները։

Բայց մի օր կատաղի քամին ավերում է ծաղկանոցն ու ծաղիկները ցրում ձորով մեկ։ Աղջիկը խնդրում է հորը կառուցել տալ մի վանք, որտեղ վանահայրերն աղոթեն
 ու վերադարձնեն ցրված ծաղիկները։

Վանքը կոչում են Կեչառիս, իսկ ձորը՝ Ծաղկաձոր։
       Սա մեր լեռնային երկրի փոքրիկ այն այնկյուններից է, ուր բնության գեղեցկությունն ի հայտ է գալիս իր ամբողջ բազմազանությամբ:
        Ծաղկաձորը գտնվում է Կոտայքի մարզում, Երեւանից 50 կմ դեպի հյուսիս, Տեղենիս սարի արեւմտյան լանջին, եւ շրջապատված է կուսական 
        անտառներով ու ալպիական մարգագետիններով:Հետաքրքիր տուրերը դարձնում են Ծաղկաձորը անմոռանալի հանգստի վայր: Ճոպանուղին ձեզ կտանի 
        դեպի ալպիական մարգագետիններ, ձյունապատ սարեր: Մաքուր լեռնային օդ, բազմազան ծաղիկներ, աստղային երկինք, անմոռանալի ձմեռային հանգիստ… 
        Սա այն է, ինչ կարող է առաջարկել ձեզ Ծաղկաձորը:`,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/tsaxkadzor-armenia.jpg",
      photo: "https://onewaytour.com/wp-content/uploads/2018/04/jkhjkh.jpg"
    },

    {
      name: "Ջերմուկ",
      titel: "Ջերմուկ",
      description: `Ջերմուկը գտնվում է ծովի մակերևույթից 2080 մ բարձրության վրա գտնվող ոչ մեծ սարահարթում, որը երկու մասի է բաժանվում Արփա 
    գետի գեղատեսիլ կիրճով։ Քաղաքը գտնվում է Հայաստանի հարավարևելյան մասում, Վայոց ձորի մարզում (պատմական Սյունիք նահանգի Վայոց ձոր գավառի
       տարածքում)։ Բնակավայրը հիշատակվում է սկսած 13-րդ դարից՝ պատմիչ Ստեփանոս Օրբելյանի «Պատմություն Նահանգին Սիսական» աշխատության մեջ։
        Սակայն քաղաքի տարածքում գտնվող հին կիկլոպյան ամրոցի և 8-րդ դարի եկեղեցու ավերակներն ու մնացորդները խոսում են այն մասին, որ հանքային
         ջրերի ակունքների մոտ գտնվող Ջերմուկ բնակավայրը գոյություն է ունեցել շատ վաղուց։

    Ջերմուկի կազդուրիչ հանքային ջրերը դեռ շատ հնուց օգտագործվել են ինչպես հասարակ ժողովրդի, այնպես էլ Սյունաց Իշխանների կողմից՝ ամենատարբեր
     հիվանդությունների բուժման նպատակով։ Այդ մասին են վկայում միջնադարում կառուցված լողավազանի մնացորդները, որոնք վերակառուցվել և վերականգնվել
      են 1860-ական թվականներին ցարական պրիստավ Գևորգ Խանագյանի կողմից, և այժմ էլ ժողովրդի կողմից լողավազանը կոչվում է «Պրիստավի գյոլ»։
       Չնայած պատմական հարուստ անցյալին, այսօրվա նոր քաղաքի հիմքը դրվել է միայն 1940 թվականին՝ առաջին առողջարանի կառուցման ավարտով։
    
    Հետագա տարիներին Ջերմուկը կառուցվել ու կառուցապատվել է, ստեղծվել են բոլոր հնարավորությունները ինչպես բնակչության, այնպես էլ հանգստացողների
     ակտիվ հանգստի, առողջության վերականգնման և զբոսաշրջության համար։ 1967 թվականին քաղաքը ձեռք է բերում հանրապետական նշանակության քաղաքի, 
     իսկ 1970 թվականին՝ համամիութենական նշանակության առողջարանի կարգավիճակ։ 1980-ականներին քաղաքն ուներ շուրջ 10 000 բնակիչ, շուրջ
      2 000 մահճակալով առողջարանների ու պանսիոնատների ցանց՝ ակտիվ հանգստի և բուժման համար նախատեսված բոլոր ենթակառուցվածքներով ու 
      ծառայություններով։ Օբյեկտիվ պատճառներով առողջարանային քաղաքի ակտիվ կյանքը 1990-ականներից մեծ տեղատվություն ապրեց, որը սկսեց աշխուժանալ
       1990-ական թվերի վերջերից։
    
    
    Սուրբ Գայանե եկեղեցի, Ջերմուկ
    Վարչական տարածքը՝ շուրջ 5, 5 հազար հեկտար։ Երևանի հետ կապվում է երկու ավտոմայրուղիներով, որոնցից «Ջերմուկ-Երասխ-Երևան» մայրուղին ավելի 
    կարճ է և կազմում է շուրջ 170 կմ։ Քաղաքը «Երևան-Գորիս-Ստեփանակերտ» մայրուղուց գտնվում է 24 կմ հեռավորության վրա։
    
    Ջերմուկը ոչ միայն բազմաթիվ լեգենդների բնաշխարհ է, այլ նաև քաղաքում ու մերձակայքում սփռված բազմաթիվ պատմամշակութային հուշարձաններով ու
     տեսարժան կառույցներով, արկածային տուրիզմի սիրահարներին ձգող բազմաթիվ անդնդախոր ձորերով ու բարձր ժայռերով, քարանձավներով ու որսատեղիներով 
     (Արփա-Սևան թունել, Կեչուտի ջրամբար, Գնդեվանք, Վարդանի քար, Գլաձորի միջնադարյան համալսարան, Նորավանքի համալիր և այլն) հարուստ մի բացօդյա 
     թանգարան։ Հատկապես գեղեցիկ է ջերմուկյան ձնառատ, փափուկ և արևոտ ձմեռը։ Հարկ է նշել, որ արևոտ ու պայծառ օրերի քանակով քաղաքը նախկին
      միութենական առողջարանների մեջ զբաղեցնում էր առաջին տեղերից մեկը։ Ձմեռային հանգստի, բուժման, մարզաձևերի համար բարենպաստ կլիմայական 
      ու բնական պայմանների առկայությունը միշտ դեպի առողջարանային քաղաք է ձգել ձմեռային հանգստի սիրահարներին։
    
    1967 թվականից հանրապետական ենթակայության և 1970 թվականից միութենական նշանակության առողջարանների կարգը դասված քաղաք առողջարանը այսօր 
    հանգստացողներին ու զբոսաշրջիկներին է առաջարկում շուրջ 2 000 մահճակալով առողջարանների, հյուրանոցների, պանսիոնատների, համաբուժարանների,
     ըմպելասրահի, լողավազանների, մարզահրապարակների, կինոթատրոնի, հասարակական սննդի օբյեկտների, բարերի ու սրճարանների ծառայությունները։
    Ջերմուկը առողջարանային քաղաք է Հայաստանի Վայոց Ձորի մարզում՝ Երևանից 173կմ հեռավորության վրա:

    Ջերմուկում շուրջ 70 մետր բարձրությունից Արփայի կիրճն է գահավիժում ջրվեժը, որ թափված վարսեր է հիշեցնում. ժողովուրդը ջրվեժն անվանել է 
    «Ջրահարսի վարսեր»: Ջերմուկի ջրի զորության մասին լեգենդներ են հյուսվել:
    
    Կա մի լեգենդ, որի համաձայն, շատ վաղուց, երբ մարդու ապրուստի հիմնական միջոցը որսորդությունն էր, Ջերմուկի անտառները լիքն էին ամենատարբեր 
    որսատեսակներով։ Եվ ահա, մի անգամ, փորձառու որսորդը նետահարում է երիտասարդ եղնիկին: Վիրավոր եղնիկը մեծ ճիգերով, վերջին ուժերը հավաքած,
     սկսում է փախչել։ Որսորդը կրնկակոխ հետապնդում է նրան։ Մի կերպ, ոտքերը հազիվ քարշ տալով, եղնիկը հասնում է Ջերմուկի հանքային աղբյուրներին,
      նետվում ջուրը և… այ քեզ հրաշք, ջրից դուրս է գալիս բոլորովին առողջ ու ապաքինված և անմիջապես անհետանում անտառի խորքը։
       Կյանքում ամեն ինչ տեսած փորձառու որսորդը ապշում է հասարակ ջրի կատարած հրաշքից, և այդ օրվանից տարածվում է «Ջերմուկ» ջրի 
       համբավը աշխարհեաշխարհ, իսկ հրաշք ջրի գաղտնիքը մարդկանց հասցրած եղնիկը դառնում է ժողովրդի սիրելին ու Ջերմուկի խորհրդանիշը:`,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/jermuk-armenia.jpg",
      photo: "https://i.ytimg.com/vi/mKinGYQ2s_I/maxresdefault.jpg"
    },
    {
      name: " Արագած",
      titel: "Արագած լեռ ",
      description: `Արագած, հրաբխային քառագագաթ լեռ է,Հայկական լեռնաշխարհում՝ Հայաստանի կենտրոնական հատվածում՝ Արագածոտնի և Շիրակի մարզերի
     սահմանագլխին։ Ամենաբարձր կետը հյուսիսային գագաթն է, որն ունի 4096 մետր բարձրություն։ Հայաստանի Հանրապետության ամենաբարձր գագաթն է։
      Այն շրջապատից մեկուսացած, վահանաձև փռված լեռնազանգված է՝ մոտ 200 կմ շրջագծով։ Հովհարաձև տարածված լանջերի հետ միասին գրավում է մոտ 4000 կմ²
       տարածություն Արարատյան ու Շիրակի դաշտերի, Ախուրյան ու Քասախ գետերի միջև։ Երեք կողմից նրան հարևան են հյուսիսից՝ Շարայի, արևելքից՝ Արայի, 
       հարավ-արևմուտքից՝ Մեծ Արտենի լեռները։ Եղել է պատմական Մեծ Հայքի Արագածոտն, Շիրակ և Նիգ գավառների սահմաններում։
       Արագած անվան ծագումը կապում են Հայկի որդի Արամանյակի կամ էլ Արա աստծո անունների հետ (Արագած՝ Արայի գահ):
       Արագածը վաղ անցյալում եղել է աշխարհի խոշորագույն հրաբուխներից մեկը։ Ունի 400 մ խորությամբ և 3 կմ տրամագծով հսկա խառնարան, որի քայքայված
        պատերի մնացորդները կազմում են լեռան չորս կատարները։ Խառնարանը հարավարևելյան կողմից բաց է և կապվում է շրջապատին գետակների ու ջրվեժների 
        միջոցով։ Կատարները դասավորված են կիսաշրջանաձև և կազմում են 270 աստիճանի աղեղ։ Ամենաբարձրը հյուսիսային կատարն է (4090.1 մետր)։ 
        Արևմտյան գագաթն ունի 3995.3 մետր, արևելյանը՝ 3908.2 մ, իսկ հարավայինը՝ 3887,8 մ բարձրություն։ Խառնարանը ջրահավաք մեծ ավազան է։ 
        Այստեղից է սկիզբ առնում Քասաղի վտակ Գեղարոտ գետը։

Արագածի հավերժական ձյունե ծածկույթը մոտ 6 կմ² է։ Լեռն ունի մի քանի փոքր սառցադաշտեր, որոնցից ամենամեծը (1,5 կմ մակերեսով) խառնարանում է։ 
Սառցադաշտերը սնվում է Քասաղի վտակ Գեղարոտը։

Եթե Արագածի ատամնաձև գագաթները ուղղաձիգ են (հատկապես հյուսիսային կատարը, որ բավական դժվարամատույց է վերելքի համար), ապա լանջերը մեղմ
 թեքություն ունեն, որոնք փռված են գագաթների շուրջը հսկայական տարածության վրա՝ տեղ-տեղ կազմելով ընդարձակ բարձրավանդակներ, սարավանդներ,
  հարթություններ (Ապարանի դաշտը, Կարմրաշենի, Շամիրամի սարահարթերը, Օհանավանի, Մարալիկի սարավանդները և այլն), մասնատված են ճառագայթաձև տարածվող 
  խոր հովիտներով, կիրճերով, հեղեղատներով։ Լանջերին կան նաև հրաբխային ծագում ունեցող կոնաձև բարձրություններ (Փոքր Արտենի, Իրինդ, Կարմրաթառ, 
    Դաշտաքար և այլն)։

Արագածի մերձակայքում ցրված են բազմաթիվ պարազիտային կոներ, որոնք անցյալում պարբերաբար արտավիժել են հրաբխային նյութեր։ Հրաբխային ժայթքումների
հետևանքով Արագածի լանջերը հսկայական տարածության վրա (ընդհուպ մինչև ստորին փեշերը) ծածկված են լավաներով։ Լեռը հարուստ է հրաբխային ծագում ունեցող 
օգտակար հանածոներով (տուֆ, պեմզա, պեռլիտ և այլն)։ Արագածի գագաթներին մշտական ձյուն է նստած, իսկ փեշերին արտահայտվում են տարվա բոլոր եղանակները՝ 
իրենց նրբերանգներով։ Լեռնային շրջաններում կլիման փոփոխվում է ըստ բարձրության. մերձգագաթային գոտում զով է, իսկ գագաթին ցուրտ է նաև ամռանը։

Լեռնազանգվածը զբաղեցնում է 820ք/կմ տարածք։ Այն հանգած հրաբուխ է, որի ժայթքման արդյունքում առաջացել են 4 գագաթները։ Արագած լեռն իրենից 
ներկայացնում է հսկայական հրաբխային զանգված, որը ունի ճյուղավորությունը որ մոտ 20-ից ավել 3000 մետրից բարձր լեռնագագաթներով (Քարակատար, 
  Քարապար, Կաքավասար, Նիգասար, Թեժառույք և այլն) ինչպես նաև լճեր, ջրվեժներ, աղբյուրներ։
    Հայաստանի Հանրապետության ամենաբարձր կետը Արագած լեռն է (4095 մ): Քառագագաթ այս հսկան լեռնագնացների ամենասիրած լեռն է
     եւ ամեն տարի դեպի իր բարձունքներն է գրավում բազմաթիվ արկածասերների: Դեպի հարավային գագաթ տանող ճանապարհին լավագույն հանգրվանը Քարի լիճն է,
      որը գտնվում է 3250 մ բարձրության վրա: Առանձնապես դյութիչ տեսարան է բացվում ամենավերեւից: Մի կողմից ուրվագծվում են կանաչ հովիտները,
       կողքից սպիտակին է տալիս հավերժական ձյունը, մի այլ տեղում արծաթազօծվում են Արագածի բազմաթիվ մեծ ու փոքր լճերը, 
       իսկ հեռու մշուշում Արարատյան դաշտի եզրին վեր է հառնում Բիբլիական Արարատը: `,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/aragats-armenia.jpg",
      photo: "https://tse1.mm.bing.net/th?id=OIP.gBVrr3zu0Aq9qCV9BmUR1wHaE5&pid=Api&P=0&h=180"
    },
    {
      name: "Հաղարծին",
      titel: "Հաղարծնի վանք",
      description: `Հաղարծնի վանք, 10-րդ դարի հայկական վանական համալիր, Հայաստանի Տավուշի մարզում, Դիլիջան քաղաքից 18 կմ հեռավորության վրա։
    Ըստ ավանդույթի վանքի բացման և օծման արարողության ժամանակ մի արծիվ էր ճախրում գլխավոր եկեղեցու գմբեթի վրա, և դրանով իսկ այն հայտնի դարձավ 
    որպես խաղացող (կամ ճախրող) արծվի վանք («հաղ» նշանակում է խաղ, իսկ «արծին» նշանակում է արծիվ)։ Այտեղից էլ առաջացել է Հաղարծին բառը։
    Վանական համալիրը կառուցվել է 10-13-րդ դարերի ընթացքում։ Վանքի մասին տեղեկություններ է մեզ հասել Կիրակոս Գանձակեցու կողմից։ 
    Վանքը ծաղկում է ապրել 12-րդ դարի վերջին - 13-րդ դարի սկզբին՝ Խաչատուր Տարոնացու առաջնորդության ժամանակ։ Որպես ուսումնագիտական կենտրոն 
    հիշատակվում է (Կոստանդին Դ, Ստեփանոս Օրբելյան) 13-րդ դարի առաջատար մշակութային կենտրոնների շարքում։ Հայոց Բագրատունիների թագավորության 
    թագավոր Սմբատ Ա-ը թաղվել է Հաղարծին վանական համալիրում։
    Հաղարծինի համալիրի կազմում են երեք եկեղեցի, երկու գավիթ (մեկը՝ ավերված), սեղանատուն, աղոթարաններ, խաչքարեր։ Վանքի տարածքում, 
    հուշարձանների գլխավոր խմբից արևելք, ժայռալանջին աղոթարաններ են, գեղաքանդակ խաչքարեր։ Հաղարծինում գտնված բրոնզաձույլ կաթսան (350 կգ, 
      այժմ ՀՊՊԹ-ում է) գեղարվեստական մետաղագործության բարձրարվեստ նմուշներից է․ շուրթի պսակի փորագրությունը նշում է պատրաստման տարեթիվը՝ 
      1232, չորս կանթերն առյուծների արձանիկներ են, ոտքերը նույնպես զարդարված են գեղարվեստորեն։
    
    Ամենավաղը Սուրբ Գրիգոր եկեղեցին է (մոտ X դար), որն արտաքուստ ուղղանկյուն, ներքուստ խաչաձև (չորս անկյունների ավանդատներից արևելյաններն 
      առանձնացված չեն աղոթասրահից) հատակագծով գմբեթավոր կառույց է։ Գմբեթային փոխանցումն իրականացված է սաղր տրոմպներով։ Դեկորատիվ միակ
       տարրը խիստ հողմահարված անկյունային որմնախոյակներն են՝ պարզ բեկվածքներով և ականթի տերևների արխաիկ նկարվածքի շարքով։ Եկեղեցուն արևմուտքից 
       կից է քառասյուն կենտրոնակազմ հորինվածքով գավիթը (XII դարի վերջ), որի անկյունային միահարթ առաստաղներին բարձրաքանդակներ են (մարդկանց
         պատկերներ, վարդյակներ, թռչուն, հրեշտակ ևն, նաև արձանագրություններ)։ Գավթի հարավային պատի մոտ պահպանվել են գերեզմանադամբարանների մնացորդներ։ 
         Սուրբ Գրիգոր եկեղեցուն հյուսիսից կից է թաղածածկ մատուռ (XIII դար), իսկ դեպի արևելք շատ մոտ կանգնած է նրբագեղ մանրամասներով, կապտավուն 
         բազալտից կառուցված Սուրբ Ստեփանոս գմբեթավոր եկեղեցին (1244)։
    
    
    Սրբապատկեր Հաղարծին վանական համալիրի Սուրբ Աստվածածին եկեղեցում
    Համալիրի գլխավոր Սուրբ Աստվածածին եկեղեցին գմբեթավոր դահլիճ տիպի է։ Ըստ հարավային մուտքի ճակատակալ քարի արձանագրության՝ կառուցվել է
     1281-ին, սակայն հարավային և հյուսիսային պատերի ստորին մասի վերաշարվածքը, արևելյան ճակատի բարձրաքանդակում պատկերված եկեղեցու մանրակերտի
      տարբերվելը ներկայիս կառույցից և, ենթադրել են տալիս, որ 1281-ին կառույցը որոշ փոփոխություններով վերականգնվել է՝ հիմնարկված լինելով 
      հավանաբար X-XI դդ․։ Ճակատները (բացառությամբ արևմտյանի) ունեն հայկական խորշեր։ Բարձր, բոլորակ թմբուկը պարուրված է դեկորատիվ խորաններով։
       Մուտքերը, լուսամուտներն ու որմերը չափավոր զարդարված են պարզ բեկվածքավոր քիվագոտիներով, խաչերով ևն։ Արևմտյան ճակատի դիմաց ավերված շինության
        (հավանաբար նախորդ կառույցի գավիթը) մնացորդներ են։

    Հաղարծինի վանքը գտնվում է Տավուշի մարզի անտառներում և ներկայացնում է բնության և ճարտարապետության աննկարագրելի խառնուրդ:
     Այն հիմնադրվել է 10-11-րդ դարերում, թեեւ նոր եկեղեցիներ են ավելացվել է 12-13-րդ դարերում: Այժմ այն բաղկացած է Սբ. Գրիգոր, Սուրբ Աստվածածին
      (Սուրբ Աստուածածին), Սբ. Ստեփանոս եկեղեցիներից ու այլ տնտեսական շենքերից: Սեղանատունը շնորհիվ իր հմուտ ճարտարապետական կազմի իրենից
       ներկայացնում է մեծ հետաքրքրություն: Հսկայական կաղնու ծառը, որն ունի գրեթե վանքի տարիքը, լրացնում է ամբողջ տեսարանը: `,
      img: "https://onewaytour.com/wp-content/uploads/2019/08/5.jpg",
      photo: "https://busvoyage.am/wp-content/uploads/2018/06/haghartsin-armenia.jpg"
    },
    {
      name: "Նորավանք",
      titel: "Նորավանք",
      description: `Նորավանք (Ամաղու Նորավանք), Հայ առաքելական վանական համալիր, որը կառուցվել է 13-ից 14-րդ դարերում։ Գտնվում է Հայաստանի Վայոց
     ձորի մարզում՝ Ամաղու գյուղից 3 կմ հյուսիս-արևելք։ Ըստ Ստեփանոս Օրբելյանի՝ արդեն վաղ միջնադարից հանդիսացել է սրբատեղի։

    Նորավանքի վանական համալիրը բաղկացած է Սուրբ Աստվածածին (Բուրթելաշեն) դամբարան-եկեղեցուց, Սուրբ Ստեփանոս Նախավկա եկեղեցուց, նրան 
    արևմուտքից կից գավթից, Սուրբ Գրիգոր եկեղեցուց (Ստեփանոս Օրբելյանի դամբարան), միջնադարյան մատուռների և շինությունների մնացորդներից,
     նորակառույց վանատնից։
     Նորավանքը Հայաստանի միջնադարյան հոյակերտ հուշարձաններից մեկն է, որն առանձնանում է նաև իր բնական գեղատեսիլ միջավայրով։ Վկայություններ կան,
      որ այստեղ սրբատեղի է եղել հնագույն ժամանակներից։ Վանքը հիմնադրվել է ավելի վաղ գոյություն ունեցած երկու եկեղեցիների տարածքում՝ 12-րդ դարում 
      և կառուցապատվել հիմնականում 13-14-րդ դարերում։ Նորավանքի պատմության հետ կապված են ժամանակաշրջանի հայտնի եկեղեցական և քաղաքական գործիչների 
      անուններ։ Նորավանքում են ապրել, ստեղծագործել և այստեղ են թաղված միջնադարյան Հայաստանի նշանավոր գործիչներ ու ստեղծագործողներ։
     Նորավանքը հիմնադրել է Վահանավանքի (Կապանի մերձակայքում) վանահայր Հովհաննես եպիսկոպոսը, ով 1105 թվականին այստեղ հաստատվելով՝ ընդարձակել
      է վանքապատկան տարածքները, հավաքել ճգնակյաց վանականների, սելջուկ տիրակալներից հրամանագրեր վերցրել Նորավանքը եպիսկոպոսանիստ ճանաչելու 
      վերաբերյալ։ Հաջորդ երկու դարերի ընթացքում Նորավանքն ընդլայնվել է՝ շնորհիվ Սյունիքում իշխող Օրբելյանների եկեղեցանպաստ գործունեության,
       ու դարձել հոգևոր, կրթական ու մշակութային կենտրոն և Օրբելյանների տոհմական գերեզմանատունը։
     1238 թվականին վանքը թալանվել է մոնղոլների կողմից, սակայն, Աղա Խանի և Օրբելյան Էլիկում իշխանի միջև կնքված հաշտությամբ խաղաղություն է
      հաստատվել, որը հնարավորություն է ընձեռել վերակառուցելու վանքը և ծաղկուն գործունեություն ծավալել մինչև ԼենկԹեմուրի արշավանքները՝ 14-րդ 
      դարի վերջում։
     Նորավանքը ժամանակի մշակութային խոշոր կենտրոն էր՝ սերտորեն կապված հոգևոր ու կրթական այնպիսի կենտրոնների հետ, ինչպիսիք էին Գլաձորի համալսարանը,
      Տաթևի վանքը և այլն։ Նորավանքում որոշ ժամանակ գործել է ժամանակի նշանավոր հոգևորական, աստվածաբան և պատմիչ, քաղաքական ու մշակութային գործիչ 
      Ստեփանոս Օրբելյանը՝ հեղինակը «Պատմութիւն նահանգին Սիսական» աշխատության (1299 թվականին)։
      Վանքի պատմությունն անբաժանելի է միջնադարյան Հայաստանի նշանավոր ճարտարապետ և քանդակագործ Մոմիկի գործունեությունից (1259–1333 թթ.)։ 
      Մոմիկը որպես մանրանկարիչ ծաղկող սկսել է ստեղծագործել Կիլիկիայում, ուր ծանոթացել է խաչակիրների տարածած ուշ գոթական արվեստին։ Հավանաբար 
      1286 թվականին Կիլիկիա այցելության ժամանակ Ստեփանոս եպիսկոպոս Օրբելյանն է Մոմիկին հրավիրել Վայոց Ձոր, ուր նա շուտով ճանաչվում է հատկապես 
      որպես քանդակագործ-խաչքարագործ։

      Մոմիկը Արենիի Սուրբ Աստվածածին եկեղեցու (1321 թվական) ճարտարապետն ու քանդակագործն է։ Նրա նրբաճաշակ հարթաքանդակները զարդարում են Նորավանքի
       գավթի մուտքի ճակատակալ քարերը։ Մոմիկի կանգնեցրած խաչքարերը համալրել են թե՛ Արենիի Սուրբ Աստվածածին եկեղեցու, և թե՛ Նորավանքի համալիրի 
       տարածքները։ Այդ խաչքարերը մինչ օրս անկրկնելի են իրենց գեղարվեստական ու ոճական կատարմամբ։ Ընդունված է Մոմիկի վերջին աշխատանքներ համարել
        Նորավանքի վանական համալիրի հարավ-արևելյան մասում գտնվող Սուրբ Աստվածածին երկհարկ եկեղեցի-դամբարանը (Բուրթելաշեն), եկեղեցու արևմտյան և
         հարավային պատերին արտաքուստ արված երկու գեղաքանդակ հարթաքանդակները, ինչպես նաև կառույցի հարավային հատվածում գտնվող փոքրիկ, պարզ խաչքարը,
          որը կանգնեցված է իր իսկ հիշատակին և Մոմիկի խաչքար-մահարձանն է։
      
      Սուրբ Ստեփանոս Նախավկա գմբեթավոր եկեղեցին համալիրի գլխավոր կառույցն է (1840 թվականին երկրաշարժից կործանված գմբեթը ներկայումս
         վերակառուցված է)։ Միակ արևմտյան մուտքով եկեղեցին կապվում է գավթին, որը Սմբատ Օրբելյանի նախաձեռնությամբ 1261 թվականին վերանորոգվել է 
         Սիրանես ճարտարապետի կողմից։ Հետագայում՝ 1321 թվականին երկրաշարժից կառույցը կրկին վնասվել է և կրկին վերակառուցվել՝ ամենայն
          հավանականությամբ Մոմիկի կողմից, որն այդ ժամանակ արդեն ավարտել էր Արենիի եկեղեցու աշխատանքները։
      Մինչև 20-րդ դար Նորավանքի համալիրը տուժել է ժամանակի աղետներից, հարձակումներից, երկրաշարժերից։ 1948-1949 թվականներին վերականգնվել են 
      Սուրբ Աստվածածին Բուրթելաշեն երկհարկ դամբարան-եկեղեցու ծածկերը և պատերի վերնամասերը։
      
      1980-ական թվականների սկզբին նախաձեռնված ամբողջական վերականգնողական աշխատանքներն ավարտվել են 2001 թվականին։

    Հարյուրավոր քարանձավներով պատված ժայռերի կիրճը տանում է դեպի մի տեսարան, ուր ներկայացված է ճարտարապետության ու բնության
     ներդաշնակությունը: Հրաշալի ճարտարապետական լուծումներով ու շքեղ զարդաքանդակներով օծված այս վանքային համալիրը 13-րդ դարի հայ ճարտարապետության 
     փայլուն օրինակներից է: Նորավանքը բաղկացած է Սբ. Կարապետ, Սբ. Լուսավորիչ եկեղեցիներից եւ իր ձեւերի կատարելությամբ աչքի ընկնող Սբ. Աստվատծածին
      կրկնահարկ եկեղեցուց:`,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/noravanq-armenia.jpg",
      photo: "https://toursector.com/wp-content/uploads/2020/04/2-min.jpg"
    },
    {
      name: "Հաղպատ",
      titel: "Հաղպատ",
      description: `Հաղպատ, հայկական առաքելական վանական խոշոր համալիր Հայաստանի Լոռու մարզի Հաղպատ գյուղում։

    Այն եղել է միջնադարյան Հայաստանի հոգևոր, մշակութային և գիտաուսումնական խոշոր կենտրոն։
    
    Սանահինի վանքային համալիրի հետ միասին համարվում է ՅՈՒՆԵՍԿՕ-ի համաշխարհային ժառանգության օբյեկտ։
    Հաղպատ անվանման հետ կապված են բազմաթիվ լեգենդներ, նրանցից մեկի համաձայն Սանահինի իշխաններից մեկը հրավիրում է իր մոտ ճանաչված 
    մի վարպետի՝ վանք կառուցելու համար։ Վարպետը ներկայանում է իշխանին որդու հետ։

Աշխատանքի ընթացքում վեճ է առաջանում հոր և որդու միջև։ Ենթավարպետներից մեկը բռնում է որդու կողմը։ Այսպես, կռվելով հոր հետ, որդին թողնում է
 աշխատանքը, վեր է կենում և հեռանում։ Ճանապարհին, մի ուրիշ իշխան վարձում է նրանց՝ իր վանքը կառուցելու պատվերով։ Երբ որդու բարձրացրած պատերը 
 հասնում են այնքան, որ տեսանելի են դառնում Սանահինից, աշխատավորները հաղորդում են դրա մասին ծեր վարպետին։ Ոչ աշխատանքային օրը նա որոշում է
  այցելել որդու շինարարությունը, մոտենում է կիսասարք վանքի պատին և երկար զննում այն։ Բոլորը լուռ սպասում էին ծեր վարպետի գնահատականին։ 
  Վերջապես, նա հրեց շարվածքի քարը և ասաց. «Հախ պատ»։ Այստեղ հայր և որդի գրկախառնվեցին և հաշտվեցին։ Իսկ վանքին մնաց «Հաղպատ» անվանումը։ 
  Վանքի առաջին՝ Սուրբ Նշան եկեղեցին և միաբանությունը 976 թվականին հիմնադրել են Աշոտ Գ Բագրատունի[3] թագավորը և նրա կին Խոսրովանույշը[4]՝ 
  իրենց որդիներ Կյուրիկեի (Գուրգենի) և Սմբատի արևշատության համար։ Հիմնադիր վանահայրն է եղել Սիմեոնը, որը Տիրանուն երեցի հետ ղեկավարել է եկեղեցու
   շինարարությունը (ավարտը՝ 991 թվականին) և հիմնել վանքի հոգևոր դպրոցը։ Սանահինի վանքից և այլ վայրերից հրավիրվել են գիտնական և ուսուցիչ վանականներ,
    և շուտով Կյուրիկյան թագավորության այս երկու վանքերում միաբանների ընդհանուր թիվը հասել է 500-ի։ 11-րդ դարի 1-ին քառորդում Սուրբ Նշան եկեղեցու 
    հյուսիսային պատին կից կառուցվել են երկու մատուռ-տապանատներ (1005-1020), Սուրբ Գրիգոր եկեղեցին (1005) և վանքի նախնական պարիսպը։ 11-րդ դարում
     կառուցվել է նաև գրատունը, որի փայտե ծածկը հետագայում վերաշինվել է քարով։

1064 թվականին Տաշիր-Ձորագետի թագավոր Կյուրիկե Ա Բագրատունին, ճանաչելով սելջուկ թուրքերի գերիշխանությունը, կարողացել է կիսանկախ վիճակում պահպանել
 թագավորությունը և նրա հոգևոր կենտրոնները։ Նույն ժամանակ նա եպիսկոպոսական աթոռը Սանահինից տեղափոխել է Հաղպատ, որտեղ 1081 թվականին օժանդակել է
  Անի-Շիրակի եպիսկոպոս Բարսեղին՝ օծվելու կաթողիկոսական տեղապահ (1105-1113 թվականներին՝ Ամենայն հայոց կաթողիկոս Բարսեղ Ա Անեցի)։ Հաղպատում
   Կյուրիկյան թագավորության եկեղեցական թեմի առաջնորդ է կարգվել Սարգիս եպիսկոպոսը։ 1105 թվականին Ղըզըլ ամիրան հարձակվել, ավերել և կողոպտել է 
   մի շարք բնակավայրեր և վանքեր, այդ թվում՝ Սանահինի և Հաղպատի միաբանությունները։ 
    Սանահինից ոչ շատ հեռու գտնվող եկեղեցական այս համալիրն իր որոշակի տեղն ունի հայ ժողովրդի պատմա-մշակութային կյանքում: 
    Այն կառուցվել է Աշոտ Երրորդ Բագրատունու իշխանության տարիներին: Հաղպատի գրատանը տարիներ շարունակ գրվել ու մանրանկարազարդվել են 
    բազմաթիվ մագաղաթներ: 18-րդ դարում այստեղ էր ապրում եւ ստեղծագործում հայտնի բանաստեղծ, աշուղ Սայաթ-Նովան: Իր յուրօրինակ ճարտարապետական 
    մտահղացմամբ հիացնում է Հաղպատի զանգակատունը:`,
      img: "https://www.landofnoah.com/uploads/0000/18/2021/07/03/sanahin-0.jpg",
      photo: "https://busvoyage.am/wp-content/uploads/2018/06/haghpat-armenia.jpg"
    },
    {
      name: "Ամբերդ",
      titel: "Ամբերդ",
      description: `Ամբերդ, Ամպիր, Անբերդ, Համբերդ, Հանբերդ, Ղըզղալա, միջնադարյան նախկին բերդաքաղաք և ամրոց։ Կառուցվել է 11-13-րդ դարերում, 
    Արագած լեռան հարավային լանջին՝ Բյուրական գյուղից 7 կմ հյուսիս։ Տեղադրված է եռանկյունաձև հրվանդանին, ծովի մակերևույթից 2300 մետր բարձրության
     վրա՝ Արքաշեն և Ամբերդ գետերի միացման տեղում։
     մբերդում ամրոց է եղել դեռևս վաղնջական ժամանակներից։ Ամբերդի տարածքում կան կիկլոպյան շինությունների մնացորդներ, իսկ մոտակայքում՝
      վիշապաձկների քարակոթողներ։ Բրոնզի դարում կառուցվել է ուրարտական բերդաքաղաք, հավանաբար տեղանքի բնական ամրության պատճառով։ Որպես 
      բերդ-ամրոց այն հատկապես հայտնի էր հելլենիստական ժամանակաշրջանում և Քրիստոսի ծնունդից հետո, երբ այն կառուցվել է՝ հետագայում ընդարձակվելով 
      և պարբերաբար վերանորոգվելով։

     Դղյակը և պարսպի որոշ հատվածներ կառուցվել են Կամսարական իշխանների կողմից, հավանաբար 7-րդ դարում։ Դա կապվում է ինչ-որ եկեղեցուց պեղումների 
     ժամանակ գտնված ճարտարապետական դետալի հետ, որի թվագրման հետ կապված խնդիրներ կան։ Դժվարամատչելի տեղերում ամրոցներ սկսեցին կառուցել 10-րդ դարից,
      երբ փոփոխվում էր երկրի պաշտպանական համակարգը։ Ինչ վերաբերում է Ամբերդին, ապա ներկայիս ամրությունը 11-13-րդ դարի կառույց է։
     
     
     Ամրոցի ընդհանուր տեսք
     Ամբերդ ամրոցն 8-րդ դարում անցել է Բագրատունիներին՝ հետագայում դառնալով Բագրատունիների թագավորության կարևորագույն ռազմական պատվարներից մեկը։ 
     10-րդ դարում Բագրատունի արքաներն այն հանձնել են հայոց զորքերի սպարապետներ Պահլավունի իշխաններին։ Դրա մասին վկայում է Անիի վարդապետ Գրիգոր 
     Մագիստրոս Պահլավունու մոտ 1050 թվականին գրված նամակը, որում նշվում է, որ 10-րդ դարի սկզբին բերդը և մերձակա շինությունները պատկանում էին 
     հզոր Պահլավունի իշխաններին։ 1045 թվականին Անիի Բագրատունիների թագավորության կործանումից երկու տարի անց՝ 1047 թվականին, բյուզանդական զորքերը 
     գրավեցին Ամբերդը։ 11-րդ դարի 70-ական թվականներին Ամբերդը գրավեցին սելջուկ-թուրքերը և այն դարձրեցին զորակայան։
     
     1196 թվականին Զաքարե և Իվանե Զաքարյանները, ջախջախելով Գանձակի ամիրայության ռազմական ուժերը, ազատագրում են Ամբերդը և այն հանձնում իրենց 
     զորավարներից մեկին՝ Վաչե Վաչուտյանին, որն այն դարձնում է իր իշխանանիստը։ Զաքարյանները Ամբերդի՝ սելջուկներից ազատագրելու կապակցությամբ
      մի խաչքար են կանգնեցրել, իսկ ամրոցում թողել արաբերեն արձանագրություն։ Վաչե Վաչուտյանն ու նրա կին Մամախաթունը մեծ գործունեություն ծավալեցին ի 
      նպաստ ամրոցի մերձակայքում գտնվող Տեղերի վանքի, Սաղմոսավանքի և Հովհանավանքի։
     
     1236 թվականին Ամբերդը գրավվել և ավերվել է մոնղոլների կողմից։ 13-րդ դարի վերջին Վաչուտյանները վերակառուցել են ամրոցը։ Ամբերդը վերջնականապես
      կործանվել է Լենկթեմուրի արշավանքների ժամանակ՝ 14-րդ դարի վերջին և այլևս չի վերականգնվել։
    Գտնվել է Մեծ Հայքի Այրարատ նահանգի Արագածոտն գավառում, իսկ ներկա վարչական բաժանման համաձայն՝ Արագածոտնի մարզում՝ մայրաքաղաք Երևանից 55
     կիլոմետր դեպի հյուսիս։
     Ամբերդ անունը ծագել է աղավաղման հետևանքով, նախնական անունը եղել է Անբերդ։ Ամբերդ անունը բացատրվում է որպես ամպի բարձրության բերդ, 
     կից-բերդ։ Հանդիպում է նաև Անբերդ տարբերակը՝ անառիկ, անմատչելի բերդ։ Կոչվել է նաև Հանբերդ, Համբերդ, Ղըզղալա անուններով։
    Միջնադարյան Հայաստանի ամրոցաշինության սկզբունքային գծերն իրենց վառ արտահայտությունն են գտել այս ամրոցում:
     Կառուցված լինելով բնականորեն լավ պաշտպանված բարձունքի վրա՝  Ամբերդը երկար ժամանակ ծառայել է որպես ռազմական կարևոր հենակետ: 
     Աշխարհիկ նշանակություն ունեցող այս ամրոցի բաղկացուցիչ մասն է հանդիսանում 1026 թ. Վահրամ Պահլավունու կողմից կառուցված եկեղեցին:`,
      img: "https://upload.wikimedia.org/wikipedia/commons/3/30/Amberd_fortress%2C_Aragatsotn_Province%2C_Armenia._DSCF2563-2.jpg",
      photo: "https://busvoyage.am/wp-content/uploads/2018/06/amberd-armenia.jpg"
    },
    {
      name: "Էջմիածին",
      titel: "Էջմիածին",
      description: `Էջմիածնի Մայր տաճար, Հայ Առաքելական եկեղեցու Էջմիածնի կաթողիկոսության գլխավոր կրոնական կառույցը : Գտնվում է Հայաստանի Արմավիրի
     մարզի Վաղարշապատ քաղաքում: Ըստ գիտնականների՝ անտիկ Հայաստանի առաջին Մայր տաճարն է (բայց ոչ առաջին եկեղեցին) և համարվում է աշխարհի ամենահին
      Մայր տաճարներից մեկը:

    Եկեղեցին կառուցվել է չորրորդ դարի սկզբին՝ 301-303 թվականներին՝ քրիստոնեությունը որպես պետական կրոն ընդունելուց հետո, Գրիգոր Լուսավորչի
    
    կարգադրությամբ։ Կառուցվել է նախապես գոյություն ունեցող տաճարի տեղում՝ խորհրդանշելով հեթանոսությունից քրիստոնեության անցումը։ Ներկայիս 
    կառույցի հիմնական մասը կառուցել է Վահան Մամիկոնյանը 483/4 թվականներին՝ պարսկական ներխուժման ժամանակ խիստ վնասվելուց հետո։ Կառուցումից
     մինչ հինգերորդ դարի երկրորդ կեսը տաճարը Ամենայն Հայոց Կաթողիկոսների նստավայրն էր։
    
    1441 թվականին Վաղարշապատում գումարվեց Ազգային Եկեղեցական Ժողով և որոշում կայացվեց Ամենայն Հայոց Կաթողիկոսությունը Մայր Աթոռ Սուրբ Էջմիածնին
     վերադարձնելու վերաբերյալ։ Այդ ժամանակից մինչ այժմ Մայր Աթոռ Սուրբ Էջմիածինը եղել է Հայ եկեղեցու վարչական կենտրոնը։ Հետագայում տաճարը 
     ենթարկվել է մի շարք վերանորոգումների։ 1604 թվականին, իրենց երկրի հանդեպ հայերի նվիրվածությունը թուլացնելու համար, Աբբաս I Սեֆին թալանել է 
     Էջմիածինը՝ տաճարից մասունքներ և քարեր տանելով։ Զանգակատները կառուցվել են 17-րդ դարի երկրորդ կեսին։ 1868 թվականին տաճարի արևելյան մասում 
     կառուցվել է ավանդատուն։ Այսօր տաճարը ներառում է հայկական ճարտարապետության տարբեր ժամանակաշրջանների ոճեր։ Թուլանալով Խորհրդային շրջանում՝
      Էջմիածինը վերակենդանացել է 20-րդ դարի երկրորդ կեսին և անկախ Հայաստանի օրոք։
    
    Լինելով հայության մեծամասնության հոգևոր կենտրոնը՝ Էջմիածինը Հայաստանի ոչ միայն կրոնական, այլև քաղաքական, տնտեսական և մշակության կարևոր 
    կենտրոններից է եղել։ Այս խոշոր ուխտատեղին Հայաստանի ամենաայցելվող վայրերից է։ Տաճարը, շրջակայքի որոշ կարևոր վաղ միջնադարյան եկեղեցիների 
    սհետ միասին 2000 թվականին ընդգրկվել են ՅՈՒՆԵՍԿՕ-ի համաշխարհային ժառանգության ցանկում։
    
    
    Երեւանից 20 կմ հեռավորության վրա է գտնվում Հայ Առաքելական եկեղեցու կենտրոնը՝ Էջմիածինը:
     Էջմիածնի Մայր Տաճարը հիմնադրվել է 4-րդ դարի սկզբին եւ աշխարհի հնագույն եկեղեցիներից է:
      Ըստ ավանդության եկեղեցին կառուցվել է այն տեղում, որտեղ մատնանշել է Գրիգոր Լուսավորչի երազում հայտնված Աստծո Որդին: 
      Այստեղից էլ առաջացել է Էջմիածին անունը: Եկեղեցու պատերը ներսից ամբողջովին զարդարված են Հովնաթանյան ընտանիքի նկարիչների 
      բարձրարվեստ որմնանկարներով: Մայր Տաճարի հարակից տարածքում են գտնվում նաեւ կաթողիկոսի նստավայրն ու հոգեւոր ճեմարանը:`,
      img: "https://www.busvoyage.am/wp-content/uploads/2018/06/Ejmiatsin-armenia.jpg",
      photo: "https://ejmiatsin.am/media/main/2020-09/main_33_2020-09-15_13-36-21-55.jpg"
    },
    {
      name: "Խոր Վիրապ",
      titel: "Խոր վիրապի վանք",
      description: `Խոր Վիրապ, Խոր վիրապի վանք, ճարտարապետական հուշարձան, 17-րդ դարի վանք-ամրոց Մեծ Հայքի Այրարատ նահանգի Ոստան Հայոց գավառում,
     Արաքս գետի ձախ կողմում Լուսառատ գյուղի մոտակայքում, պատմական Արտաշատ քաղաքի բլուրներից մեկի վրա (այժմ՝ Հայաստանի Արարատի մարզի Լուսառատ 
      գյուղից մոտ 1 կմ հյուսիս-արևմուտք)։ Եղել է Հայոց հանրահայտ ուխտատեղիներից՝ կապված Գրիգոր Լուսավորչի անվան հետ։
      Վիրապը օձերով, թունավոր միջատներով լի մի խոր փոս էր, ուր գցում էին դատապարտյալին։ Ըստ Ագաթանգեղոսի՝ Տրդատ 3-րդ Մեծը քրիստոնյաների հալածանքի
       շրջանում Գրիգոր Լուսավորչին նետել է Արտաշատի արքունական բանտի գուբը, որտեղ Լուսավորիչն անցկացրել է մոտ 14 տարի։ Եւ այդ տարիների ընթացքում 
       Տրդատ 3-րդ Մեծը մահացու հիվանդությունով վարակվում է։ Տրդատի քույրը երազ է տեսնում, որ նրան միայն Գրիգոր Լուսավորիչը կարող է բուժել։ Տրդատը
        հրամայում է արձակել նրան։ Լուսավորիչը Խոր վիրապից դուրս գալուց հետո ստանալով արքայի աջակցությունը, քրիստոնեությունը դարձնում է պետական կրոն։


      Մոտ 642 թվականին Ներսես Գ կաթողիկոսը սրբազան վիրապի վրա կանգնեցրել է մի մատուռ, որը, ճարտարապետ Մ. Մնացականյանի կարծիքով, 10-րդ դարի արաբ
       պատմիչ Ալ-Մուկադդասիի նկարագրած՝ սպիտակ կրաքարից, ներսում 8 սյուներով, բոլորաձև կենտրոնակազմ կառույց է։ Մատուռը իր ծավալատարածական
        կոմպոզիցիայով և կառուցվածքային սկզբունքով որոշ նմանություն է ունեցել Զվարթնոցին։ Ավերված շինության տեղում 1662 թվականին կառուցվել է
         թաղածածկ մատուռ, որը կանգուն է մինչև օրս։ Մատուռի Ավագ խորանից աջ գտնվող մտոցը ուղղաձիգ աստիճանների (ներկայիս՝ մետաղյա) միջոցով տանում է
          ներքնահարկ, ուր 4, 4 մ տրամագծով, 6 մ խորությամբ, գմբեթանման գոգավոր ծածկով վիրապն է։ Կոմպլեքսից կիսավեր պահպանվել են նաև բուրգավոր
           պարիսպը, որի պատերի երկայնքով տեղադրված են սեղանատուն, խուցեր և այլ օժանդակ վանքային կառույցներ։ Պարսպից ներս, կենտրոնում, Ս. Աստվածածին
            գլխավոր եկեղեցին է, որին արևմուտքից կից է զանգակատունը։
      
      13-րդ դարից սկսած Խոր Վիրապը բացի կարևոր սրբատեղի լինելուց, դարձել է կրթության և գիտության համահայկական կենտրոն. 1255 թ. Վարդան Արևելցին
       վանքում հիմնում է բարձրագույն դպրոց, որի նշանավոր սաներից են դառնում Վարդան Արևելցին, Եսայի Նչեցին, Հովհաննես Երզնկացին, Գևորգ Սկևռացին, 
       Ներսես Մշեցին, որը հետագայում Խոր Վիրապի դպրությունը բարձրացրեց նոր մակարդակի։
      
      16-րդ դարում Հայաստանի քաղաքական և տնտեսական ծանր դրության պատճառով վանքի շինությունները վնասվում են։ 1666-1669 թվականներին Դավիթ վրդ.
       Վիրապեցին կառուցում է վանքի պարիսպները և ներսում գտնվող շինությունները։
      
      1669 թվականին սկսվել են վիրապից հողահանության աշխատանքները և դրա վրա 14-րդ դարում կառուցված մատուռի փոխարեն Սուրբ Գրիգոր եկեղեցու կառուցումը։
       Վիրապն ունի մոտ 4.5 մ տրամագիծ և 6.5 մ խորություն։ Այն արտաքուստ գոտևորված է կրաքարե սալերով, ունի արձանագրություններ, բարձրաքանդակներ։
      
      1703 թվականին ավարտին է հասցվել կենտրոնական Սուրբ Աստվածածին եկեղեցու հիմնովին վերակառուցումը։ 19-րդ դարի վերջին այդ եկեղեցու արևմտյան
       ճակատին կից կառուցվել է սյունազարդ զանգակատունը։
      
      1970-1980-ական թվականներին Վազգեն Ա Ամենայն Հայոց Կաթողիկոսի ջանքերով նորոգվել են վանքի պարիսպները և այլ շինություններ։
      
    Խոր Վիրապը գտնվում է Արարատի մարզում: Այն Հայաստանում ամենահայտնի սրբավայրն է, քանի որ ուղղակիորեն կապված է
     այստեղ քրիստոնեության տարածման պատմության հետ: Հայաստանում քրիստոնեությունը որպես պետական կրոն հռչակվեց 301թ.՝
     շնորհիվ Գրիգոր Լուսավորչի ջանքերի: Սակայն մինչ Տրդատ 3-րդ թագավորին հավատափոխ անելը՝
      Լուսավորիչը բանտարկված է եղել ներկայիս Խոր Վիրապ վանքային համալիրի տարածքում գտնվող զնդանում: 
      17-րդ դարում կառուցված վանքային համալիրից բացվում է աննկարագրելի մի տեսարան դեպի Աստվածաշնչյան Արարատ լեռը:`,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/khor-viarap-armenia.jpg",
      photo: "https://app.conciergetravel.am/storage/1440/CONCIERGE-TRAVEL-(2).jpg"
    },
    {
      name: "Լաստիվեր",
      titel: "Լաստիվեր",
      description: `Լաստիվերը մի վայր է, որի գեղեցկության և առանձնահատկությունների մասին  դուք գուցե լսել եք, բայց դեռևս չունեք ոչ մի գաղափար,
     թե որտեղ է այն գտնվում: Մենք կօգնենք ձեզ այդ հարցում:

    Լաստիվերն առօրյա խնդիրներից խուսափելու և բնությանը մոտ գտնվելու համար հիանալի վայր է: Այնտեղ դուք կարող եք տեսնել քարանձավներ, որտեղ
     ժամանակին ճգնավորներ են ապրել: Քարանձավները հսկայական կիրճի եզրին են, և հնում այստեղ բարձրանալու համար մարդիկ ստիպված են եղել մեկը մյուսի վրա
      շարված գերաններից աստիճան կառուցել, որն ավելի շատ  նման էր լաստի, ոչ թե աստիճանի և այդ իսկ պատճառով այդ վայրը  ստացավ «Լաստիվեր» անվանումը:
       Մեկ այլ վարկածով՝ այստեղ բարձրացել են պարանով կապված փայտե հարթակի՝ լաստի միջոցով: Նստելով այդ տախտակին՝ քարանձավ բարձրացողը բղավել է.
        «Լաստն՝ ի վեր», այսինքն՝ լաստը բարձրացրեք դեպի վեր: Վերևից լսելով հրահանգը ու տեսնելով, որ կանչողը յուրային է՝ քաշել են պարանը դեպի
         քարանձավի մուտքը:
    Բացի այդ այնտեղ է գտնվում նաև «Լաստիվեր Անապատը», որտեղ կարող ենք տեսնել ծառերի վրա կառուցված բազմաթիվ գեղեցիկ խրճիթներ և տներ, որոնք
     ծառայում են որպես գիշերակաց զբոսաշրջիկների համար:
    
    Պետք է Տավուշի խիտ անտառներով իջնել
     Խաչաղբյուր գետի կիրճը, որտեղ էլ գտնվում է այդ թաքնված գանձը: Իսկ արահետի վերջում մեր առջև կբացվի Լաստիվերի ջրվեժի գեցեցիկ տեսարանը:
      Լաստիվերը հանրության համար առավել հայտնի դարձավ 2000-ականների սկզբին, երբ էկոտուրիզմի սիրահարները սկսեցին  արշավներ կազմակերպել դեպի
       Լաստիվեր:
    Տեղանքը թաքնված է սաղարթախիտ անտառի մեջ: Ժայռերի խորքից բխող գետը, սլացիկ ծառերը և ուղղաձիգ ժայռերը հեքիաթային են 
    դարձնում տեղի բնությունը:

    Տեղի Քարանձավում, XIII-XIVդդ. մոնղոլական արշավանքների ժամանակ, իր ապաստանն էր գտել բնակչությունը: Քարանձավը գտնվում է ձորի գրեթե
     ուղղաձիգ լանջի վրա: Նրան հասնելու համար մարդիկ ստիպված էին կառուցել աստիճան՝ մեկը մյուսի վրա շարված գերաններից:
      Կառույցը նմանվում էր լաստի, և այդ պատճառով քարանձավը մնաց ժողովրդի հիշողության մեջ «Լաստիվեր» անունով:
    
    Ձորի ներքևում աղմկում է մի հիասքանչ ջրվեժ, որը տեղանքի բնության անբաժանելի մասն է կազմում:
    
    Այժմ Լաստիվերին հարակից տարածքում զարգացում են ապրում ժամանակակից տուրիստական կենտրոնները՝ իրենց ծառայություններն առաջարկելով 
    էքստրեմալ տուրիզմի սիրահարներին: `,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/lastiver-armenia.jpg",
      photo: "https://patmakanhetq.com/wp-content/uploads/2020/03/%D4%BC%D5%A1%D5%BD%D5%BF%D5%AB%D5%BE%D5%A5%D6%80-5-%D5%8A%D5%A1%D5%BF%D5%B4%D5%A1%D5%AF%D5%A1%D5%B6-%D5%80%D5%A5%D5%BF%D6%84.jpg?x76888"
    },
    {
      name: "Օրբելյանների իջևանատուն",
      titel: "Օրբելյանների իջևանատուն",
      description: `Սելիմի իջևանատուն, այժմ՝ Օրբելյանների իջևանատուն Մեծ Հայքի Սյունիք աշխարհի Վայոց ձոր գավառում՝ Եղեգնաձոր-Մարտունի ավտոճանապարհին։
     Գտնվում է Սելիմ լեռան վրա (ծովի մակերևույթից 2410մ)։ 5 կմ հեռավորության վրա 2829 մ բարձրություն ունեցող Արմաղան լեռն է։

    Միջնադարում շինությունների մեծ մասը կառուցվում էր առևտրային ճանապարհներին, ինչն առավել հարմար էր ճանապարհորդողների համար։ Օրբելյանների 
    քարավանատունը հյուրընկալություն է առաջարկել ճանապարհորդներին, ովքեր անցել են մայրուղու երկայնքով և Վարդենյաց լեռնանցքով։ Վերջինս Հայաստանի 
    միջնադարյան բոլոր լեռնանցքներից լավագույն պահպանվածն է։
    
    Վարդենյաց լեռնանցքում գտնվող 14-րդ դարի այս քարավանատունը ի թիվս նման մի շարք այլ շինությունների որպես իջևանատուն է ծառայել Մետաքսի 
    ճանապարհի Հայաստանով անցնող առևտրականների համար։ Հայտնի է, որ Մարկո Պոլոն անցել է այս տարածքով և նկարագրել է թե ինչպես էին հայերը
     ապրում դժվարանցանելի լեռների մեջ։
     Սելիմի իջևանատուն, այժմ՝ Օրբելյանների իջևանատուն[3] Մեծ Հայքի Սյունիք աշխարհի Վայոց ձոր գավառում՝ Եղեգնաձոր-Մարտունի ավտոճանապարհին։ 
     Գտնվում է Սելիմ լեռան վրա (ծովի մակերևույթից 2410մ)։ 5 կմ հեռավորության վրա 2829 մ բարձրություն ունեցող Արմաղան լեռն է։

     Միջնադարում շինությունների մեծ մասը կառուցվում էր առևտրային ճանապարհներին, ինչն առավել հարմար էր ճանապարհորդողների համար։
      Օրբելյանների քարավանատունը հյուրընկալություն է առաջարկել ճանապարհորդներին, ովքեր անցել են մայրուղու երկայնքով և Վարդենյաց լեռնանցքով։ 
      Վերջինս Հայաստանի միջնադարյան բոլոր լեռնանցքներից լավագույն պահպանվածն է։
     
     Վարդենյաց լեռնանցքում գտնվող 14-րդ դարի այս քարավանատունը ի թիվս նման մի շարք այլ շինությունների որպես իջևանատուն է ծառայել Մետաքսի ճանապարհի
      Հայաստանով անցնող առևտրականների համար։ Հայտնի է, որ Մարկո Պոլոն անցել է այս տարածքով և նկարագրել է թե ինչպես էին հայերը ապրում
       դժվարանցանելի լեռների մեջ։
       Հիմնականում կանգուն մնացած և հստակ թվագրված քարավանատունը ՀՀ տարածքում պահպանված այն փոքրաթիվ հուշարձաններից է, որի գոյությունը խոսուն
        վկայությունն է Չինաստանից դեպի Միջերկրականի ափերը ձգվող միջնադարյան «Մետաքսի ճանապարհային մշակույթում» Հայաստանի ակտիվ ներգրավվածության 
        մասին՝ լրացնելով հայ և օտար մատենագիր աղբյուրներից հայտնի առևտրային և մշակութային փոխհարաբերությունների մասին տվյալները։
        Հիմնականում կանգուն մնացած և հստակ թվագրված քարավանատունը ՀՀ տարածքում պահպանված այն փոքրաթիվ հուշարձաններից է, որի գոյությունը խոսուն 
        վկայությունն է Չինաստանից դեպի Միջերկրականի ափերը ձգվող միջնադարյան «Մետաքսի ճանապարհային մշակույթում» Հայաստանի ակտիվ ներգրավվածության
         մասին՝ լրացնելով հայ և օտար մատենագիր աղբյուրներից հայտնի առևտրային և մշակութային փոխհարաբերությունների մասին տվյալները։`,
      img: "https://busvoyage.am/wp-content/uploads/2020/01/orbelyanneri-ijevanatun-2048x1365.jpg",
      photo: "https://busvoyage.am/wp-content/uploads/2020/01/orbelyanneri-ijevanatun2.jpg"
    },
    {
      name: "Տաթև",
      titel: "Տաթևի վանք",
      description: `Տաթևի վանք, միջնադարյան վանական համալիր Հայաստանում։ Գտնվում է Սյունիքի մարզի Տաթև գյուղի հարավում՝ Որոտան գետի վտակի ձորի
     աջափնյա եզերքին։ Ավանդության համաձայն՝ վանքը կոչվել է Թադեոս առաքյալի աշակերտ Եվստաթեոսի անունով։

    Ըստ Ստեփանոս Օրբելյանի, ով հեղինակել է «Սիսական նահանգի պատմություն» աշխատությունը, Տաթևի վանքի առաջին եկեղեցին կառուցվել է 4-րդ դարում, 
    ունեցել անշուք տեսք, սակավաթիվ ճգնավոր միաբաններ։ 8-րդ դարի վերջին եղել է Սյունյաց եպիսկոպոսության աթոռանիստը։ Այստեղ են բերվել Քրիստոսի 
    խաչափայտի մասունքով արծաթե հսկա (մարդաչափ) «Բաբկենյան խաչը» (պատրաստել էր Բաբիկ իշխանի որդի Վասակը), Բյուզանդիայից՝ «Աստվածամուխ սուրբ Նշանը»,
     սուրբ Հովհաննեսի, սուրբ Ստեփանոս Նախավկայի, տասնմեկ առաքյալների, սուրբ Գրիգոր Ա Լուսավորչի, սուրբ Հռիփսիմեի մասունքները, Աստվածածնի մազերը։
    
    Կալվածքներ գնելու և նվիրատվությունների շնորհիվ վանքը դարձել է խոշոր ավատատեր։ 848 թվականին իշխան Փիլիպե Սյունին կառուցել է սուրբ Գրիգոր 
    Լուսավորիչ եկեղեցին։ Սյունյաց գահերեց իշխան Աշոտ Սյունու պատվերով Հովհաննես եպիսկոպոսը ձեռնարկել է հայկական ամենախոշոր եկեղեցիներից մեկի՝ 
    սուրբ Պողոս-Պետրոս տաճարի կառուցումը, ինչին օժանդակել է Շուշանիկ տիկինը։ Տաճարի հիմքը դրվել է 895 թվականին, շինարարությունն ավարտվել 906 
    թվականին։ Օծմանը ներկա են եղել Սմբատ Ա թագավորը, Վասպուրականի Գագիկ Արծրունի իշխանը, կաթողիկոս Հովհաննես Ե Դրասխանակերտցին, Աղվանից Սիմոն Բ
     կաթողիկոսը, հոգևոր ու ազնվական դասի ներկայացուցիչներ։ Բացվում է Տաթևի մատենադարանը։
    
    Սյունիքի թագավորության (987-1170) անկումից հետո Տաթևի վանքը որոշ ժամանակով ամայացել է, իսկ հոգևորականները տեղափոխվել են Նորավանք։
     Կարճ ժամանակ անց Վրաց թագավորության զորքերի գլուխ անցած՝ Զաքարե ամիրսպասալար և Իվանե աթաբեկ Զաքարյանները ազատագրում են հյուսիսարևելյան 
     Հայաստանը։ Սյունիքը, Արցախը, Այրարատը, Ուտիքի ու Գուգարքի մի մասը մտնում են Զաքարյան իշխանապետության կազմի մեջ։ Սյունիքի իշխաններ Օրբելյանները
      խթանում են վանքի հետագա զարգացումը։ 14-րդ դարում հիմնադրվում է Տաթևի համալսարանը, որը դառնում է գիտության խոշոր կենտրոն։ Դրան կից բացվում է
       Տաթևի մանրանկարչության դպրոցը։
    
    Ուշ միջնադարում և նոր ժամանակներում Տաթևի պարսպապատ վանքը ու նրան կից նորաբաց Տաթևի անապատը ունեցել են կարևոր ռազմավարական նշանակություն։ 
    1722-30 թվականներին Տաթևը եղել է Սյունիքի ազատագրական պայքարի, 1919-21 թվականներին՝ Զանգեզուրի ինքնապաշտպանության կարևոր օջախներից մեկը։
     1931 թվականին տեղի ունեցած երկրաշարժի հետևանքով եկեղեցական համալիրը գրեթե ամբողջությամբ ավերվել է, գետնին է հավասարվել Տաթևի համալսարանը,
      հողով ծածկվել վանքի մուտքը։ 1974-1998 թվականներին վանական համալիրի մեծ մասը վերականգնվել է. կիսակառույց են շարունակում մնալ զանգակատունը 
      և հարակից մի քանի կառույցներ, այդ թվում՝ պարիսպների մի մասը։
    
    2010 թվականին շահագործման է հանձնվում աշխարհի ամենաերկար հետադարձելի՝ ՏաԹևեր ճոպանուղին (5.7 կմ), որը նպաստում է տարածաշրջանի զբոսաշրջության
     զարգացմանը։
    
    Տաթևի վանքի վերականգնումը, վանական կյանքի վերածնունդը և վանքի կրթական նշանակության վերականգնումը «Տաթևի Վերածնունդ» նախագծի հիմնական
     նպատակներից է, որի մի մասն է կազմում նաև «ՏաԹևեր» ճոպանուղին։
     Տաթևի վանքի անվան հետ կապված կա երկու տարբերակ։ Դրանցից մեկի համաձայն, «Տաթև» անունը ծագում է հայերեն «տա թև» արտահայտությունից։
    Երկորրդ տարբերակի համաձայն՝ վանքը կոչվել է Թադեոս առաքյալի աշակերտ Եվստաթեոսի անունով։ Նա այս վայրերում տանջամահ է եղել, իսկ 4-րդ դարում 
    իր գերեզմանի վրա կառուցվել է եկեղեցի, որն օծել է սուրբ Գրիգոր Լուսավորիչը։ Բերդի պարիսպների ետևում պահպանվել են եկեղեցու ավերակները,
     որոնք հեռու չեն Տաթևի վանքին։
     Լենկ Թեմուրը կամեցել է հիմնահատակ կործանել Տաթևի վանքը և արմատախիլ անել նրա մոտ գտնվող շարժական Գավազան սյունը։ Դրա համար նա հրամայել
      է իր հրոսակներին լծել զույգ գոմեշ, գութանի շղթայով կապել սյունը և ձգել։ Հենց որ գոմեշները սկսում են ձգել, շղթան կտրվում է և նրանք տապալվում 
      են ձորը։ Տեսնելով այդ՝ Լենկ Թեմուրը հեռանում է Տաթևից։

     Գալով Տաթև՝ Լենկ-Թեմուրը կարգադրում է փայտ դիզել վանքի մեջ և այրել։ Կրակը ընկնում է նաև զանգակատունը և փչացնում զանգերը։ Դրանից հետո վանքի
      զանգերի ձայնը խզվում է։
    
    Զանգեզուրի ճարտարապետական կոթողների մեջ Տաթեւի վանքը չունի իր համազորը:
     Սա միջնադարյան Հայաստանի ամենահարուստ վանքային համալիրն է եղել: Բացի հոգեւոր կենտրոն լինելուց, 
     Տաթեւը եղել է նաեւ Սյունաց թագավորության քաղաքական կարեւոր հենակետ: Վանքի ռազմավարական ձեռնտու դիրքը եւ անառիկությունը
      նպաստավոր պայմաններ են ստեղծել այստեղ պաշտպանական ամուր կառույցներ ստեղծելու համար: Քաղաքական ոչ բարենպաստ պայմաններում 
      արտաքին աշխարհի հետ կապի միջոց էին ծառայում վանական համալիրի տարածքում եղած բազմաթիվ գաղտնուղիները: 2010թ բացվեց Տաթևի ճոպանուղին՝
       Տաթևերը (Տաթևի թևեր), որը հանդիսանում է աշխարհի ամենաերկար ճոպանուղին հետադարձ կապով:`,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/Tatev-armenia.jpg",
      photo: "https://i.pinimg.com/originals/58/73/cb/5873cb2bb6a2144f496b4a8247e6593d.jpg"
    },
    {
      name: "Սանահին",
      titel: "Սանահին",
      description: `
    Վանական համալիրի առաջին՝ Սուրբ Աստվածածին եկեղեցին կառուցվել է 10-րդ դարի 30-40-ական թվականներին (Աբաս Ա Բագրատունի թագավորի օրոք)։ 
    966 թվականին Աշոտ Գ Ողորմած թագավորն ու Խոսրովանույշ թագուհին կառուցել են Սուրբ Ամենափրկիչ եկեղեցին՝ իրենց որդիներ Կյուրիկեի (Գուրգենի) և
     Սմբատի արևշատության համար[4], հիմնադրել են միաբանություն և բարձրագույն կարգի հոգևոր դպրոց, հրավիրել եկեղեցականներ, գիտնական վարդապետներ, 
     գրիչներ։ Հիմնադիր վանահայրն էր Պոլիկարպոսը, որին հաջորդել է վարդապետ գիտնական Հովհաննեսը։
    
    979 թվականին Սմբատ Բ թագավորի հրովարտակով Սանահինի վանական համալիրը դարձել է նորակազմ Կյուրիկյան թագավորության եպիսկոպոսի աթոռանիստը
     (մինչև 11-րդ դարի կեսը), և Տաշիրքի թեմակալ է ձեռնադրվել Եսային։ Երևելի վանահայրերից էր «մեծ հռետոր» հռչակված Դիոսկորոս Սանահնեցին 
     (1039-1063)։
      Նրա օրոք կառուցվել են գրատունն ու Սուրբ Գրիգոր մատուռը, հոգևոր դպրոցը դարձել է ուսումնական մեծ կենտրոն, հարստացել է գրադարանը, գրվել, 
      ծաղկվել և ընդօրինակվել են բազմաթիվ ձեռագրեր։ Նրան աշակերտել, դպրոցում դասավանդել ու ստեղծագործել են գիտնական վանականներ Անանիա Սանահնեցին 
      և Հակոբոս Քարափնեցին։ Աստվածաբանությունից բացի դպրոցում դասավանդվել են փիլիսոփայություն, հռետորական արվեստ, երաժշտություն, բժշկություն,
       տոմարագիտություն և այլ գիտություններ։ Ըստ ավանդության՝ դպրոցում դասավանդել է նաև Գրիգոր Մագիստրոս Պահլավունին, նրա անունով էլ Սուրբ 
       Աստվածածին և Սուրբ Ամենափրկիչ եկեղեցիների միջև կառուցված սրահը կոչվել է «Մագիստրոսի ճեմարան»[5]։
    
    11-րդ դարի 2-րդ կեսին սկսված սելջուկյան արշավանքների ու նրանց տիրապետության ընթացքում, ինչպես նաև Կյուրիկյան թագավորության անկումից հետո 
    (1113) Սանահինի վանքը ապրել է տևական վատթար ժամանակաշրջան։ 12-րդ դարի վերջին Տաշիրք գավառի կազմում դառնալով Զաքարյան իշխանների սեփականությունը՝
     վանքը վերականգնել է իր դերը երկրի հոգևոր ու գիտամշակութային կյանքում։ Այդ շրջանում կատարվել են նաև լայնածավալ շինարարական աշխատանքներ։ 
     12-րդ դարի 80-ական թվականներից մինչև 13-րդ դարի 30-ական թվականներին կառուցվել են Սուրբ Ամենափրկիչ և Սուրբ Աստվածածին եկեղեցիների գավիթները, 
     զանգակատունը, գրատան արտաքին սրահը, հյուրատունը (չի պահպանվել), Զաքարյանների տոհմական դամբարանը, կանգնեցվել են Գրիգոր Տուտեորդու և Սարգսի 
     բարձրարվեստ խաչքարերը, նորոգվել Սուրբ Ամենափրկիչ եկեղեցին։ 12-րդ դարի վերջին Դեբեդ գետի վրա կառուցվել է Սանահինի նշանավոր կամուրջը, որով
      անցնում է վանք տանող ճանապարհը, իսկ գյուղում՝ աղբյուր։
    
    12–13-րդ դարերում Սանահինի վանքում հայտնի էին վանահայրեր Գրիգոր Տուտեորդին, Հովհաննես Խաչենցին (Զաքարե և Իվանե Զաքարյան իշխանների ուսուցիչը),
     Վարդանը։ Մեծ համբավ է ունեցել վանահայր Գրիգոր րաբունապետը, որի «Պատճառ լայն և նուրբ գրեանց, առեալ ի հարցն սրբոց և ի վարդապետաց» գիրքը ծառայել
     
     է նաև որպես ուսումնական ձեռնարկ։ Գրիգոր րաբունապետը վանքին նվիրել է 13 ձեռագիր, գրել այլ աշխատություններ։ Վանքի բնականոն գործունեությունը
      դարձյալ ընդհատվել է 1230-ական թվականներից սկսված մոնղոլական արշավանքների և նրանց տիրապետության ողջ ընթացքում։ 14-րդ դարի սկզբին թուլացել և 
      դարավերջին տրոհվել է Զաքարյանների իշխանական տունը, և Սանահին գյուղը շրջակայքով ու վանքով դարձել նրանց շառավիղների՝
       Արղության-Երկայնաբազուկների սեփականությունը (մինչև 20-րդ դարի սկիզբը)։
    
    14-15-րդ դարերում Սանահինի վանքում նոր վերելք է ապրել գրչության արվեստը (այդտեղ գրչագրված ձեռագրերից 35-ը պահվում է Մատենադարանում)։ Առավել
     հիշարժան է Սանահինի «Քոթուկը» (ձեռ. № 3032), որը բովանդակում է վանքի ժամանակագրությունը, արժեքավոր տեղեկություններ միաբանության պատմության 
     վերաբերյալ։
    
    17-րդ դարի կեսին՝ Սարգիս արքեպիսկոպոս Արղությանի առաջնորդության օրոք, էապես նորոգվել են ժամանակի և երկրաշարժերի ազդեցությամբ վնասված վանքի
     հիմնական կառույցները։ 1831 թվականին հյուսիսային պարսպին կից միակամար աղբյուր է կառուցել վանքի տոհմիկ առաջնորդ Հարություն արքեպիսկոպոս 
     Տեր-Բարսեղյանցը (ճակատին պահպանվել է նրա չափածո արձանագրությունը), կատարել է նաև վիմագրությունների վերծանման և կառույցների նորոգման
     
     աշխատանքներ։ 20-րդ դարի սկզբին վանքի գործունեությունը դադարել է։
    
    Խորհրդային իշխանության ժամանակաշրջանում Սանահինի վանքը որպես պատմամշակութային հուշարձան եղել է պետական պահպանության ներքո, կատարվել 
    են կառույցների ամրակայման և վերականգնման աշխատանքներ։ 1998 թվականին Հայաստանի Հանրապետության կառավարության որոշմամբ այն հանձնվել է
     Մայր Աթոռ Սուրբ Էջմիածնի տնօրինությանը։
    
    
    
    
    
    Սանահինի վանքը գտնվում է Դեբեդ գետի աջ ափին՝ Լոռու կանաչապատ անկյուններից մեկում: 
    Ճարտարապետական այս բարդ համակառույցը բաղկացած է մի քանի եկեղեցիներից, գրադարան-մատենադարանից, դպրանոցից:
     Առանձին հիացմունք է առաջացնում Սբ. Աստվածածին եւ Ամենափրկիչ եկեղեցիներն իրար կապող ճեմարանի շենքը, որն ի սկզբանե եղել է 
     ճարտարապետների հմուտ հնարքը, որով նրանք այս երկու եկեղեցիներին հաղորդել են բարձր սեյսմակայունություն:`,
      img: "https://upload.wikimedia.org/wikipedia/commons/5/59/Sanahin-external-view.jpg",
      photo: "https://i.pinimg.com/736x/9c/e2/e9/9ce2e9b1023a458afabce8307412630a.jpg"
    },
    {
      name: "Սևան",
      titel: " Սևանա լիճ",
      description: `Գոյություն ունի լճի անվանման ծագման երկու ավանդություն․

Սևանա լճի տեղում առաջ ցամաք է եղել՝ անտառապատ բլուրներով, ծաղկավետ դաշտերով ու բերրի վարելահողերով։ Գյուղին մոտիկ բլրի տակ եղել է մի
 ջրառատ աղբյուր, որից ջուր վերցնելիս գյուղացիները հանում էին ակունքի մեծ փակիչը և ապա զգուշությամբ հարմարեցնում տեղում։
Մի երեկո գյուղի հարսներից մեկը ջրի է գնում աղբյուրը, հանում է փակիչը, կուժը լցնում ու գալիս տուն՝ մոռանալով փակել ակունքը։ Ջուրը դուրս է 
հորդում, ծավալվում չորս կողմ, երբ հասնում է տնակներին, բնակիչները փախչում են, ասելով «Քար դառնա ով բաց է թողել ակունքը»։ Եվ մոռացկոտ հարսը 
քար է դառնում, իսկ ջուրը անընդհատ հոսելով գոյացնում է Սևանա լիճը, որի երեսից հազիվ վեր է բարձրանում քարացած հարսի գլուխը՝ Հարսնաքարը։
Վանեցիները գաղթում և վերաբնակվում են Սևանի ափերին՝ որոշելով, որ դա էլ մի Վան է։ Բայց հետո տեղի ցուրտ ու դաժան կլիման դուր չի գալիս նրանց։
 Նրանք հիշում են իրենց երկրի մեղմ ու տաք բնությունը, իրենց բարեկեցիկ կյանքը և դառնորեն կանչում՝ «Սև Վան եկավ մեր գլխին, սև Վան»։ Ու այդպես
  էլ լճի անունը մնում է Սևան։
  Սևանա լիճը գտնվում է ծովի մակարդակից մոտ 1900 մետր բարձրության վրա։ Դա աշխարհի՝ քաղցրահամ ջուր ունեցող երկրորդ ամենախոշոր բարձրադիր լիճն է՝
   Հարավային Ամերիկայի Տիտիկակա լճից հետո։ Լիճը բաղկացած է երկու հատվածից՝ Մեծ Սևան (37.7 մ միջին խորություն) և Փոքր Սևան 
   (50.9 մ միջին խորություն)։ Բաժանման հատվածն անցնում է Նորատուսի ու Արտանիշի թերակղզիների միջև գտնվող նեղուցով։ Հյուսիս-հարավ երկարությունը 
   70 կմ է, առավելագույն լայնությունը՝ 55 կմ։ Հայելու մակերեսը կազմում է 1260 կմ2, որով ամենախոշորն է Հարավային Կովկասի տարածքում։
    Միջին խորությունը 26.8 մ է, ամենախորը վայրը՝ 83 մ։ Ջրի ծավալը 32․92 մլրդ մ3 է։

  Լիճը շրջապատող լեռներ՝ արևմուտքից՝ Գեղամա լեռներ, հյուսիսից՝ Արեգունու լեռներ, արևելքից՝ Սևանա լեռներ, հարավից՝ Վարդենիսի լեռներ Սևան ազգային 
  պարկում առանձնացված արգելավայրեր՝ Գավառագետի և Գիհիկաղնուտային ռելիկտային Արգելոցներ՝ Նորաշենի, Լիճք-Արգիճի, Գիլլի, Արտանիշի
  Սևանա լիճ, բարձրլեռնային քաղցրահամ խոշոր լիճ Հայաստանի Գեղարքունիքի մարզում՝ ծովի մակարդակից մոտ 1900 մետր բարձրության վրա։ Այն երկրագնդի
   քաղցրահամ ջուր ունեցող 2-րդ բարձրադիր լիճն է Հարավային Ամերիկայի Տիտիկակա լճից հետո։

  Լճի երկարությունը 70 կմ է, առավելագույն լայնությունը՝ 55 կմ։ Հայելու մակերեսը կազմում է 1260 կմ2, որով ամենախոշորն է Հարավային Կովկասի 
  տարածքում։ Միջին խորությունը 46.8 մ է, ամենախոր վայրը՝ 83 մ։ Ջրի ծավալը 32,92 մլրդ մ3 է։ Սևանա լիճը Շորժայի ստորջրյա թմբով բաժանվում է 2 մասի՝ 
  Մեծ Սևանի (37.7 մ միջին խորություն) և Փոքր Սևանի (50.9 մ)։
  
  Սևանա լիճը Հայկական բարձրավանդակի՝ մեծությամբ երրորդ լիճն է՝ Վանա լճից և Ուրմիոյից հետո։ Ի տարբերություն այդ երկուսի՝ բաց լիճ է և ունի քաղցրահամ
   ջուր։ Լիճ են թափվում 28 մեծ ու փոքր գետակներ որոնցից են՝ Արգիճի, Մասրիկ, Գավառագետ, Կարճաղբյուր, Վարդենիս, Ձկնագետ, սակայն սկիզբ է առնում
    միայն մեկը՝ Հրազդանը։ Վերջինիս շնորհիվ ջրերի տարեկան արտահոսքը կազմում է 0.7 կմ3։
  
  Լճի ծագումնաբանական վարկածներից մեկի համաձայն՝ այն առաջացել է չորրորդական ժամանակաշրջանում։ Գոյացել է հրաբխային գործունեության հետևանքով՝ 
  միջլեռնային տեկտոնական իջվածքում սառցադաշտային և ձնհալոցքային ջրեր լցվելու արդյունքում։ Չորս կողմում առանձնակի շրջապատում են Արեգունու, 
  Սևանի, Վարդենիսի, Գեղամա լեռները։
  
  Սևանա լճի ջրերը Հրազդան գետի միջոցով ոռոգում են Արարատյան դաշտը։ Հրազդան գետի վրա կառուցված 6 էլեկտրակայանները ձևավորում են հանրապետության 
  ամենամեծ՝ Սևան-Հրազդան կասկադը։ Խորհրդային իշխանության տարիներին լճի մակարդակը զգալիորեն իջել է, ինչի հետևանքով տարածաշրջանում առաջացել է
   էկոլոգիական խնդիր։
  
  1978 թվականին ստեղծվել է Սևան ազգային պարկը։ Ջրի մակարդակը վերականգնելու համար կառուցվել է Արփա-Սևան (48.3 կմ, 1963–81 թվականներ), ապա՝ 
  Որոտան-Արփա ջրատարները (21, 6 կմ, 2004 թվական)։


    Հայոց լեռնաշխարհի հմայքն ու մարգարիտը հանդիսացող Սեւանը Կովկասի ամենախոշոր եւ աշխարհի ամենամեծ բարձրադիր քաղցրահամ լճերից մեկն է:
     Գտնվում է ծովի մակարդակից մոտ 1900 մետր բարձրության վրա: Լիճն ունի հրաբխային ծագում եւ շրջապատված է մինչեւ 3000 եւ
      ավելի մետր բարձրության հասնող լեռնաշղթաներով: Գեղեցիկ բնությունը եւ բյուրեղյա թափանցիկ ջուրը հիանալի հանգստի նախապայման են ստեղծում:

    Չքնաղ տեսարան է բացվում Սեւանա լճի հյուսիս-արեւմտյան մասում, ուր լճի հայելանման մակերեւույթից վեր է հառնում թերակղզին՝
     իր միջնադարյան վանքային համալիրով: Սեւանավանքը կառուցվել է 874թ. Աշոտ Բագրատունու դուստր՝ 
     Մարիամ իշխանուհու պատվերով: Երկնքի կապույտի ու լճի զմրուխտ ֆոնի վրա գծագրվող Սբ. Առաքելոց եւ Սբ. Աստվածածին եկեղեցիներն
      անբացատրելի տպավորություն են թողնում : `,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/sevan-armenia.jpg",
      photo: "https://armadventure.com/wp-content/uploads/2018/11/sevan4-600x374.jpg"
    },
    {
      name: "Պարզ լիճ",
      titel: "Պարզ լիճ",
      description: `
Պարզ լիճը աղբյուրներից սկսվող, հոսք ունեցող լիճ է։ Այն ունի 300մ երկարություն և 100մ լայնություն։ Միջին խորությունը 3 մ է, 
առավելագույնը 10 մ։ Մակերեսը կազմում է 0.027 քառակուսի մ, ծավալը 83.8 հազար խորանարդ մետր։ Զարգացած են սողանքային երևույթները։ 
Շրջապատված է անտառներով։ Լճի ջուրը թափանցիկ է, կանաչավուն երանգով: Մոտակայքում սաղարթապատ անտառի հիասքանչ արտացոլանքը զարդարում է լճի մակերևույթը: 

Պարզ լճում այցելուներին հնարավորություն է ընձեռվում նաև նավարկել և հիանալ բնության հրաշքով անմիջապես ջրի ավազանի ցանկացած մասից։ Լիճը շքեղ է տարվա
 ցանկացած եղանակին և գրավում է իր բազմերանգ և շլացուցիչ «զգեստներով»։
 Լճի ջուրը թափանցիկ է, կանաչավուն երնագով: Մոտակայքում սաղարթապիտ անտառն է, որի հիասքանչ արտացոլանքը զարդարում է լճի մակերևույթը: 

 Ափամերձ գոտին հարթ է, հվ. գոտին՝ քարքարոտ։ Ամռանը ջրի ջերմաստիճանը հասնում է 15.50 C: Սնումը աղբյուրներից և մթն. տեղումներից է։ Ավազանն 
 անտառածածկ է, ունի ռեկրեացիոն նշանակություն: Պարզ լիճը Կիրակոս Գանձակեցու մոտ կոչվում է «Տըզկա Ծով»։
 
 Ըստ լեգենդի, նորապսակների մի զույգ է խեղդվել այս լճում: Դարձել է ավանդույթ՝բոլոր նորապսակները պսակադրման օրը այցելում են Պարզ լիճ՝ զոհված
  ամուսինների հիշատակը հարգելու:
 
 Ի հարկե, Պարզ լիճը չես համեմատի Հայաստանի կապույտ մարգարտի՝ Սևանա լճի հետ, որն առաջարկում է զվարճանքի և արկածների անվերջ տարբերակներ, սակայն,
  եթե դուք իսկապես գնահատում եք բնությունը, հանգիստը և խաղաղ մթնոլորտը, ապա պետք է անպայման այցելեք այս վայրը: 
Ըստ ավանդազրույցի՝ նորապսակների մի զույգ է խեղդվել այս լճում: Դարձել է ավանդույթ՝բոլոր նորապսակները պսակադրման օրը այցելում են Պարզ լիճ՝
 զոհված ամուսինների հիշատակը հարգելու:

    
    
    Պարզ լիճը Դիլիջան քաղաքից ոչ հեռու գտնվող աղբյուրներից սկսվող, հոսք ունեցող լիճ է : 
    Այն ունի 300մ երկարություն և 100մ լայնություն։ Շրջապատված է անտառներով։ Լճի ջուրը թափանցիկ է, կանաչավուն երանագով: 
    Մոտակայքում սաղարթախիտ անտառն է, որի հիասքանչ արտացոլանքը զարդարում է լճի մակերևույթը:

    Ըստ լեգենդի, նորապսակների մի զույգ է խեղդվել այս լճում: Դարձել է ավանդույթ՝
    բոլոր նորապսակները պսակադրման օրը այցելում են Պարզ լիճ՝ զոհված ամուսինների հիշատակը հարգելու:`,

      img: "https://busvoyage.am/wp-content/uploads/2018/06/parz-lich-armenia.jpg",
      photo: "https://onewaytour.com/wp-content/uploads/2018/04/SAYTINKARNER-8888888888888888.jpg"
    },
    {
      name: "Զվարթնոց",
      titel: "Զվարթնոցի տաճար",
      description: `Զվարթնոցի տաճար, 7-րդ դարի հայ առաքելական տաճար, որը կառուցվել է Ներսես Գ Տայեցի կաթողիկոսի պատվերով՝ 641- 661 թվականներին։

    Այժմ պահպանվել են միայն Զվարթնոցի տաճարի ավերակները, որոնք հայտնաբերվել են Հայաստանի Արմավիրի մարզում՝ Վաղարշապատ քաղաքի եզրին։
    
    Ներառված է Հայաստանում ՅՈւՆԵՍԿՕ-ի Համաշխարհային ժառանգության օբյեկտների ցանկում։
    
    Զվարթնոցի տաճարը կառուցվել է այն ժամանակ, երբ Հայաստանը գտնվում էր բյուզանդական տիրապետության տակ, և նոր էին սկսվել արաբական արշավանքները։
    
    Մայր տաճարի շինարարական աշխատանքները սկսել են 643 թվականին Ամենայն հայոց կաթողիկոս Ներսես Շինարարի առաջնորդության տարիներին։
    
    Զվարթնոցի տաճարը կառուցվել է այն վայրում, որտեղ միմյանց են հանդիպել Տրդատ Մեծը և Սուրբ Գրիգոր Լուսավորիչը։
    
    Ըստ Մովսես Կաղանկատվացու՝ Զվարթնոցն օծվել է 652 թվականին՝ հարակից հայրապետանոցով և պարիսպներով։ Զվարթնոցի տաճարի պատին Ներսես Տայեցին թողել 
    է հունալեզու արձանագրություն, որտեղ նշել է «Ներսեսն է կառուցել, հիշեցեք»։
    
    Վերոհիշյալի մասին պատմում է նաև Հովհան Մամիկոնյան պատմիչը։
    
    Արաբների կողմից Դվինի գրավումից հետո խառնակ իրադրություն ստեղծվեց երկրի արևելյան շրջաններում։ Ներսես թագավորը կաթողիկոսական աթոռը Դվինից
     տեղափոխեց Զվարթնոց։
    
    Զվարթնոցի տաճարը կանգուն է մնացել մինչև 10-րդ դարը։ Գագիկ I Բագրատունու կառավարման տարիներին տաճարի կրկնօրինակն է ստեղծվում նաև Անիում։
    
    Այս առթիվ Սեբեոս պատմիչը նշում է.
    
      Այն ժամանակ հայոց Ներսես կաթողիկոսը որոշեց իր համար նստավայր շինել այն սուրբ եկեղեցիների մոտ, որ Վաղարշապատ քաղաքում էին՝ այն ճանապարհի վրա,
       որտեղ, ասում են, Տրդատ թագավորն ընդառաջ ելավ սուրբ Գրիգորին։ Շինեց այնտեղ մի եկեղեցի հանուն երկնային Զվարթունների (հրեշտակների) երկնային
        զորքերի բազմության, որոնք երազում երևացին սուրբ Գրիգորին։ Կառուցեց այդ եկեղեցին՝ բարձրաշեն, զարմանալիորեն չքնաղ, աստվածային պատվին արժանի,
         ում նվիրեց։ Աղբյուր բերեց, ջուր անցկացրեց նաև գետից և ողջ քարքարոտ վայրերը մշակեց, տնկեց այգիներ ու ծառաստաններ և նստավայրը շուրջանակի
          պատվարեց գեղեցկաշար բարձր պարսպով՝ ի փառս Աստծո
    - Սեբեոս
        
    1905 թվականին հայ նշանավոր ճարտարապետ Թորոս Թորամանյանը Վաղարշապատում պեղումներ է կատարել և վերականգնել է տաճարը՝ օգտագործելով բնօրինակ քարերը։
    
    Տաճարի նոր ծրագիրը ևս կազմել է Թորոս Թորամանյանը։ Շատ փորձագետներ պնդում են, որ Թորամանյանի ծրագիրը չի համապատասխանում Զվարթնոցի պատմական տաճարի
     նախատիպին։ Կառուցված է հայկական ճարտարապետական ոճով և զարդարված է հունական խաչերով։
    
    Կառույցի պատերին պահպանվել են որմնանկարներ։ 2000 թվականին Վաղարշապատի եկեղեցիները, այդ թվում և Զվարթնոցի տաճարը ներառվել են Հայաստանում 
    ՅՈւՆԵՍԿՕ-ի Համաշխարհային ժառանգության օբյեկտների ցանկում։
    
    Զվարթնոցի տաճարը պատկերված է 100 դրամանոց թղթադրամի դարձերեսին, սակայն դուրս է եկել կիրառությունից։ Օրինակ է պահպանվել Երևանի պատմության
     թանգարանում։
    Անձեռակերտ այս տաճարը Հայաստանի 7-րդ դարի ճարտարապետների հմտության եւ խիզախ մտահղացման արգասիքն է: Եռահարկ այս շինությունը 
    կառուցված լինելով ընդամենը մի քանի սյուների վրա՝ 3 դար շարունակ կանգուն է եղել: Երբ 20-րդ դարի սկզբին կատարած պեղումների արդյունքում 
    հայտնի ճարտարապետ Թորոս Թորամանյանը ներկայացրեց Զվարթնոցի (Հրեշտակների կացարան) վերականգնման մոդելը, շատ քչերը կարողացան այն ընդունել, 
    քանի որ դժվար էր հավատալ, որ 7-րդ դարում հնարավոր էր կառուցել նման շինություն:`,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/zvartnoc-armenia.jpg",
      photo: "https://onewaytour.com/wp-content/uploads/2016/11/zvartnots1.png"
    },
    {
      name: "Խնձորեսկ",
      titel: "Խնձորեսկ",
      description: `Ըստ ժողովրդական ստուգաբանության, «Խնձորեսկ» անվան արմատը «խնձոր» բառն է։ Մեկ այլ ստուգաբանությամբ՝ Խնձորեսկ նախապես 
    անվանվել է Խորձոր կամ Խորձորեսկ, որը հետագայում որոշ հնչյունափոխության ենթարկվելով՝ ընդունել է ներկայիս ձևը։ Երկու կարծիքներն էլ, անշուշտ,
     ընդունելի են. այդտեղ և՜ ձորերն են խոր, և՜ խնձորն է առատ։
    Խնձորեսկի ճոճվող կամուրջ, կամուրջ Սյունիքի մարզի Խնձորեսկ գյուղում՝ Գորիս-Ստեփանակերտ մայրուղուց աջ, խոր ձորի զառիթափի 
    լանջերին և սարահարթի վրա։

    Կամուրջը միմյանց հետ կապում է հին Խնձորեսկի երկու «ափերը»՝ Հին և Նոր Խնձորեսկները, որտեղից երևում են Խնձորեսկի չորս եկեղեցիները և 
    «Ինը մանուկի» աղբյուրը։
    
    Կամուրջը կառուցվել է 2012 թվականին խնձորեսկցի գործարար Ժորա Ալեքսանյանի նախաձեռնությամբ ու հովանավորությամբ, ով կառույցը նվիրել է ծնողների՝ 
    Հայկ և Թամարա Ալեքսանյանների հիշատակին։
    
    
    Կամրջից բացվում է տեսարան դեպի ձորը, որտեղ գտնվում է Անապատ եկեղեցին, որի բակում թաղված է Մխիթար Սպարապետը։ Կամրջի մյուս ծայրում
     քարանձավային քաղաքն է՝ իր բազմաթիվ տուն-քարանձավներով ու «առանձնատներով»։
     Խնձորեսկ, գյուղ Հայաստանի Սյունիքի մարզում։ Ըստ 2011 թ. մարդահամարի արդյունքների՝ գյուղի բնակչությունը կազմում է 2070 մարդ[1]։
      Բարձրությունը ծովի մակարդակից կազմում է 1580 մ, զբաղեցրած տարածքը կազմում է 6772, 8 հա։ Գտնվում է Գորիս-Ստեփանակերտ մայրուղուց աջ, 
      խոր ձորի զառիթափի լանջերին և սարահարթի վրա, որտեղից էլ ստացել է Խնձորեսկ անվանումը։ Գտնվում է մարզկենտրոնից 82 կմ հեռավորության վրա։

     «Խնձորեսկ» անունով է կոչվում և՛ հին գյուղատեղին, որ տարածված է լեռնահովտում, և՛ նոր գյուղը, որ սփռված է նրանից վեր՝ ձախ կողմում ընկած 
     սարահարթում։
     
     Խնձորեսկը պատմական հուշարձան է համարվել, որը պահպանվել է սովետական պետության կողմից։ «Հին Խնձորեսկը պետք է պահել և պաշտպանել որպես 
     հնությունների խոշորագույն թանգարան,— ասել է Մարտիրոս Սարյանը ՀՍՍՀ Գերագույն սովետի յոթերորդ գումարման հինգերորդ նստաշրջանում,— այդպիսի
      հրաշքային տեղ աշխարհում քիչ կա»։ Խնձորեսկի պատմությունը և բնությունը արտացոլվել են մի շարք հայ գրողների ու նկարիչների (Րաֆֆի, Սերո Խանզադյան,
         Ս. Այվազյան, Մ. Մարյան, Է. Իսաբեկյան, Խ. Եսայան, Հ. Ռուխկյան, Դ. Խանջյան) գործերում, իսկ ժողովրդական մեղեդիների և աշուղական երգերի 
         մոտիվները՝ Ա. Սաթյանի ստեղծագործություններում։
    
    Խնձորեսկը յուրօրինակ տեսարժան վայր է, որը հայտնի է իր քարանձավային անտիկ կացարաններով, 
    որտեղ մարդիկ ապրել են ընդհուպ մինչև 1950-ականները: Խնձորեսկը պատմական հուշարձան է համարվել, որը պահպանվել է
     սովետական պետության կողմից։ «Հին Խնձորեսկը պետք է պահել և պաշտպանել որպես հնությունների խոշորագույն թանգարան,— ասել է Մարտիրոս Սարյանը
      ՀՍՍՀ Գերագույն սովետի յոթերորդ գումարման հինգերորդ նստաշրջանում,— այդպիսի հրաշքային տեղ աշխարհում քիչ կա»։
       Խնձորեսկի պատմությունը և բնությունը արտացոլվել են մի շարք հայ գրողների ու նկարիչների (Րաֆֆի, Սերո Խանզադյան,
         Ս. Այվազյան, Մ. Մարյան, Է. Իսաբեկյան, Խ. Եսայան, Հ. Ռուխկյան, Դ. Խանջյան) գործերում։`,
      img: "https://positiveday.am/_pu/0/37035397.jpg",
      photo: "https://hyurservice.com/images/attractions/1/16117798315023/1200x630.jpeg"
    },
  ]

  return (
    <div>

      <div>
        <div style={{ textAlign: "center", border: '1px solid black', backgroundColor: "rgb(193, 225, 250)", fontSize: 30 }}>
          Հայաստանի տեսարժան վայրերը
        </div>
        <div>
          <div style={{ display: "flex", padding: 0 }}>
            <div>
              {regions.map(
                (x, i) =>
                  <div
                    key={i}
                    onClick={() => setregionN(i)}
                    style={{ border: '1px solid black', padding: 10, backgroundColor: i === regionN ? "rgb(193, 225, 252)" : "white", cursor: "pointer" }}
                  >
                    {x.name}
                  </div>
              )}</div>

            <div style={{ border: "1px solid black", padding: 10 }}>
              <div style={{ textAlign: "center", fontSize: 30 }}> {regions[regionN].titel}
              </div>
              <div>
                <img src={regions[regionN].img} style={{ padding: 10, width: 300, textAlign: "center" }} />
              </div>
              {regions[regionN].description}
              <div>
                <img src={regions[regionN].photo} style={{ padding: 10, width: 300, justifyContent: "center" }} />
              </div>

            </div>

          </div>
        </div>
      </div>
    </div>
  )
}


export default App