import { useState } from "react"

function App() {

  const [regionN, setregionN,] = useState(0)
  const regions = [
    {
      name: "Գառնի",
      description: `Եռանկյունաձեւ հրվանդանի վրա վեր խոյացող Գառնու տաճարը հայ հեթանոսական մշակույթից պահպանված եզակի օրինակն է:
       Տաճարը հունա-հռոմեական եւ հայկական ոճերի միացման ծնունդ է: Այն կառուցվել է մ. թ. առաջին դարում Տրդատ Առաջինի հրամանով եւ նվիրվել է 
       արեւի աստված Միհրին: Հայաստանում քրիստոնեությունն ընդունելուց հետո երբեմնի հեթանոսական տաճարը վերածվում է արքաների 
       ամառային նստավայրի: Այսօր էլ տաճարի շրջակայքում կարելի է տեսնել ամրոցի եւ արքայական պալտների այլ ավերակները, ինչպես նաեւ մեծ 
       հետաքրքրություն առաջացնող թագավորական բաղնիքը ՝հատակի գունավոր խճանկարով:`,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/garnu-hetanosakan-tachar-armenia.jpg"
    },
    {
      name: "Գեղարդ",
      description: `Գառնիից 9 կմ հեռավորության վրա, Ազատ գետի ափին է գտնվում 13-րդ դարի հայ ճարտարապետության անգերազանցելի գլուխգործոցը՝ Գեղարդը: 
      Համալիրի բաղկացուցիչ մաս կազմող եկեղեցիները եւ վանական խցերը մեծ վարպետությամբ փորված են հսկայածավալ ժայռաբեկորի մեջ: 
      Ի սկզբանե վանքային համալիրը կոչվում էր Այրիվանք, իսկ հետագայում ստանում է Գեղարդ անունը՝  ի հիշատակ այնտեղ պահվող Գեղարդի, 
      որով ըստ ավանդության հռոմեացի զինվորը խոցել էր Քրիստոսի կողը: Գեղարդավանքը հարուստ է նրբակերտ զարդաքանդակներով եւ բարձրարվեստ խաչքարերով:`,
      img: "https://heroesofadventure.com/wp-content/uploads/2019/07/Geghard-Monastery-Armenia.jpg"
    },
    {
      name: "Ծաղկածոր",
      description: `Ծաղկաձոր քաղաքը (“Ծաղիկների ձոր”) համարվում է Հայաստանի ամենահայտնի եւ հյուրընկալ վայրերից մեկը:
       Սա մեր լեռնային երկրի փոքրիկ այն այնկյուններից է, ուր բնության գեղեցկությունն ի հայտ է գալիս իր ամբողջ բազմազանությամբ:
        Ծաղկաձորը գտնվում է Կոտայքի մարզում, Երեւանից 50 կմ դեպի հյուսիս, Տեղենիս սարի արեւմտյան լանջին, եւ շրջապատված է կուսական 
        անտառներով ու ալպիական մարգագետիններով:Հետաքրքիր տուրերը դարձնում են Ծաղկաձորը անմոռանալի հանգստի վայր: Ճոպանուղին ձեզ կտանի 
        դեպի ալպիական մարգագետիններ, ձյունապատ սարեր: Մաքուր լեռնային օդ, բազմազան ծաղիկներ, աստղային երկինք, անմոռանալի ձմեռային հանգիստ… 
        Սա այն է, ինչ կարող է առաջարկել ձեզ Ծաղկաձորը:`,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/tsaxkadzor-armenia.jpg"
    },

    {
      name: "Ջերմուկ",
      description: `Ջերմուկը առողջարանային քաղաք է Հայաստանի Վայոց Ձորի մարզում՝ Երևանից 173կմ հեռավորության վրա:

    Ջերմուկում շուրջ 70 մետր բարձրությունից Արփայի կիրճն է գահավիժում ջրվեժը, որ թափված վարսեր է հիշեցնում. ժողովուրդը ջրվեժն անվանել է 
    «Ջրահարսի վարսեր»: Ջերմուկի ջրի զորության մասին լեգենդներ են հյուսվել:
    
    Կա մի լեգենդ, որի համաձայն, շատ վաղուց, երբ մարդու ապրուստի հիմնական միջոցը որսորդությունն էր, Ջերմուկի անտառները լիքն էին ամենատարբեր 
    որսատեսակներով։ Եվ ահա, մի անգամ, փորձառու որսորդը նետահարում է երիտասարդ եղնիկին: Վիրավոր եղնիկը մեծ ճիգերով, վերջին ուժերը հավաքած,
     սկսում է փախչել։ Որսորդը կրնկակոխ հետապնդում է նրան։ Մի կերպ, ոտքերը հազիվ քարշ տալով, եղնիկը հասնում է Ջերմուկի հանքային աղբյուրներին,
      նետվում ջուրը և… այ քեզ հրաշք, ջրից դուրս է գալիս բոլորովին առողջ ու ապաքինված և անմիջապես անհետանում անտառի խորքը։
       Կյանքում ամեն ինչ տեսած փորձառու որսորդը ապշում է հասարակ ջրի կատարած հրաշքից, և այդ օրվանից տարածվում է «Ջերմուկ» ջրի 
       համբավը աշխարհե-աշխարհ, իսկ հրաշք ջրի գաղտնիքը մարդկանց հասցրած եղնիկը դառնում է ժողովրդի սիրելին ու Ջերմուկի խորհրդանիշը:`,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/jermuk-armenia.jpg"
    },
    {
      name: " Արագած",
      description: `Հայաստանի Հանրապետության ամենաբարձր կետը Արագած լեռն է (4095 մ): Քառագագաթ այս հսկան լեռնագնացների ամենասիրած լեռն է
     եւ ամեն տարի դեպի իր բարձունքներն է գրավում բազմաթիվ արկածասերների: Դեպի հարավային գագաթ տանող ճանապարհին լավագույն հանգրվանը Քարի լիճն է,
      որը գտնվում է 3250 մ բարձրության վրա: Առանձնապես դյութիչ տեսարան է բացվում ամենավերեւից: Մի կողմից ուրվագծվում են կանաչ հովիտները,
       կողքից սպիտակին է տալիս հավերժական ձյունը, մի այլ տեղում արծաթազօծվում են Արագածի բազմաթիվ մեծ ու փոքր լճերը, 
       իսկ հեռու մշուշում Արարատյան դաշտի եզրին վեր է հառնում Բիբլիական Արարատը: `,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/aragats-armenia.jpg"
    },
    {
      name: "Հաղարծին",
      description: `Հաղարծինի վանքը գտնվում է Տավուշի մարզի անտառներում և ներկայացնում է բնության և ճարտարապետության աննկարագրելի խառնուրդ:
     Այն հիմնադրվել է 10-11-րդ դարերում, թեեւ նոր եկեղեցիներ են ավելացվել է 12-13-րդ դարերում: Այժմ այն բաղկացած է Սբ. Գրիգոր, Սուրբ Աստվածածին
      (Սուրբ Աստուածածին), Սբ. Ստեփանոս եկեղեցիներից ու այլ տնտեսական շենքերից: Սեղանատունը շնորհիվ իր հմուտ ճարտարապետական կազմի իրենից
       ներկայացնում է մեծ հետաքրքրություն: Հսկայական կաղնու ծառը, որն ունի գրեթե վանքի տարիքը, լրացնում է ամբողջ տեսարանը: `,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/haghartsin-armenia.jpg"
    },
    {
      name: "Նորավանք",
      description: `Հարյուրավոր քարանձավներով պատված ժայռերի կիրճը տանում է դեպի մի տեսարան, ուր ներկայացված է ճարտարապետության ու բնության
     ներդաշնակությունը: Հրաշալի ճարտարապետական լուծումներով ու շքեղ զարդաքանդակներով օծված այս վանքային համալիրը 13-րդ դարի հայ ճարտարապետության 
     փայլուն օրինակներից է: Նորավանքը բաղկացած է Սբ. Կարապետ, Սբ. Լուսավորիչ եկեղեցիներից եւ իր ձեւերի կատարելությամբ աչքի ընկնող Սբ. Աստվատծածին
      կրկնահարկ եկեղեցուց:`,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/noravanq-armenia.jpg"
    },
    {
      name: "Հաղպատ",
      description: `Սանահինից ոչ շատ հեռու գտնվող եկեղեցական այս համալիրն իր որոշակի տեղն ունի հայ ժողովրդի պատմա-մշակութային կյանքում: 
    Այն կառուցվել է Աշոտ Երրորդ Բագրատունու իշխանության տարիներին: Հաղպատի գրատանը տարիներ շարունակ գրվել ու մանրանկարազարդվել են 
    բազմաթիվ մագաղաթներ: 18-րդ դարում այստեղ էր ապրում եւ ստեղծագործում հայտնի բանաստեղծ, աշուղ Սայաթ-Նովան: Իր յուրօրինակ ճարտարապետական 
    մտահղացմամբ հիացնում է Հաղպատի զանգակատունը:`,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/haghpat-armenia.jpg"
    },
    {
      name: "Ամբերդ",
      description: `Միջնադարյան Հայաստանի ամրոցաշինության սկզբունքային գծերն իրենց վառ արտահայտությունն են գտել այս ամրոցում:
     Կառուցված լինելով բնականորեն լավ պաշտպանված բարձունքի վրա՝  Ամբերդը երկար ժամանակ ծառայել է որպես ռազմական կարևոր հենակետ: 
     Աշխարհիկ նշանակություն ունեցող այս ամրոցի բաղկացուցիչ մասն է հանդիսանում 1026 թ. Վահրամ Պահլավունու կողմից կառուցված եկեղեցին:`,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/amberd-armenia.jpg"
    },
    {
      name: "Էջմիածին",
      description: `Երեւանից 20 կմ հեռավորության վրա է գտնվում Հայ Առաքելական եկեղեցու կենտրոնը՝ Էջմիածինը:
     Էջմիածնի Մայր Տաճարը հիմնադրվել է 4-րդ դարի սկզբին եւ աշխարհի հնագույն եկեղեցիներից է:
      Ըստ ավանդության եկեղեցին կառուցվել է այն տեղում, որտեղ մատնանշել է Գրիգոր Լուսավորչի երազում հայտնված Աստծո Որդին: 
      Այստեղից էլ առաջացել է Էջմիածին անունը: Եկեղեցու պատերը ներսից ամբողջովին զարդարված են Հովնաթանյան ընտանիքի նկարիչների 
      բարձրարվեստ որմնանկարներով: Մայր Տաճարի հարակից տարածքում են գտնվում նաեւ կաթողիկոսի նստավայրն ու հոգեւոր ճեմարանը:`,
      img: "https://www.busvoyage.am/wp-content/uploads/2018/06/Ejmiatsin-armenia.jpg"
    },
    {
      name: "Խոր Վիրապ",
      description: `Խոր Վիրապը գտնվում է Արարատի մարզում: Այն Հայաստանում ամենահայտնի սրբավայրն է, քանի որ ուղղակիորեն կապված է
     այստեղ քրիստոնեության տարածման պատմության հետ: Հայաստանում քրիստոնեությունը որպես պետական կրոն հռչակվեց 301թ.՝
     շնորհիվ Գրիգոր Լուսավորչի ջանքերի: Սակայն մինչ Տրդատ 3-րդ թագավորին հավատափոխ անելը՝
      Լուսավորիչը բանտարկված է եղել ներկայիս Խոր Վիրապ վանքային համալիրի տարածքում գտնվող զնդանում: 
      17-րդ դարում կառուցված վանքային համալիրից բացվում է աննկարագրելի մի տեսարան դեպի Աստվածաշնչյան Արարատ լեռը:`,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/khor-viarap-armenia.jpg"
    },
    {
      name: "Լաստիվեր",
      description: `Տեղանքը թաքնված է սաղարթախիտ անտառի մեջ: Ժայռերի խորքից բխող գետը, սլացիկ ծառերը և ուղղաձիգ ժայռերը հեքիաթային են 
    դարձնում տեղի բնությունը:

    Տեղի Քարանձավում, XIII-XIVդդ. մոնղոլական արշավանքների ժամանակ, իր ապաստանն էր գտել բնակչությունը: Քարանձավը գտնվում է ձորի գրեթե
     ուղղաձիգ լանջի վրա: Նրան հասնելու համար մարդիկ ստիպված էին կառուցել աստիճան՝ մեկը մյուսի վրա շարված գերաններից:
      Կառույցը նմանվում էր լաստի, և այդ պատճառով քարանձավը մնաց ժողովրդի հիշողության մեջ «Լաստիվեր» անունով:
    
    Ձորի ներքևում աղմկում է մի հիասքանչ ջրվեժ, որը տեղանքի բնության անբաժանելի մասն է կազմում:
    
    Այժմ Լաստիվերին հարակից տարածքում զարգացում են ապրում ժամանակակից տուրիստական կենտրոնները՝ իրենց ծառայություններն առաջարկելով 
    էքստրեմալ տուրիզմի սիրահարներին: `,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/lastiver-armenia.jpg"
    },
    {
      name: "Օրբելյանների իջևանատուն",
      description: `Տեղանքը թաքնված է սաղարթախիտ անտառի մեջ: Ժայռերի խորքից բխող գետը, սլացիկ ծառերը և ուղղաձիգ ժայռերը հեքիաթային 
    են դարձնում տեղի բնությունը:

    Տեղի Քարանձավում, XIII-XIVդդ. մոնղոլական արշավանքների ժամանակ, իր ապաստանն էր գտել բնակչությունը:
     Քարանձավը գտնվում է ձորի գրեթե ուղղաձիգ լանջի վրա: Նրան հասնելու համար մարդիկ ստիպված էին կառուցել աստիճան՝ 
     մեկը մյուսի վրա շարված գերաններից: Կառույցը նմանվում էր լաստի, և այդ պատճառով քարանձավը մնաց ժողովրդի հիշողության մեջ «Լաստիվեր» անունով:
    
    Ձորի ներքևում աղմկում է մի հիասքանչ ջրվեժ, որը տեղանքի բնության անբաժանելի մասն է կազմում:
    
    Այժմ Լաստիվերին հարակից տարածքում զարգացում են ապրում ժամանակակից տուրիստական կենտրոնները՝ իրենց ծառայություններն
     առաջարկելով էքստրեմալ տուրիզմի սիրահարներին:`,
      img: "https://busvoyage.am/wp-content/uploads/2020/01/orbelyanneri-ijevanatun-2048x1365.jpg"
    },
    {
      name: "Տաթև",
      description: `Զանգեզուրի ճարտարապետական կոթողների մեջ Տաթեւի վանքը չունի իր համազորը:
     Սա միջնադարյան Հայաստանի ամենահարուստ վանքային համալիրն է եղել: Բացի հոգեւոր կենտրոն լինելուց, 
     Տաթեւը եղել է նաեւ Սյունաց թագավորության քաղաքական կարեւոր հենակետ: Վանքի ռազմավարական ձեռնտու դիրքը եւ անառիկությունը
      նպաստավոր պայմաններ են ստեղծել այստեղ պաշտպանական ամուր կառույցներ ստեղծելու համար: Քաղաքական ոչ բարենպաստ պայմաններում 
      արտաքին աշխարհի հետ կապի միջոց էին ծառայում վանական համալիրի տարածքում եղած բազմաթիվ գաղտնուղիները: 2010թ բացվեց Տաթևի ճոպանուղին՝
       Տաթևերը (Տաթևի թևեր), որը հանդիսանում է աշխարհի ամենաերկար ճոպանուղին հետադարձ կապով:`,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/Tatev-armenia.jpg"
    },
    {
      name: "Սանահին",
      description: `Սանահինի վանքը գտնվում է Դեբեդ գետի աջ ափին՝ Լոռու կանաչապատ անկյուններից մեկում: 
    Ճարտարապետական այս բարդ համակառույցը բաղկացած է մի քանի եկեղեցիներից, գրադարան-մատենադարանից, դպրանոցից:
     Առանձին հիացմունք է առաջացնում Սբ. Աստվածածին եւ Ամենափրկիչ եկեղեցիներն իրար կապող ճեմարանի շենքը, որն ի սկզբանե եղել է 
     ճարտարապետների հմուտ հնարքը, որով նրանք այս երկու եկեղեցիներին հաղորդել են բարձր սեյսմակայունություն:`,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/sanahin-armenia.jpg"
    },
    {
      name: "Սևան",
      description: `Հայոց լեռնաշխարհի հմայքն ու մարգարիտը հանդիսացող Սեւանը Կովկասի ամենախոշոր եւ աշխարհի ամենամեծ բարձրադիր քաղցրահամ լճերից մեկն է:
     Գտնվում է ծովի մակարդակից մոտ 1900 մետր բարձրության վրա: Լիճն ունի հրաբխային ծագում եւ շրջապատված է մինչեւ 3000 եւ
      ավելի մետր բարձրության հասնող լեռնաշղթաներով: Գեղեցիկ բնությունը եւ բյուրեղյա թափանցիկ ջուրը հիանալի հանգստի նախապայման են ստեղծում:

    Չքնաղ տեսարան է բացվում Սեւանա լճի հյուսիս-արեւմտյան մասում, ուր լճի հայելանման մակերեւույթից վեր է հառնում թերակղզին՝
     իր միջնադարյան վանքային համալիրով: Սեւանավանքը կառուցվել է 874թ. Աշոտ Բագրատունու դուստր՝ 
     Մարիամ իշխանուհու պատվերով: Երկնքի կապույտի ու լճի զմրուխտ ֆոնի վրա գծագրվող Սբ. Առաքելոց եւ Սբ. Աստվածածին եկեղեցիներն
      անբացատրելի տպավորություն են թողնում : `,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/sevan-armenia.jpg"
    },
    {
      name: "Պարզ լիճ",
      description: `Պարզ լիճը Դիլիջան քաղաքից ոչ հեռու գտնվող աղբյուրներից սկսվող, հոսք ունեցող լիճ է : 
    Այն ունի 300մ երկարություն և 100մ լայնություն։ Շրջապատված է անտառներով։ Լճի ջուրը թափանցիկ է, կանաչավուն երանագով: 
    Մոտակայքում սաղարթախիտ անտառն է, որի հիասքանչ արտացոլանքը զարդարում է լճի մակերևույթը:

    Ըստ լեգենդի, նորապսակների մի զույգ է խեղդվել այս լճում: Դարձել է ավանդույթ՝
    բոլոր նորապսակները պսակադրման օրը այցելում են Պարզ լիճ՝ զոհված ամուսինների հիշատակը հարգելու:
    
    Եթե դուք իսկապես գնահատում եք բնությունը, հանգիստը և խաղաղ մթնոլորտը, ապա պետք է անպայման այցելեք այս վայրը:`,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/parz-lich-armenia.jpg"
    },
    {
      name: "Զվարթնոց",
      description: `Անձեռակերտ այս տաճարը Հայաստանի 7-րդ դարի ճարտարապետների հմտության եւ խիզախ մտահղացման արգասիքն է: Եռահարկ այս շինությունը 
    կառուցված լինելով ընդամենը մի քանի սյուների վրա՝ 3 դար շարունակ կանգուն է եղել: Երբ 20-րդ դարի սկզբին կատարած պեղումների արդյունքում 
    հայտնի ճարտարապետ Թորոս Թորամանյանը ներկայացրեց Զվարթնոցի (Հրեշտակների կացարան) վերականգնման մոդելը, շատ քչերը կարողացան այն ընդունել, 
    քանի որ դժվար էր հավատալ, որ 7-րդ դարում հնարավոր էր կառուցել նման շինություն:`,
      img: "https://busvoyage.am/wp-content/uploads/2018/06/zvartnoc-armenia.jpg"
    },
    {
      name: "Խնձորեսկ",
      description: `Խնձորեսկը յուրօրինակ տեսարժան վայր է, որը հայտնի է իր քարանձավային անտիկ կացարաններով, 
    որտեղ մարդիկ ապրել են ընդհուպ մինչև 1950-ականները: Խնձորեսկը պատմական հուշարձան է համարվել, որը պահպանվել է
     սովետական պետության կողմից։ «Հին Խնձորեսկը պետք է պահել և պաշտպանել որպես հնությունների խոշորագույն թանգարան,— ասել է Մարտիրոս Սարյանը
      ՀՍՍՀ Գերագույն սովետի յոթերորդ գումարման հինգերորդ նստաշրջանում,— այդպիսի հրաշքային տեղ աշխարհում քիչ կա»։
       Խնձորեսկի պատմությունը և բնությունը արտացոլվել են մի շարք հայ գրողների ու նկարիչների (Րաֆֆի, Սերո Խանզադյան,
         Ս. Այվազյան, Մ. Մարյան, Է. Իսաբեկյան, Խ. Եսայան, Հ. Ռուխկյան, Դ. Խանջյան) գործերում։`,
      img: "https://positiveday.am/_pu/0/37035397.jpg"
    },
  ]

  return (
    <div>
      <div style={{ display: 'flex' }}>
        <div>
          {regions.map(
            (x, i) => <div
              key={i}
              onClick={() => setregionN(i)}
              style={{
                border: '1px solid black', backgroundColor: i === regionN ? "rgb( 183,178,190 )" : "white", cursor: "pointer"
              }}
            >
              {x.name}
            </div>
          )}
        </div>
        <div>
          <div style={{ border: "1px solid black" }}>
            {regions[regionN].description}
          </div>
          <div>
            <img src={regions[regionN].img} style={{ width: 300 }} />
          </div>

        </div>
      </div>
    </div >

  )
}

export default App