import { useState } from 'react'

function App() {

  const [regionsN, setRegionN] = useState(0)
  const regions = [
    {
      name: "Արագածոտն",
      description: "Արագածոտնի մարզը իր մեջ նրառում նաև Փամբակի ու Ծաղկունյաց լեռնաշղթաների միջև ընկած տարածքը Այնտեղ մարդու կենսագործունեության, հատկապես տնտեսության վարման համար բավարար պայմաններ կան Եվ պատահական չէ, որ պատմության բոլոր ժամանակներում մարզի տարածքը միշտ իրեն է գրավել ոչ միայն ժողովրդի հոծ բազմություններ, այլեւ եղել է հայոց արքունական եւ ամառանոցային եւ որսորդական տարածք:Մարզն աչքի է ընկնում բնակլիմայական պայմանների բազմազանությամբ:",
      img: "https://th.bing.com/th/id/OIP.h8hp4puMPTaQMAuy_CaC_QHaFs?w=200&h=180&c=7&r=0&o=5&dpr=1.3&pid=1.7",
    },
    {
      name: "Արարատ",
      description: "Արարատի մարզի տարածքը եղել է պատմական Հայաստանի Այրարատ նահանգի Ոստան գավառի մի մասը, այն գավառի, որը միջնադարում հայտնի էր որպես մայրաքաղաքների գավառ: Այստեղ էին գտնվում Արտաշատ և Դվին մայրաքաղաքները: Արարատի մարզը սահմանակից է Թուրքիային և Ադրբեջանի կազմում գտնվող Նախիջևանի Ինքնավար Հանրապետությանը: Արարատի մարզի տարածքը որոշակիորեն բաժանվում է երկու մասի` հարթավայրային և լեռնային: Արարատյան դաշտի կլիման խիստ չորային է:",
      img: "https://th.bing.com/th/id/OIP.MeHcLrIGLMWjQ9N3QVclqQHaDt?w=326&h=175&c=7&r=0&o=5&dpr=1.3&pid=1.7",
    },
    {
      name: "Սյունիկ",
      description: "Ամենաբարձր լեռնագագաթը Կապուտջուղն  է /3904/: Հայտնի են նաև Բաղացսար, Խուստուփ, Մեծ Իշխանասար, Արամազդ, Ծղուկ լեռնագագաթները: Լեռնաշխարհի մարգագետինները, ճոխ արոտավայրերը հարմար են անասնապահության, իսկ գետահովիտները՝ երկրագործության զարգացման համար:Զգալի տարածք են ընդգրկում անտառները, որոնցից են Մթնաձորը, Սոսու բնական եզակի անտառը:Անտառներն հարուստ են եզակի բուսատեսակներով և կենդանիներով: Հայաստանի բնական հարստություններով աչքի ընկնող երկրամասերից է Սյունիքը: Հնագույն ժամանակներից այստեղ արդյունահանվել են պղինձ և այլ գունավոր մետաղներ:",
      img: "https://th.bing.com/th/id/OIP.y4S8EmQ4jGOcj2Xx-MJUOwHaEJ?w=273&h=180&c=7&r=0&o=5&dpr=1.3&pid=1.7'",
    },
    {
      name: "Արմավիր",
      description: "Արմավիրի մարզը հարուստ է պատմական բացառիկ հուշարձաններով:Եզակի հուշարձան է Մեծամորի բլրի լանջին պեղված հինգհազարամյա հնության (բրոնզեդարյան) մետաղաձուլարանը:Պատմական մեծ արժեք են ներկայացնում ուրարտական քաղաք Արգիշտիխինիլիի ավերակները: Դրանց հարևանությամբ Արաքս գետի նախկին հունի ձախ ափին գտնվել է հայոց նախկին մայրաքաղաքը` Արմավիրը, որը դարեր շարունակ եղել է տնտեսական և մշակութային խոշոր կենտրոն ու մնացել է այդպիսին մինչև նոր մայրաքաղաքի` Արտաշատի հիմնադրումը:Դրանից քիչ արևմուտք` Արաքսի ու Ախուրյանի միախառնման տեղում նշմարվում են այլ նշանավոր քաղաքի` Երվանդունիների թագավորության վերջին մայրաքաղաքի` Երվանդաշատի փլատակները:",
      img: "https://th.bing.com/th/id/OIP.r1DZfP3LlZf5LZstgUZQLwHaE6?w=268&h=180&c=7&r=0&o=5&dpr=1.3&pid=1.7",
    },
    {
      name: "Գեղարքունիք",
      description: "ՀՀ Գեղարքունիքի մարզը գտնվում է ՀՀ տարածքի արևելքում: Մարզը սահմանակից է ՀՀ Տավուշի / հյուսիսում/, Կոտայքի և Արարատի /արևմուտքում/ և Վայոց Ձորի մարզերին /հարավում/, ինչպես նաև Ադրբեջանին /արևելքում/: Մարզի ամենաերկար  ձգվածությունը  հյուսիս-արևմուտքից հարավ-արևելք կազմում է 115 կմ, արևմուտքից արևելք` 85 կմ: Գեղարքունիքն  ամենախոշոր մարզն է ըստ  տարածքի և զբաղեցնում  է ՀՀ տարածքի 18%-ը: Մարզն  իր մեջ  ներառում  է 5 քաղաք` Գավառ, Ճամբարակ, Մարտունի, Սևան, Վարդենիս և 87 գյուղական  բնակավայրեր:  Բնակչության  խտությունը կազմում  է 44.5 մարդ/1ք.կմ: Մարզում բնակվում է 238.000.0 մարդ /01.01.2003թ./:",
      img: "https://image.freepik.com/free-photo/noratus-cemetery-sevan-lake-armenia_134785-1150.jpg",
    },
    {
      name: "Կոտայք",
      description: "Կոտայքի մարզ – գտնվում է Հայաստանի Հանրապետության կենտրոնական մասում, ծովի մակերեւույթից 900- 2500 մ բարձրության վրա: Տարածքն ընդգրկում է Հրազդան գետի վերին  և միջին ավազանն ու Մարմարիկ գետի ավազանն ամբողջությամբ: Հյուսիսից սահմանափակվում է Գութանասար, իսկ հյուսիս-արեւելքից` Հատիսի լեռնազանգվածներով: Հարավ-արևմուտքում աստիճանաբար ցածրանալով՝ ձուլվում է Արարատյան դաշտին: Կոտայքի սարավանդն ընկած է Հրազդան գետի միջին հոսանքի ձախափնյա մասից մինչև Գեղամա լեռների արևմտյան ստորոտը: Հրազդան գետի ձախակողմյան վտակների մի մասը գետնի տակ ներծծված ջրերի շնորհիվ գարնանը դուրս են ցայտում /շատ լինելու պատճառով դրանց անվանում են «40 աղբյուր»/:Կոտայքի մարզի ոռոգման համակարգում մեծ նշանակություն ունի Ակնա լիճը /3032մ. բարձրություն/, որով ջրարբիացվում են ամառային արոտավայրերը:",
      img: "https://th.bing.com/th/id/OIP.FyYALNsPRzlcLC-SEoh7-gHaFS?w=253&h=181&c=7&r=0&o=5&dpr=1.3&pid=1.7'",
    },
    {
      name: "Լոռի",
      description: "ՀՀ Լոռու մարզը տարածքի մեծությամբ ու բնակչության թվաքանակով երրորդն է հանրապետությունում (զբաղեցնում է ՀՀ տարածքի 12.7 %-ը): Գտնվում է հանրապետության հյուսիսում, սահմանակից է Վրաստանի Հանրապետությանը (110 կմ երկարությամբ), արեւմուտքից Շիրակի, արեւելքից Տավուշի, հարավից Կոտայքի եւ Արագածոտնի մարզերին: Սահմանամերձ բնակավայրերն են Արծնի, Ապավեն, Ձորամուտ, Պաղաղբյուր, Ջիլիզա: Մարզի տարածքով են անցնում Թբիլիսի-Երեւան երկաթուղու մի հատվածը: ՀՀ Լոռու մարզն ընդգրկում է Սպիտակի, Ստեփանավանի, Տաշիրի, Թումանյանի, Գուգարքի տարածաշրջանները, Վանաձոր, Սպիտակ, Ստեփանավան, Ալավերդի, Տաշիր, Ախթալա քաղաքները:",
      img: "https://th.bing.com/th/id/OIP.PUx6M4QmNKYi4IIIF84j3QHaFj?w=241&h=181&c=7&r=0&o=5&dpr=1.3&pid=1.7",
    },
    {
      name: "Շիրակ",
      description: "Շիրակի մարզը գտնվում է ՀՀ հյուսիս-արևմուտքում: Մարզկենտրոնը՝ Գյումրի:  Մարզի տարածքում են գտնվում Արփի լիճ-ջրամբարը, Ախուրյանի ջրամբարի հայկական հատվածը, Մանթաշի ջրամբարը:  Շիրակի մարզի կենտրոնական և հարավային հատվածում տարածվում է Շիրակի դաշտը, իսկ հյուսիսային շրջանում՝ Աշոցքի սարահարթը: Շիրակի մարզում են տարածվում Փամբակի, Բազումի լեռնաշղթաների, Եղնախաղի, Ջավախքի, Արագածի լեռնազանգվածների մի մասը: Մարզը ռելիեֆի առումով կարելի է բաժանել երկու մասի: Հրաբխային, որն ընդգրկում է Ջավախք-Աշոցքի տարածաշրջանը, իր մեջ ընդգրկելով Ջավախքի և Եղնախաղի լեռնավահանները, Չլդրի լեռները և Աշոցքի սարավանդը։",
      img: "https://th.bing.com/th/id/OIP.VJbFyK4w-OKT_Q3eYufcqwHaEt?w=256&h=189&c=7&r=0&o=5&dpr=1.3&pid=1.7",
    },
    {
      name: "Տավուշ",
      description: "ՀՀ Տավուշի մարզը գտնվում է Հայաստանի Հանրապետության տարածքի հյուսիս-արևելյան հատվածում։ Մարզը հարավում սահմանակից է ՀՀ Գեղարքունիքի և Կոտայքի մարզերին, արևմուտքում՝ ՀՀ Լոռու մարզին, հյուսիսում` Վրաստանին և արևելքում՝ Ադրբեջանին։ Մարզն ունի մոտ 350 կմ միջպետական սահման, որից 300-ը Ադրբեջանի Հանրապետության հետ, 50-ը` Վրաստանի: Ծովի մակերևույթից ամենացածր կետը գտնվում է Դեբեդավան գյուղի մոտ՝ 380 մ, ամենաբարձր կետը Միափորի լեռնաշղթայի համանուն գագաթն է` 2993 մ: Մարզը գտնվում է ՀՀ չափավոր խոնավ տարածաշրջանում։ Արևափայլքի տարեկան տևողությունը 1900-2000 ժամ է։ Ամառները լինում են տաք, ձմեռները՝ մեղմ։ Գետերը պատկանում են Կասպից ծովի (Քուռ գետի) ավազանին և սնվում են հալոցքային, ստորերկրյա և անձրևային ջրերից:",
      img: "https://www.armgeo.am/wp-content/uploads/2015/04/IMG_2549-450x300.jpg",
    },
    {
      name: "Վայոց Ձոր",
      description: "Վայոց ձորի մարզը ՀՀ մարզերի շարքում տարածքի մեծությամբ գրավում է միջին տեղ, իսկ բնակչության թվով ամենափոքր մարզն է։ Մարզը զբաղեցնում է 2308 քառ.կմ մակերես, հյուսիսից սահմանակից է Գեղարքունիքի մարզին, հյուսիսարևելքից` Արցախին, հարավարևելքից` Սյունիքին, հարավից` Նախիջևանի Հանրապետությանը (Ադրբեջան), արևմուտքից` Արարատի մարզին։ Վայոց ձորը բնակատեղի է եղել վաղնջական ժամանակներից։ Այս փաստի մասին վկայում են պեղումների ընթացքում հայտանաբերված նախամարդու իրերը, բրոնզե դարին վերաբեող դաշույնները, ճարմանդները, ապարանջանները, մատանիները և այլ իրեր։ Ժայռերին հայտնաբերվել են բազում փորագրություններ, որսորդական տեսարաններով և զանազան կենդանիներով։ Իսկ 2008 թվականին միջազգային հնագիտական արշավախմբի կողմից Վայոց ձորում կատարված նոր հայտնագործությունը ևս մեկ անգամ ապացուցեց, որ Վայոց ձորը եղել է բնակատեղի ավելի քան 5000 տարվա վաղեմությամբ։",
      img: "https://th.bing.com/th/id/OIP.YY9cEX4ZTNstuaQi_3f5RQHaCZ?w=337&h=113&c=7&r=0&o=5&dpr=1.3&pid=1.7",
    },
  ]
  return (
    <div>

      <div style={{ display: "flex" }}>
        <div>{regions.map((x, i) => <div key={i} onClick={() => setRegionN(i)} style={{ border: "1px solid black", backgroundColor: i === regionsN ? "red" : null }}>{x.name}</div>)}</div>
        <div style={{ border: " 1px solid black" }}>{regions[regionsN].description}</div><img src={regions[regionsN].img} style={{ width: 300 }}></img>
      </div>
    </div>

  )
}
export default App