import { useState } from "react"
function App() {

  const [regionN, setRegionN] = useState(0)
  const [image, setImage] = useState('')

  const regions = [


    {
      name: "Երևան",

      description: 'Հայաստանի մայրաքաղաքը Երևանն է։ Երևան քաղաքը Հայաստանի վարչատարածքային բաժանման բնակչությամբ ամենամեծ միավորն է։ Մայրաքաղաք Երևանում իրականացվում է տեղական ինքնակառավարում, որի մարմիններն են Երևանի ավագանին և քաղաքապետը։ Ըստ 1995 թվականի Հայաստանի սահմանադրության, Երևանի քաղաքապետը նշանակվում էր վարչապետի ներկայացմամբ նախագահի հրամանագրով, սակայն ըստ սահմանադրության 2005 թ. փոփոխությունների, Երևան քաղաքում տեղական ինքնակառավարման առանձնահատկությունները սահմանվում են «Երևան քաղաքում տեղական ինքնակառավարման մասին» օրենքով։ Համաձայն Հայաստանի գործող Սահմանադրության 06.12.2015 թ. փոփոխություններով՝ «Երևանը համայնք է։ Երևանում տեղական ինքնակառավարման առանձնահատկությունները սահմանվում են օրենքով Երևան քաղաքի ավագանին բաղկացած է 65 անդամից և ընտրվում է Երևան քաղաքի բնակիչների կողմից՝ համամասնական ընտրակարգով։ Երևանի քաղաքապետ է ընտրված համարվում այն կուսակցության ընտրական ցուցակի առաջին համարը, որը ստացել է ավագանու տեղերի 40 տոկոս և ավելին։ Եթե այդպիսի կուսակցություն չկա, ապա քաղաքապետն ընտրվում է ավագանու կողմից։ Երևանն իր հերթին բաժանված է 12 վարչական շրջանների։ Դրանք են Աջափնյակ, Ավան, Արաբկիր, Դավթաշեն, Էրեբունի, Կենտրոն, Մալաթիա-Սեբաստիա, Նոր Նորք, Նորք Մարաշ, Նուբարաշեն, Շենգավիթ, Քանաքեռ-Զեյթուն։ ',

      img: 'https://www.busvoyage.am/wp-content/uploads/2018/06/yerevan-1.jpg, https://nairimed.com/file/editor-15966369485f2abf14113ce.png'

    },
    {
      name: "Արագածոտն",

      description: 'Արագածոտնի մարզ, մարզի կարգավիճակ ունեցող վարչատարածքային միավոր Հայաստանում։ Մարզկենտրոնը Աշտարակ քաղաքն է։ Տարածքը՝ 2753 կմ2, բնակչությունը՝ 141 հազար մարդ։ Հայաստանի մարզերի շարքում տարածքի մեծությամբ միջին տեղ է գրավում, իսկ բնակչության թվով գերազանցում է միայն Վայոց ձորի և Տավուշի մարզերին։',

      img: 'https://www.visitarmenia.travel/images/1562072054.jpg,https://app.conciergetravel.am/storage/whKatZzeE3lvQMyhXlc9ET63kR8KRG2Yw0wnJJqd.jpg'
    },
    {
      name: "Արարատ",

      description: 'Արարատի մարզ, մարզի կարգավիճակ ունեցող վարչատարածքային միավոր Հայաստանում։ Մարզկենտրոնն Արտաշատ քաղաքն է։ Տարածքը 2096 կմ² է։ Արարատի մարզը գտնվում է Հայաստանի հարավ-արևմուտքում։ Հյուսիս-արևմուտքից սահմանակից է Արմավիրի մարզին, հյուսիսից՝ Երևանին ու Կոտայքի մարզին, արևելքից Գեղարքունիքի և Վայոց ձորի մարզերին, հարավից՝ Ադրբեջանի մասը կազմող Նախիջևանին, իսկ հարավ-արևմուտքից Թուրքիային։',

      img: 'https://img.itinari.com/regions/am-ararat-province.jpg?ch=DPR&dpr=1&w=1600&s=7317a26503383bef7530e031ab666aff,https://cdn.araratour.com/file_manager/files/Articles/Armenian%20Mountains/Ararat-Hawk.jpg'
    },
    {
      name: "Արմավիր",

      description: 'Արմավիրի մարզ, վարչատարածքային միավոր Հայաստանում։ Արմավիրի մարզկենտրոնն Արմավիր քաղաքն է։ Տարածքը 1242 կմ² է, բնակչությունը 284 հազար մարդ։ Գտնվում է 800-1000 մ բարձրություններում։  Մարգարա գյուղի մոտ Արաքս գետի վրա կառուցված ավտոճանապարհային կամուրջը Հայաստանը միացնում է Թուրքիային։ Մարզի տարածքը եղել է պատմական Հայաստանի Այրարատ նահանգի մի մասը։ Կլիման խիստ ցամաքային է։ Մթնոլորտային տեղումների քանակը չի գերազանցում 300 մմ։ Ամառը շոգ է, տևական (4-5 ամիս)։ Հաճախ ջերմաստիճանը բարձրանում է մինչև 40-42 °C։ Բնորոշ են լեռնահովտային քամիները։ ',

      img: 'https://dynamic-media-cdn.tripadvisor.com/media/photo-o/28/5b/d4/42/caption.jpg?w=300&h=300&s=1,https://previews.123rf.com/images/lovelypeace/lovelypeace1911/lovelypeace191100013/133399093-the-7th-century-built-zvartnots-cathedral-in-armavir-province-of-armenia.jpg'
    },
    {
      name: "Գեղարքունիք",

      description: 'ՀՀ Գեղարքունիքի մարզը գտնվում է ՀՀ տարածքի արևելքում: Մարզը սահմանակից է ՀՀ Տավուշի / հյուսիսում/, Կոտայքի և Արարատի /արևմուտքում/ և Վայոց Ձորի մարզերին /հարավում/, ինչպես նաև Ադրբեջանին /արևելքում/: Մարզի ամենաերկար  ձգվածությունը  հյուսիս-արևմուտքից հարավ-արևելք կազմում է 115 կմ, արևմուտքից արևելք` 85 կմ: Գեղարքունիքն  ամենախոշոր մարզն է ըստ  տարածքի և զբաղեցնում  է ՀՀ տարածքի 18%-ը: Մարզն  իր մեջ  ներառում  է 5 քաղաք` Գավառ, Ճամբարակ, Մարտունի, Սևան, Վարդենիս և 87 գյուղական  բնակավայրեր:   Բնակչության  խտությունը կազմում  է 44.5 մարդ/1ք.կմ: Մարզում բնակվում է 238.000.0 մարդ /01.01.2003թ./, որոնց  մեծ մասը` 158.400.0-ը /66.5%/ գյուղական  բնակավայրերում: Բնակչության  թվաքանակում  տղամարդիկ կազմում են 48.2%, կանայք` 51.8%-ը: Գեղարքունիքի մարզի կլիման  բնորոշվում է երկարատև  և խստաշունչ ձմեռներով, քանի որ  գտնվում է  ընդհանուր առմամբ ծովի  մակերևույթից 2000-3500 մ բարձրության վրա: Մարզի ամենաբարձր կետը` Աժդահակ լեռան գագաթն է 3598մ: Բարձր լեռներ են Սպիտակասարը 3555 մ, Վարդենիսը 3522 մ, Գեղասարը 3446մ: Ամենաերկար  գետերն են Արգիճին (51 կմ), Գավառագետը (47 կմ), և Մասրիկը (45 կմ), առկա  են նաև  խառնարանային լճեր` Աժդահակ և Արմաղան /մինչև 50 մ տրամագծով և 15 մ խորությամբ/:',

      img: 'https://media.istockphoto.com/id/1160098022/photo/hayravank-monastery-on-the-shores-of-lake-sevan-in-armenia.jpg?s=612x612&w=0&k=20&c=fCtO3RRJL2gaWavivHyyGygrNgZ7wj39tMuq1nOCEUI=,https://app.conciergetravel.am/storage/if672roqmZwRREeqoKclutBzaVxpd1h8tecmFm76.jpg'
    },
    {
      name: "Կոտայք",

      description: 'Կոտայքի մարզ, մարզի կարգավիճակ ունեցող վարչատարածքային միավոր Հայաստանում։ Միակ մարզն է, որը միջպետական սահման չունի Հայաստանի հարևան որևէ պետության հետ։ Կոտայքը միաժամանակ նաև այն չորս մարզերից մեկն է, որոնք անմիջապես հարում են մայրաքաղաք Երևանին[1] Մարզի տարածքն ընդգրկում է Կոտայքի սարավանդը, Մարմարիկ գետի ավազանը, Հրազդան գետի ավազանի վերին ու միջին հատվածը, ինչպես նաև Գեղամա լեռնաշղթայի արևմտյան լանջերը[2]։ Այն հարավ-արևմուտքից սահմանակից է մայրաքաղաքին, արևմուտքից՝ Արագածոտնի, հյուսիսից՝ Լոռու, հյուսիս-արևելքից՝ Տավուշի, արևելքից՝ Գեղարքունիքի և հարավից՝ Արարատի մարզերին[2] Կոտայքի մարզի վարչական կենտրոնը Հրազդանն է[3][4]։ Կոտայքի մարզը զբաղեցնում է 2089 կմ² տարածք (8-րդը Հայաստանի մարզերի շարքում)։ Ըստ 2011 թվականի տվյալների՝ մարզի բնակչությունը կազմում է 254 397 մարդ[',

      img: 'https://i.pinimg.com/1200x/55/19/ca/5519ca8b639e7339535499d06ce1ba09.jpg,https://dynamic-media-cdn.tripadvisor.com/media/photo-o/07/ed/cc/eb/garni-gorge.jpg?w=300&h=300&s=1'
    },
    {
      name: "Լոռի",

      description: 'Lոռու մարզ, մարզի կարգավիճակ ունեցող վարչատարածքային միավոր Հայաստանի հյուսիսում։ Զբաղեցնում է պատմական Հայաստանի Գուգարաց նահանգի արևելյան հատվածն ու Այրարատ նահանգի Նիգ գավառի հյուսիսային տիրույթները։ Լոռու մարզն ունի ցայտուն արտահայտված բնական սահմաններ։ Այն ընդգրկում է Դեբեդ գետի ավազանն ամբողջությամբ և հիմնականում ունի լեռնային ռելիեֆ՝ բարձրադիր լեռներ, անդնդախոր, երբեմն սուր կտրվածքով կիրճեր։ Նրա տարածքում են ձգվում Ջավախքի, Բազումի, Փամբակի, Գուգարաց, Վիրահայոց և Հալաբի լեռնաշղթաները։ Առանձնանում են Լոռու,Փամբակի գոգավորությունները և Լոռվա ձորը։ Բնակավայրերը գտնվում են ծովի մակերևույթից 520-ից մինչև 1800 մետր բարձրության վրա։ Մարզի վարչական կենտրոն հանդիսացող Վանաձոր քաղաքը համարվում է Հայաստանի երրորդ խոշորագույն քաղաքը՝ շուրջ 80 հազար բնակչությամբ։',

      img: 'https://eltravelclub.am/media/k2/items/cache/48ee1e8a0a8f50dce4f8cb9ab418e211_XL.jpg,https://previews.123rf.com/images/takepicsforfun/takepicsforfun1411/takepicsforfun141100063/33796957-sanahin-monastery-located-in-sanahin-village-at-lori-province-armenia.jpg'
    },
    {
      name: "Շիրակ",

      description: 'Շիրակի մարզ, մարզի կարգավիճակ ունեցող վարչատարածքային միավոր Հայաստանում։ Վարչական կենտրոնը Գյումրի քաղաքն է։ Պետական սահմանով արևմուտքից սահմանակից է Թուրքիային, հյուսիսից՝ Վրաստանին, արևելքից սահմանակից է՝ Հայաստանի Լոռու մարզին և հարավից՝ Հայաստանի Արագածոտնի մարզին։ Գտնվում է Հայ Առաքելական Եկեղեցու Շիրակի թեմի հովվապետության ներքո (առաջնորդարանը՝ քաղաք Գյումրիում), սակայն մարզի տարածքում կան զգալի թվով կաթոլիկ հայեր, ինչպես նաև կաթոլիկ գյուղեր։',

      img: 'https://hyurservice.com/images/attractions/1/16117755433679/1200x630.jpeg,https://media.istockphoto.com/id/1201679686/th/%E0%B8%A3%E0%B8%B9%E0%B8%9B%E0%B8%96%E0%B9%88%E0%B8%B2%E0%B8%A2/sev-berd-%E0%B8%AB%E0%B8%A3%E0%B8%B7%E0%B8%AD-black-fortress-%E0%B9%83%E0%B8%99-gyumri-%E0%B8%AD%E0%B8%B2%E0%B8%A3%E0%B9%8C%E0%B9%80%E0%B8%A1%E0%B9%80%E0%B8%99%E0%B8%B5%E0%B8%A2.jpg?s=170x170&k=20&c=LY3rJrELQAr7vP9LTUWxpg4xKDIw9dssB-1-4F_ULPk='
    },
    {
      name: "Սյունիք",

      description: 'Սյունիքի մարզ, ամենաբարձր կարգավիճակ ունեցող վարչատարածքային միավոր Հայաստանի հարավում։ Հյուսիսում սահմանակից է Հայաստանի Վայոց ձորի մարզին, հյուսիս-արևելքում՝ Արցախի Հանրապետության[Ն 1] Շահումյանի շրջանի քարվաճառյան հատվածին և Քաշաթաղի շրջանին, հարավում՝ Իրանի Իսլամական Հանրապետությանը Արևելյան Ադրբեջան նահանգին, արևմուտքից՝ Ադրբեջանի Հանրապետության կազմում ընդգրկված Նախիջևանի Ինքնավար Հանրապետության Ջավախքի, Օրդուբադի և Շահբուզի շրջաններին[1]։ Սյունիքն ունի հազարամյակների պատմություն․ այն սկսվում է անհիշելի ժամանակներից, շարունակվում Վանի թագավորության, Մեծ Հայքի թագավորության, Սյունիքի իշխանության շրջաններով։ Մարզը հարուստ է պատմամշակութային ժառանգություն։ Այստեղ պահպանվել են նախնադարյան բնակատեղիներ, ամրություններ, դամբարանադաշտեր, մեր թվարկությամբ թվագրվող ամրոցներ, կրոնական կառույցներ և ձեռակերտ այլ արժեքավոր օբյեկտներ[1]։',

      img: 'https://armenia-tour.am/wp-content/uploads/2015/12/1-1.jpg,https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRVEjZF93fLXdiuCptSLjFoMifkCtTe4Htz6-mrnWuzlbgXEhs22S1BjKLtJEBkobY96kM&usqp=CAU'
    },
    {
      name: "Տավուշ",

      description: 'Տավուշի մարզը գտնվում է Հայաստանի հյուսիսարևելյան հատվածում։ Ընդգրկում է Իջևանի, Տավուշի (նախկինում՝ Շամշադին), Նոյեմբերյանի, Դիլիջանի տարածաշրջանները և 5 քաղաքներ՝ Իջևան, Նոյեմբերյան, Բերդ, Դիլիջան և Այրում։ Մարզը սահմանակից է Վրաստանին, հյուսիսում և արևելքում՝ Ադրբեջանին։ Հայաստանի պետական սահմանից մարզին բաժին է ընկնում 400 կմ հատված, որից 352-ը՝ Ադրբեջանի հետ։ Մարզի կենտրոնով դեպի հյուսիս-արևելք հոսում է Աղստև գետը։ Ամենացածր կետը գտնվում է Դեբեդավան գյուղի մոտ (380 մ), ամենաբարձր կետը՝ Միափորի լեռնաշղթայի Մուրղուզ լեռն է (2993 մ)։ Հայաստանի Տավուշի մարզը տարածվում է Փոքր Կովկասի լեռնաշղթաների արտաքին շարի վրա (Վիրահայոց, Գուգարաց և Միափորի լեռներ)։ Գտնվում է Հայաստանի չափավոր խոնավ տարածաշրջանում։ [Գետ]]երը պատկանում են Կասպից ծովի (Կուր գետի) ավազանին և սնվում են հալոցքային, ստորերկրյա և անձրևային ջրերից։ Գտնվում է Երևանից 137 կմ հեռավորության վրա։',

      img: 'https://i1.wp.com/www.peopleofar.com/wp-content/uploads/tatev-monastery-armenia1.jpg?fit=960%2C644&ssl=1,https://armenia.travel/_next/image/?url=https%3A%2F%2Fapi.armenia.travel%2Fstorage%2F002-Vayots-Dzor-highres-original-on-external-drive--4-1.jpg&w=3840&q=75'
    },
    {
      name: "Վայոց ձոր",

      description: 'Վայոց ձորի մարզ, մարզի կարգավիճակ ունեցող վարչատարածքային միավոր Հայաստանի հարավարևելյան վերջույթում։ Զբաղեցնում է պատմական Հայաստանի Սյունյաց նահանգի նույնանուն գավառի հիմնական տարածքը։ Ներկայիս վարչատարածքային միավորը ձևավորվել է Հայկական ԽՍՀ-ի մաս կազմած Եղեգնաձորի և Վայքի (Ազիզբեկովի) շրջանների միավորման հետևանքով՝ 1995 թվականի բարեփոխումների արդյունքում։ Վայոց ձորի մարզը զբաղեցնում է 2,308 կմ² տարածք (7-րդը Հայաստանի մարզերի շարքում)։ Ընդգրկում է երեք հիմնական աշխարհագրական շրջաններ՝ Արփայի գոգավորություն, Վայքի ծալքաբեկորավոր լեռնաշղթա (ձգվում է հարավում) և Վարդենիսի հրաբխային լեռնավահան։ Հյուսիսում սահմանակցում է Գեղարքունիքի մարզին, հյուսիս-արևելքում՝ Արցախի Հանրապետությանը, հարավ-արևմուտքում՝ Սյունիքի մարզին, հարավային հատվածում՝ Նախիջևանին, իսկ արևմուտքում՝ Արարատի մարզին։ Մայրաքաղաք Երևանին անմիջապես չի հարում։ Վայոց ձորի մարզի վարչական կենտրոնը Եղեգնաձոր համայնքն է (բնակչությունը՝ 7800 մարդ), որը հանդիսանում է նաև մարզի խոշորագույն քաղաքը։ Վարչատարածքային միավորի մյուս քաղաքային բնակավայրերն են Վայքն ու Ջերմուկը։ Վերջինս համարվում է զբոսաշրջային կարևոր նշանակություն ունեցող առողջարանային քաղաք։',

      img: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQCJeUhoBO0plyCAiTUa9rZCMNtJOBcZePJ0lx_YN31V_CIB_wF8cY1puXURUjhL3a_dv8&usqp=CAU,https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQoK6zBzgoiXl0uYgcjg6wRBKx3QvM8qyj7GNm0-EvFeBAIAWh4tzE-iteETjVaOR6fvHo&usqp=CAU'
    }
  ]

  return (
    image !== ''
      ? <div><img onClick={() => setImage('')} src={image} /></div>
      : <div>
        <div style={{ display: "flex" }}>
          <div style={{ border: "1px solid", width: "400px", height: "60px" }}>Հայաստանի Հանրապետության  մարզերը</div>


          <div>

            {regions.map(
              (x, i) => <div

                key={i}
                onClick={() => setRegionN(i)}
                style={{ border: "1px solid black", width: "200px", height: "50px", cursor: "pointer" }}
              >
                {x.name}
              </div>
            )}


          </div>
          <div style={{ border: "1px solid black" }}>

            {regions[regionN].description}
            <img onClick={() => setImage(regions[regionN].img)} style={{ height: "500px", width: "600px" }} src={regions[regionN].img} />
            <div onClick={() => setImage('')}
              style={{
                height: "100%",
                width: "100%",
                position: "fixed",
                display: 'flex',
                justifyContent: "center",
                alignItems: 'center',
                backgroundColor: 'white'
              }}>
              <img src={image} style={{
                maxWidth: "70%",
                maxHeight: "70%",
                width: "auto",
                height: "auto"
              }} />
            </div >
          </div>
        </div>
      </div>

  )
}







export default App
