import { useState } from 'react'


function App() {
  const [regionN, setRegionN] = useState(0)

  const regions = [
    {
      name: "Արագածոտն",
      description: "Արագածոտն մարզի մարզկենտրոնը Աշտարակն-է,մարզպետը Սերգեյ Մովսիսյանը։Տարածքը-2753կմ²,բանկչությունը-141 հազար մարդ։Արագածոտնի մարզն իր անունը ժառանգել է պատմական Այրարատ աշխարհի Արագածոտն գավառի անունից։Արագածոտնը Հայաստանի այն մարզերից է, որտեղ հանդիպում են հայտնի բոլոր վերընթաց լանդշտաֆտային գոտիները։Արագածոտն մարզում է գտնվում Հայաստանի Հանրապետության ամենաբարձր լեռը Արագածը 4090մ; Այստեղ է գտնվում Փոքր Սիփան լեռը որը նաև հայտնի է Սիփան։  Մարզի հիմնական զարկերակը Քասաղ գետն է՝ Գեղարոտ և Ամբերդ գլխավոր վտակներով։ Քասաղի վրա կառուցվել է Ապարանի ջրամբարը։Արագածի մերձգագաթային սարավանդի վրա գտնվում է Քարի լիճը։Մարզում շատ են ոչ միայն բնական, այլև պատմական ու ճարտարապետական հուշարձանները։ Մարզկենտրոնի հարևանությամբ գտնվող Օշական գյուղում է գտնվում հայ գրերի ստեղծող սուրբ Մեսրոպ Մաշտոցի շիրիմ-դամբարանը։Մարզի տարածքով մեկ ցրված են միջնադարյան բազմաթիվ կառույցներ՝ կանգուն կամ ավերակ վիճակում։ Հայտնի են հատկապես Ամբերդը, Թալինի, Սաղմոսավանի, Աշտարակի եկեղիցիներն ու վանքերը։Արագածոտնի մարզում է գտնվում Բյուրականի նշանավոր աստղադիտարանը, որը հիմնադրվել և տասնամյակներ անընդմեջ ղեկավարել է աշխարհռչակ գիտնական Վիկտոր Համբարձումյանը։Քաղաքային համայնքների թիվը հասնում է 3-ի, իսկ գյուղական համայնքների թիվը 111-ի ։ Արագածոտն մարզի տեսարժան վայրերից են Բյուրականի աստղադիտարանը, արշակունիների դամբարանը, Սուրբ խաչ եկեղեցին,Ուշիբերդը և Սուրբ մեսրոպ մաշտոցի եկեղեցին։",
      img: ["https://th.bing.com/th/id/R.87c869e29b8c3d3690300bb2fc2682fd?rik=kbagh%2frySD7pxg&riu=http%3a%2f%2ffindarmenia.org%2fimages%2farmenia_1%2f1_8_1302952974.gif&ehk=rvSmbDQwGDnYCJCG%2bjbHSM6lubWlewxAhuYxylQ43us%3d&risl=&pid=ImgRaw&r=0",
        "https://th.bing.com/th/id/OIP.TwWothpNb3opkHCx2Z9sCwHaFh?w=210&h=180&c=7&r=0&o=5&dpr=1.3&pid=1.7"
      ]
    },
    {
      name: "Շիրակ",
      description: "Շիրակի մարզի մարզկենտրոնը Գյումրին-է, մարզպետը Մուշեղ Մուրադըանը։Տարծքը-2681կմ², բնակչությունը-300 հազար մարդ։ Շիրակի մարզի կենտրոնական և հարավային հատվածում տարածվում է Շիրակի դաշտը, իսկ հյուսիսային շրջանում՝ Աշոցքի սարահարթը, միաժամանակ Շիրակի մարզում են տարածվում Փամբակի, Բազումի լեռնաշղթաների, Եղնախաղի, Ջավախքի, Արագածի լեռնազանգվածների մի մասը։Մարզի տարածքում են գտնվում Արփի լիճ-ջրամբարը, Ախուրյանի ջրամբարի հայկական հատվածը և Մանթաշի ջրամբարը։ Արփի լիճը հանրապետությունում իր չափերով զբաղեցնում է երկրորդ տեղը Սևանա լճից հետո։ Տարածքում կազմավորվում և սկիզբ է առնում Ախուրյան գետը՝ Կարախան, Գյումրի, Կարկաչուն, Աշոցք վտակներով։ Արագածի լանջերի բազմաթիվ աղբյուրներից սկզբնավորվում և Ախուրյանի վտակներին են միախառնվում Մանթաշ, Գեղաձոր և այլ գետակներ։ Ախուրյան գետը համարվում է Շիրակի մարզի ջրային հիմնական զարկերակը։ Գետի ընդհանուր երկարությունը 186 կմ է, որից Շիրակի մարզում` մոտ 105 կմ։ Մարզի տարածքին հատկապես մեծ վնաս պատճառած երկրաշարժերից հայտնի են՝ 1319 թվականի Անիի, 1899 թվականի Կարսի, 1868 թվականի Գյումրիի, 1926 թվականի Լենինականի, 1988 թվականի Սպիտակի և այլ երկրաշարժեր։ ",
      img: ["https://tse4.mm.bing.net/th?id=OIP.utsyHHyoE-rSWKsU6EBXGQAAAA&pid=Api&P=0&h=180",
        "https://th.bing.com/th/id/OIP.9c6ezl4N8bh_BCUZFE6fhQHaE7?w=257&h=180&c=7&r=0&o=5&dpr=1.3&pid=1.7"
      ]
    },
    {
      name: "Լոռի",
      description: "Լոռու մարզի մարզկենտրոնը վանաձորն-է, մարզեպտը Արամ Խաչատրյանը։Տարածքը-3799կմ²,բնակչությունը-213 հազար մարդ։Մարզի վարչական կենտրոն հանդիսացող Վանաձոր քաղաքը համարվում է Հայաստանի երրորդ խոշորագույն քաղաքը՝ շուրջ 80 հազար բնակչությամբ։ Մյուս խոշոր բնակավայրերն են Ալավերդին, Ստեփանավանը, Սպիտակը, Թումանյանը, Ախթալան և Տաշիրը։Լոռին Հայաստանի արդյունաբերական մարզերից է։ Այստեղ են գործում Հայաստանի տնտեսության արդյունաբերական ճյուղի անկյունաքարային նշանակություն ունեցող մի շարք օբյեկտներ։Լոռին աչքի է ընկնում նաև հարուստ մշակութային ժառանգությամբ և պատմական անցյալով, որի մասին վկայում են տասնյակ վանքերը, բերդերը, ամրոցներն ու հուշակոթողները։«Լոռի» անվանումն առաջին անգամ հիշատակվում է 11-րդ դարում և կարող է փոխկապակցված լինել լոր թռչնի անվան հետ։ Լոռու մարզն ունի ցայտուն արտահայտված բնական սահմաններ։ Այն ընդգրկում է Դեբեդ գետի ավազանն ամբողջությամբ և հիմնականում ունի լեռնային ռելիեֆ՝ բարձրադիր լեռներ, անդնդախոր, երբեմն սուր կտրվածքով կիրճեր։Դեբեդ գետի խոշոր աղտոտողներից են համարվում մարզի խոշոր արդյունաբերական ձեռնարկությունները։",
      img: ["https://tse4.mm.bing.net/th?id=OIP.RElZyzMlnPHGrmGoQGr6cwHaFs&pid=Api&P=0&h=180",
        "https://th.bing.com/th/id/OIP.zD_qdsZU4TdrmEvurNgkHQHaE6?w=294&h=194&c=7&r=0&o=5&dpr=1.3&pid=1.7"
      ]
    },
    {
      name: "Տավուշի",
      description: "Տավուշի մարզի մարզկենտրոնը Իջևանն-է,մարզպետը Հայկ Ղալումըանը։Տարածք-2704կմ², բնակչությունը-134 հազար մարդ։ Ընդգրկում է Իջևանի, Տավուշի (նախկինում՝ Շամշադին), Նոյեմբերյանի, Դիլիջանի տարածաշրջանները և 5 քաղաքներ՝ Իջևան, Նոյեմբերյան, Բերդ, Դիլիջան և Այրում։Մարզը սահմանակից է Վրաստանին, հյուսիսում և արևելքում՝ Ադրբեջանին։Ամենացածր կետը գտնվում է Դեբեդավան գյուղի մոտ (380 մ), ամենաբարձր կետը՝ Միափորի լեռնաշղթայի Մուրղուզ լեռն է 2993 մ։Հայաստանի Տավուշի մարզը տարածվում է Փոքր Կովկասի լեռնաշղթաների արտաքին շարի վրա։Տեսարժան վայրերից են Տավուշի բերդը, Գոշավանք վանական համալիրը և պարզ լիճը։ ",
      img: ["https://tse3.mm.bing.net/th?id=OIP.XqzSTc65I9SJXJ_9R__luAHaHV&pid=Api&P=0&h=180",
        "https://th.bing.com/th/id/OIP.IdbJ7mejGyCMggyw3DTERwAAAA?w=188&h=150&c=7&r=0&o=5&dpr=1.3&pid=1.7"
      ]
    },
    {
      name: "Կոտայք",
      description: "Կոտայք մարզի մարզկենտրոնը Հրազդանն-է,մարզպետը Ահարոն Սահակյանը։Տարածքը-2,089կմ², բնակչությունը-254 հազար մարդ։Մարզի տարածքն ընդգրկում է Կոտայքի սարավանդը, Մարմարիկ գետի ավազանը, Հրազդան գետի ավազանի վերին ու միջին հատվածը, ինչպես նաև Գեղամա լեռնաշղթայի արևմտյան լանջերը։ Ներկայիս վարչատարածքային միավորը ձևավորվել է Հայկական ԽՍՀ-ի մաս կազմող Աբովյանի, Հրազդանի և Նաիրիի շրջանների միավորման հետևանքով։Ըստ ընդունված վարկածի՝ Կոտայք անվանումը կապված է Մեծ Հայքի Արշակունի թագավոր Խոսրով Կոտակի անվան հետ։Կոտայքի մարզն աչքի է ընկնում ներքին ջրերի առատությամբ։ Գետերից Հրազդանը, Գետառը, Ազատը ունեն ոռոգիչ նշանակություն։ Ակնա լճի բարձրությունը՝ 3032 մետր ջրերով ջրարմիացվում են ամառային արոտավայրերը։ Կոտայքի մարզի քաղաքային և գյուղական բնակավայրերի տարածքներում կան տասնյակ լճեր, որոնց մի մասը չորանում է ամռանը։ Կոտայքի մարզի լճերը տնտեսական նշանակություն գրեթե չունեն։ Դրանք հիմնականում օգտագործվում են ոռոգման նպատակներով և ունեն տեղական նշանակություն։ Մարզի ջրամբարներն օգտագործվում են ոռոգման, էներգետիկայի, ձկնաբուծական և բուժական նկատառումներով։ Հայտնի են Մարմարիկի և Աղբյուրակի ջրամբարները։  ",
      img: ["https://tse1.mm.bing.net/th?id=OIP.NPyV1NjLf9AzJTEGtzhNewAAAA&pid=Api&P=0&h=180",
        "https://th.bing.com/th/id/OIP.Kc4GCfTnnf16Tk4GsZZFngHaE8?pid=ImgDet&rs=1"
      ]
    },
    {
      name: "Գեղարքունիք",
      description: "Գեղարքունիքի մարզի մարզկենտրոնը Գավառ-է, մարզպետը Կարեն Սարգսյանը։Տարածքը-5,348կմ², բնակչությունը-278 հազար մարդ։Մարզն այնքան մեծ է, որ նրանում հանգիստ կտեղավորվեն Արարատի, Արմավիրի և Կոտայքի մարզերն ամբողջությամբ։Տարածքի մեծությամբ այն առաջինն է Հայաստանում։Ամբողջ տարածքի շուրջ 1/4-ը զբաղեցնում է Սևանա լիճը։Տարածքում շատ են հրաբխային կոները, որոնցից հայտնի են հատկապես Արմաղանն ու Աժդահակը, որոնց խառնարաններում գտնվում են համանուն լճերը։ Գլխավոր լեռնաշղթաներն են Գեղամա, Արեգունի, Սևանի, Արևելյան Սևանի, Վարդենիսի։ Սևանա լիճը ամբողջությամբ գտնվում է Գեղարքունիքի մարզում։ Գեղարքունիքի մարզում է գտնվում Սոթքի ոսկու խոշոր հանքավայրերը։Սևանա լճից է սկիզբ առնում Հրազդան գետը։տեսարժան վայրերից են Աժդահակը,կոթավանքը,հայրավանքը,Սևանա լիճը,Սևանավանքը և յոթ վերք մատուռը։ ",
      img: ["https://tse3.mm.bing.net/th?id=OIP.N3BZO324qrRHW7Tn3Jz7SwHaHE&pid=Api&P=0&h=180",
        "https://th.bing.com/th/id/OIP.KWad-9io0gmEHho-gIPhZgHaEK?pid=ImgDet&rs=1"
      ]
    },
    {
      name: "Վայոց Ձոր",
      description: "Վայոց Ձորի մարզի մարզկենտրոնը Եղեգնաձորն-է,մարզպետը Արարատ Գրիգորյանը։Տարածքը-2,308մ², բնակչությունը-49 հազար մարդ։Վարչատարածքային միավորի մյուս քաղաքային բնակավայրերն են Վայքն ու Ջերմուկը։ Վերջինս համարվում է զբոսաշրջային կարևոր նշանակություն ունեցող առողջարանային քաղաք։Վայոց ձորի մարզի անվանումը կապված է Մեծ Հայքի Սյունիքի նահանգի համանուն գավառի անվան հետ քանի որ մարզի ներկայիս սահմանները գրեթե նույնությամբ համընկնում են գավառի տարածքի հետ։Վայոց ձորի մարզը զբաղեցնում է պատմական Հայաստանի Սյունյաց նահանգի նույնանուն գավառի հիմնական տարածքը։ Ինչպես Վայոց ձորի, այնպես էլ նրանում գտնվող մի շարք բնակավայրերի մասին հայկական և օտարալեզու սկզբնաղբյուրներում կան բազմաթիվ հիշատակություններ և վկայություններ։Վայոց ձորի ջրագրական ցանցը բավականին խիտ է։ Մարզի ողջ տարածքով հոսում է Արփա գետը՝ իր Դարբ, Կապույտը, Գնիշիկ, Գրավ, Եղեգիս, Հերհեր, Մալիշկա, Ելփին և այլ վտակներով։ Այն սկիզբ է առնում Արցախի բարձրավանդակի հյուսիս արևմուտքից` 3200 մ բարձությունից, և թափվում Արաքս գետը՝ Նախիջևանի և Թուրքիայի սահմանի վրա։ Վայոց ձորի բոլոր գետերն ու գետակները սրընթաց են, արագահոս, ունեն մեծ անկում ու թեքություն և հարուստ են էներգետիկ պաշարներով։ Վայոց ձորը գինու արտադրությամբ զբաղվող Հայաստանի ամենանշանավոր մարզն է։ ",
      img: ["https://tse2.mm.bing.net/th?id=OIP.CuC1nNz7f7unPUkX44JmnwAAAA&pid=Api&P=0&h=180",
        "https://th.bing.com/th/id/OIP.90ikmtrnxNX3oDVNnIFmIAAAAA?pid=ImgDet&rs=1"
      ]
    },
    {
      name: "Արարատ",
      description: "Արարատի մարզի մարզկենտրոնը Արտաշատն-է,մարզպետը Սեդրակ Թևոնյանը։Տարածքը-2,096մ², բնակչությունը-311 հազար մարդ։Արարատի մարզի հարավարևմտյան եզրին զուգահեռ 6-13 կմ լայնությամբ ընկած է Արարատյան հարթավայրի հարավարևելյան մասը։ Հյուսիսում Երանոսի լեռնաշղթան է։ Հյուսիսային սահմանն անցնում է Ազատ և դրա վտակ Գողթ գետերով։ Հյուսիս-արևելքում Գեղամա լեռնաշղթայի հարավարևմտյան հատվածն է։ Տարածքի ամենացածր կետը հարավում է՝ Արաքսի հունի մոտ՝ 801 մ։ Ամենաբարձր կետը հյուսիս-արևելքում գտնվող Սպիտակասար լեռնագագաթն է՝ 3555,7 մ։Մարզի խոշոր գետերն են Արաքսը, Հրազդանը, Ազատը, Վեդին։ Համեմատաբար փոքր գետերից են Արածոն, Չորասու հեղեղատարը, Ազատի ու Վեդիի վտակները՝ Քաջառուն, Խոսրովը և այլն։Արարատի մարզի գետերը պատկանում են Արաքսի ավազանին։ Նրա տարածքով են անցնում Հրազդան գետն իր ստորին հոսանքով, իսկ Ազատ, Վեդի և Արածո գետը՝ ամբողջ ընթացքով՝ ակունքից գետաբերան։Արարատի մարզը տնտեսապես Հայաստանի ամենազարգացած մարզերից է, հատկապես կարևոր է մարզի գյուղատնտեսական նշանակությունը։ Ունենալով Արարատյան դաշտի մի մեծ հատված՝ մարզը տալիս է Հայաստանի գյուղատնտեսական արտադրանքի զգալի մասը։ Առավել զարգացած է երկրագործությունը։ Հիմնական պտղատու այգիներն են խաղողի, ծիրանի, դեղձի այգիները, մշակվում են նաև կեռաս, սալոր, խնձոր, տանձ և այլն։",
      img: ["https://findarmenia.org/images/armenia_1/1_9_1302952281.gif",
        "https://th.bing.com/th/id/OIP.g7S3HM78rba5JM3AU4_scwHaEo?pid=ImgDet&rs=1"
      ]
    },
    {
      name: "Սյունիք",
      description: "Սյունիքի մարզի մարզկենտրոնը Կապանն-է,մարզպետը Ռոբերտ Ղուկասյանը։Տարածքը-4,506մ², բնակչությունը-135 հազար մարդ։Մյուս խոշոր բնակավայրերն են Գորիսը, Սիսիանը, Քաջարանը, Մեղրին, Ագարակը։ Սյունիքն ունի հազարամյակների պատմություն․ այն սկսվում է անհիշելի ժամանակներից, շարունակվում Վանի թագավորության, Մեծ Հայքի թագավորության, Սյունիքի իշխանության շրջաններով։ Մարզը հարուստ է պատմամշակութային ժառանգություն։ Սյունիքի տարածքն ունի հարուստ կենսաբազմազանություն։ Այն հիմնականում կազմված է լեռնային գոտիներից։Սյունիքի անունը կապվում է պատմական Հայաստանի Սյունիք նահանգի հետ, որի տարածքի միայն մի մասն է ընդգրկում ներկայիս Սյունիքը։Սյունիքի մարզի տնտեսության ընդհանուր ծավալում գերակշռողը արդյունաբերության և գյուղատնտեսության ոլորտներն են։Արդյունաբերության հիմնական ճյուղերն են  հանքարդյունաբերությունը։Սյունիքի մարզը ունի 138 բնակավայր․ 7 քաղաք՝ Ագարակ, Գորիս, Դաստակերտ, Կապան, Մեղրի, Սիսիան և Քաջարան, ու 131 գյուղ։ տեսարժան վայրերից են Տաթևի վանքը,Շաքիի ջրվեժը,Որոտնավանքը ևՍատանայի կամուջը։",
      img: ["https://i2.wp.com/findarmenia.org/images/armenia_1/1_17_1302953271.gif",
        "https://th.bing.com/th/id/OIP.KoWziOVanVOi59EZiepPCAHaEW?w=319&h=187&c=7&r=0&o=5&dpr=1.3&pid=1.7"
      ]
    },
  ]

  return (
    <div>
      <div style={{ border: "1px solid black", height: "29px" }}><div style={{ marginLeft: "600px", color: "green" }}>Հայաստանը և իր մարզերը</div></div>
      <div style={{ display: "flex" }}>
        <div>
          {regions.map(
            (x, i) => <div
              key={i}
              onClick={() => setRegionN(i)}
              style={{ border: "1px solid black", height: "40px", backgroundColor: i === regionN ? "green" : "white", cursor: 'pointer' }}
            >
              {x.name}
            </div>
          )}
        </div>
        <div style={{ border: "1px solid black" }}>
          {regions[regionN].description}
        </div>
        <div>
          {
            regions[regionN].img.map(
              x => <img src={x} width={"220px"} alt="" />
            )
          }
        </div>
      </div>
    </div>
  )
}

export default App
