
import { useState } from 'react'

function App() {

  const [hrashaliqN, setHrashaliqN] = useState(0)



  const names = [
    {
      hrashaliq: "Չինական մեծ պարիսպ",

      history: "Չինական մեծ պարիսպ (長城, 长城, Chángchéng (Երկար պատ) կամ 萬里長城, 万里长城, Wànlǐ Chángchéng (Երկար պատ 10000 լի երկարությամբ), քարից, աղյուսից, հողից, փայտից և այլ նյութերից պատրաստված ամրությունների շարք։ Դրանք կառուցվել են հիմնականում արևելքից արևմուտք Չինաստանի հյուսիսային սահմանների երկայնքով՝ պաշտպանելու չինական պետություններն ու կայսրությունները Եվրասիական տափաստանների տարբեր քոչվոր խմբերի հարձակումներից և նվաճումներից։ Դեռևս մ.թ.ա. 7-րդ դարից սկսվել է պարսպի որոշ մասերի կառուցումը[3]։ Սրանք հետագայում միացվել են մյուս պարիսպներին Ցին Շի Հուանդի՝ Չինաստանի առաջին կայսեր կողմից (մ.թ.ա. 220–206 թվականներ)։ Այս պարսպից, իհարկե, շատ քիչ մասն է պահպանվել[4]։ Ավելի ուշ տարբեր դինաստիայի ներկայացուցիչներ վերակառուցել, նորոգել են հին պարիսպները՝ միևնույն ժամանակ ավելացնելով նոր շարքեր։ Պարիսպների ամենահայտնի հատվածը կառուցվել է Մին դինաստիայի (1368–1644 թվականներ) օրոք։ "
    },

    {
      hrashaliq: "Կոլիզեյ",

      history: "Կոլիզեում (լատ.՝ Colosseum կամ Coliseum), հայտնի է նաև որպես Փլավիոսների ամֆիթատրոն (լատ.՝ Amphitheatrum Flavium, իտալերեն.՝ Anfiteatro Flavio կամ Colosseo), Իտալիայում՝ Հռոմ քաղաքի կենտրոնում գտնվող օվալաձև ամֆիթատրոն։ Կառուցված լինելով տրավերտինով, հրաբխային տուֆով և բետոնե աղյուսներով[1]՝ այն երբևէ կառուցված ամենամեծ ամֆիթատրոնն է։ Կոլիզեումը գտնվում է Հռոմի Ֆորումի արևելքում։ Կառուցումը սկսել է Վեսպասիանոս կայսրը մ.թ. 72 թվականին[2], ավարտել է իր իրավահաջորդ ու ժառանգ Տիտոսը[3]՝ 80 թվականին։ Հետագա ձևափոխությունները կատարվել են Դոմիցիանոս կայսեր օրոք (81–96 թթ.)[4]: Այս երեք կայսրերը հայտնի են որպես Փլավիոսների դինաստիա, ամֆիթատրոնը լատիներեն անվանվել է նրանց ազգանունով՝ Փլավիոս (Flavius)։ "
    },

    {
      hrashaliq: "Մաչու Պիկչու",

      history: "Մաչու Պիկչուն անվանում են «քաղաք ավերակներում» կամ «քաղաք ամպերի մեջ», ինչպես նաև «ինկերի կորուսյալ քաղաք»։ Որոշ հնագետներ ենթադրում են, որ այս քաղաքը ստեղծել է ինկերի մեծն տիրակալ Պաչակուտեկը՝ որպես լեռնային սուրբ ապաստան, իր կայսրության նվաճումից հարյուրամյակ առաջ, այսինքն՝ մոտավորապես 1440 թվականին[16], և գործել է մինչև 1532 թվականը, երբ իսպանացիները ներխուժեցին ինկերի կայսրության տարածք[17]։ Սակայն իսպանացի կոնկիստադորները այդպես էլ չհասան Մաչու Պիկչու։ Քաղաքը չի ավերվել։ "
    },

    {
      hrashaliq: "Պետրա",

      history: "Պետրան ընկած է առևտրական երկու կարևոր ճանապարհների խաչմերուկում, որոնցից մեկը միացնում էր Կարմիր ծովը Դամասկոսին, մյուսը Միջերկրական ծովի մոտ Պարսից ծոցը կապում է Ղազային։ Պարսից ծոցից ուղևորվող քարավանները՝ բարձված թանկարժեք համեմունքներով, ստիպված էին շաբաթներ շարունակ հերոսաբար դիմակայել Արաբական անապատի դաժան պայմաններին, մինչ կհասնեին բավական նեղ Սիկ կանիոնի զովությանը. այնտեղից մոտ էր երկար սպասված Պետրան։ Այնտեղ ճանապարհորդները գտնում էին կերակուր, ծածկ և սառը, կենարար ջուր։ "


    },

    {
      hrashaliq: "Թաջ Մահալ",

      history: "Հիմնադրվել է 1632 թվականին Շահ Ջահան մողոլ կայսեր (կառավարել է 1628-1658 թվականներին) կողմից իր սիրելի կնոջ՝ Մումթազ Մահալի համար, որը մահացել էր 14-րդ երեխային լույս աշխարհ բերելիս (հետագայում այստեղ է թաղվել նաև ինքը՝ Շահ Ջահանը)։ Դամբարանը, որը ունի 74 մետր բարձրություն և հինգ գմբեթներ, իսկ չորս անկյունների մոտ տեղակայված են չորս մինարեներ (դրանք փոքր-ինչ թեքված են, որ կործանվելու դեպքում չվնասեն դամբարանը), գտնվում է 17 հա տարածք[8] զբաղեցնող համալիրի կենտրոնում, որ ներառում է նաև մզկիթ և հյուրատուն և տեղակայված է երեք կողմից ատամնավոր պարսպով շրջապատված այգում։ "
    },

    {
      hrashaliq: "Հիսուս Քրիստոսի արձան",

      history: "Հիսուս Ամենափրկիչ արձան (պորտ.՝ Cristo Redentor), Հիսուս Քրիստոսի հայտնի արձաններից, որը գտնվում է Ռիո դե Ժանեյրո քաղաքում՝ Կորկովադու լեռան գագաթին։ Համարվում է Բրազիլիայի և Ռիո դե Ժանեյրոյի խորհրդանիշը։ Ընդգրկվում է «Աշխարհի նոր յոթ հրաշալիքների» կազմում։ Արձանի բարձրությունը 38 մ է (ներառյալ պատվանդանը՝ 8 մ), ձեռքերի բացվածքը՝ 28 մ, ծանրությունը՝ 1145 տոննա։"
    },

    {
      hrashaliq: " Չիչեն Իցա",

      history: "Չիչեն Իցա, մինչկոլումբյան մայաների հսկայական քաղաք, որը կառուցվել է մայաների կողմից վերջին դասական ժամանակաշրջանի ընթացքում։ Հնագիտական տարածքը գտնվում է Մեքսիկայի Յուկատան նահանգի Տինում ինքնավար շրջանում [1]։"
    },
    {
      hrashaliq: " Գիզայի բուրգեր",

      history: "Հին հուշարձանների այս համալիրն ընդգրկում է երեք բրգային համալիրները, որոնք հայտնի են եգիպտական մեծ բուրգեր անվամբ, Մեծ սֆինքսի հսկայական արձանը, մի քանի գերեզմաններ, աշխատավորների գյուղը և արդյունաբերական համալիրը։ Այն գտնվում է Արևմտյան անապատում՝ Նեղոս գետից մոտավորապես 9 կմ դեպի արևմուտք՝ Գիզայի հին քաղաքում և Կահիրե քաղաքի կենտրոնից մոտավորապես դեպի հարավ-արևմուտք։ "
    }

  ]
  return (
    <div >
      <div style={{ display: "flex" }}>

        <div>
          {names.map((x, i) => <div
            key={i} onClick={() => setHrashaliqN(i)}
            style={{ border: "1px solid black", borderRadius: "20px", padding: 20, margin: 20, backgroundColor: "azure", width: "500px", cursor: 'pointer' }}>{x.hrashaliq}</div>)}
        </div>

        <div style={{ border: "1px solid black", borderRadius: 20, backgroundColor: "azure" }}>
          {names[hrashaliqN].history}
        </div>

      </div>




    </div>
  )
}

export default App
