import { useState } from 'react'
function App() {
  const [regionN, setRegionN] = useState(0)
  const regions = [
    {
      name: "Մերի Հարությունյան",
      age: "Մերի Հարությունյան Հարությունի:Ծնվել է 2010 թվականի դեկտեմբերի 19-ին,այս տարի կդառնա 13 տարեկան:Ութ տարեկանից հաճախել է երաժշտական դպրոց և մինչ օրս հաճածում է,առաջադիմությունը գերազանց է:Շատ է սիրում իր ընտանիքը:Սովորում է Ռաֆիկ Հարությունյանի անվան միջնակարգ դպրոցում է այնտեղ նույնպես սովորում է գերազանց:Նպատակասլաց է և ունի ուժեղ կամքի ուժ:Մերին շատ է սիրում երգել,նվագել,գիրք կարդալ և երեկոյան զբոսնել:Մերին ընկերասեր է և միշտ օգնում է ընկերներին:Մերին ունի շատ նուրբ հոգի և մի չմտածված խոսքից կարող է այնպես վիրաորվել,որ կյանքում չների այդ բառը ասող մարդուն:Մերին շատ բարի է բայց ունի նաև վատ կողմ,նա փոքր-ինչ հիշաչար է:Մերիի միակ վատ կողմը սա է:Նա բոլորի հանդեպ ցուցաբերում է լավ վերաբերմունք,բայց արժանանում լրիվ այլ վերաբերմունքի:Ունի քիչ ընկերներ, քանի որ շատերնե են կոտրել նրան:Մերիի համար ամենալավ գրողը Վահան Տերյանն է,քանի որ նրա գրած բանաստեղծությունները շատ գեղեցիկ ձևով են ներկայացված:Մերին շատ է ուզում ունենալ իր ամենասիրելի յութուբերի՝ KAR comedy-ի արտադրանքները,որոնք միայն վաճառվում են Զանգակ գրախանութում և նրա վեբ կայքում:Մերին ունի մեծ ընտանիք:Սիրում է երբ ինչ-որ գործ է անում և ստացվում է:Չի սիրում երբ նրան ստիպում են ինչ-որ բան անել:Մերին շատ է սիրում ուտել լաբշա և պիցա:Իր կյանքում կարևոր դեր է խաղում արդարությունը,ճշմարտությունը և անկեղծությունը:Մերին չի սիրում երբ ստում են և այդ պատճառով չի ստում:Մերին մտածում է,որ ավելի լավ է պատասխան տալ արարքի համար քան ստել ու ամբողջ կյանքում:"
    },
    {
      name: "Մարիամ Հարությունյան",
      age: "Մարիամ Հարությունի Հարությունյան:Ծնվել է 2023 թվականի հունիսի 17-ին,այս ամիս կդառնա 2 ամսական:Մարիամն այս տան ամենափոքր անդամն է:Նա շատ գեղեցիկ է սիրում է լսել զրույցներ և չի սիրում քնել:"
    },
    {
      name: "Գագիկ Հարությունյան",
      age: "Գագիկ Հարությունի Հարությունյան:Ծնվել է 2012 թվականի հոկտեմբերի 22-ին,այս տարի կդառնա 11 տարեկան:Գագիկն ունի ագռեսիվ բնաորություն երբ մի բան նրա դուրը չի գալիս կամ նրա ուզածը չի լինում լացում է կամ վատ բառեր է օգտագործում:Գագիկը չնայած նրան,որ նման բաներ է անում նրան բոլորը շատ են սիրում, որովհետև Նա բոլորին օգնում է և բոլորին շատ է սիրում:Գագիկը շատ է սիրում ծաղալ և եթե նույնիսկ ունենում է առաջադրանք միևնույնն է բաց թողնելով դրանք գնում է ընկերոջ հետ ծաղալու:Նա շատ ընկերասեր է և ընկերների համար կարող է նույնիսկ պատժվել:Նա պաշտպանում է թույլերին և աղջիկներին և այդպես մի ունի նրան հարգող շատ ընկերներ:Նա ընդհանրապես չի սիրում կարդալ գրքեր,սիրում է նայել ծաղային վիդեոներ:Նրա սիրելի յութուբերը Seynt-Hov-ն է:Գագիկի սիրելի ուտելիքը բուրգերն է,իսկ սիրելի ըմպելիքը BOOM BEST-ն է,որը համարվում է էներգետրկ ըմպելիք:"
    },
    {
      name: "Գոհար Հարությունյան",
      age: "37 տարեկան"
    },
    {
      name: "Հարություն Հարությունյան",
      age: "39 տարեկան"
    },
    {
      name: "Հեղուշ Հարությունյան",
      age: "62 տարեկան"
    },
    {
      name: "Գագիկ Հարությունյան",
      age: "64 տարեկան"
    },
    {
      name: "Ռաֆիկ Հարությունյան",
      age: "30 տարեկան"
    },
    {
      name: "Հասմիկ Հարությունյան",
      age: "26 տարեկան"
    },
    {
      name: "Նանե Հարությունյան",
      age: "Նանե Հարությունյան Ռաֆիկի:Ծնվելի 2022 թվականի սեպտեմբերի 25-ին,այս ամիս կդառնա 11 ամսական:Նանեն ունի շատ գեղեցիկ աչքեր,նա շատ գեղեցիկ է և չես կարող նրա մոտով անտարբեր անցնել:Նրան բոլորս շատ ենք սիրում:Նա արդեն սկսել է չոչ անել:Սիրում է չոչել:Նա այնքան է ակտիվացել,որ երբ արդնանում է միանգամից նստում է:"
    },
    {
      name: "Հասմիկ Հարությունյան",
      age: "38 տարեկան"
    },
    {
      name: "Կարինե Հարությունյան",
      age: "38 տարեկան,"
    },
  ]
  return (
    <div>
      <div style={{ display: "flex" }}>
        <div>
          {regions.map(
            (x, i) => <div
              key={i}
              onClick={() => setRegionN(i)}
              style={{ border: "1px solid blue" }}
            >
              {x.name}
            </div>
          )}
        </div>
        <div style={{ border: "1px solid blue" }}>
          {regions[regionN].age}
        </div>
      </div>
    </div>
  )
}
export default App
