export const mambers = [



    {
        anun: "Զարնի-Պարնի քարայր-ամրոց",
        content: [{
            tit: "Նկարագրութթյուն",
            parberutyun: `Լոռու մարզի առեղծվածային անկյուններից է Զարնի-Պարնի քարայր-ամրոցային համալիրը՝ տեղակայված Հաղպատի վանքի արևմտյան հատվածում։ Պատմական նշանակություն ունեցող այս համալիրի կառուցվածքային մասն են կազմում «Զարնի էր», «Պարնի էր» և «Ծակ էր» քարանձավները։ Անվանման ծագումնաբանությունից ակնհայտ է դառնում, որ նման կերպ է այն կոչվել ի պատիվ Զարեհ թագավորի։ Զարնի՝ որպես «Զարեհի Էր» (այր, քարայր), իսկ Պարնի՝ որպես «Պարոնների Էր» (այր, քարայր)։ Համաձայն ավանդազրույցների՝ Զարեհ իշխանը՝ իր իշխանական տոհմի ազնվական մարդկանց հետ միասին, հակառակորդի հարձակումներից պաշտպանվելու ժամանակ, այստեղ են պատսպարվել և պահպանել Հաղպատի վանական համալիրին պատկանող ձեռագրեր և գանձեր, իսկ իրենց հանգիստն առել երկրորդ քարանձավում, որն էլ համապատասխանաբար անվանակոչվել է «պարոնների այր»։Իր յուրահատկությամբ է առանձնանում նաև «Ծակ էր» քարանձավը, որտեղ, 11-12-րդ դդ․ ճգնել-ստեղծագործել է հայ մատենագիր, մեծ գիտնական և փիլիսոփա Հովհաննես Իմաստասերը։ Քարայր կարելի է հասնել երկու ճանապարհով։ Առաջինը՝ պատմական ուղին է, որը սկիզբ է առնում Հաղպատ գյուղի արևմտյան կողմից և ունի մոտ 650 մետր երկարություն։ Երկրորդ ճանապարհը՝ սկիզբ է առնում Ծաղկաշատ և Հաղպատ գյուղերի ճամփաբաժանից և ունի 1250 մետր երկարություն։

        `},
        {
            tit: "Նկարագրություն",
            parberutyun: `
        
            Զարնի-Պարնի ամրոցի պատերի ներսում մարդկային կենցաղավարության մասին են վկայում բազմաթիվ գտածոններ, ինչպիսին է օրինակ պատմությունից փրկված և մինչ օրս պահպանված գինու հնձանը, որն արտացոլումն է այն իրականությունը, որ այստեղ խաղողի մշակությունն ու գինեգործությունը մշտապես կենսական նշանակություն է ունեցել: Հասարակ լոռեցի աշխատավոր մարդու կենսագործունեության, ավանդույթների ու մշակույթի «շունչը» հաղորդելու, ինչպես նաև պատմությանը վերածնունդ տալու նպատակով առկա են բացառիկ իրերի ցուցանմուշներ՝ արոր, լուծ, զնդան, կամ, երկանք, կժեր, թրեր տաշտեր ու տնտեսության մեջ օգտագործված զանազան առարկաներ։
            
            Կենսական է նաև ամրոցում առկա գմբեթային աղբյուրի առկայությունը, որն այժմ տեղացիներն անվանել են «Կաթիլային աղբյուր»: Այն միանգամայն մաքուր ջուր է, որը, ըստ ժողովրդական ավանդության, օժտված է բժշկարար հատկությամբ։ Թումանյանանկան բնաշխարհի ու պատմական իրականության ներդաշնակությունը լիարժեք վայելելու, ինչպես նաև կրակի մոտ ջերմ երեկոներ անցկացնելու համար համար ամրոցի ներսում կա նաև գետնափոր կրակատեղի։
            
            Վերջին շրջանում այն վերանորոգվել է, որոշակի ամրացման աշխատանքեր կատարվել, ճանապարհը կարգի բերվել։ Մասնավոր ներդրողի ջանքերով այստեղ առկա է թանգարան, սրճարան, գինետուն, հուշանվերների կրպակ։ Վերջիններս աշխատում են միայն ամառան ամիսներին։ Զարնի-Պարնի քարայր-ամրոցային համալիրում բնությունը միաձուլվում և դառնում է համահունչ պատմամշակութային իրականությանը։`
        }],
        img: ["https://tse1.mm.bing.net/th?id=OIP.Cx5H2TYTrrOccWmuEMUJ6QHaE7&pid=Api&P=0&h=220",
            "https://tse2.mm.bing.net/th?id=OIP.76Iy6bpq5_9pp54Gwct24wHaE7&pid=Api&P=0&h=220"
        ]
    },


    {

        anun: "Սատանի կամուրջ",
        content: [{
            tit: "Ընդհանուր ակնարկ",
            parberutyun: `Սատանի կամուրջ՝ բնական կամուրջ Որոտան գետի վրա, ՀՀ Սյունիքի մարզում: Երկարությունը մոտ 30 մ է, լայնությունը՝ 50-60 մ: Գոյացել է շրջակայքի հանքային աղբյուրների կրաքարային նստվածքներից՝ տրավերտիններից: Շրջակայքում և կամրջի տակ կան շթաքարեր ու պտկաքարեր: Սատանի կամրջի վրայով է անցնում Գորիս- Տաթև ավտոճանապարհը:`
        },
        {
            tit: "",
            parberutyun: `«Սատանի կամուրջ» անվան հետ կապված տարբեր վարկածներ կան: Ոմանք ասում են, որ անունը կապված է կամրջի տակ ջրում խեղդվելու բազմաթիվ դեպքերի հետ: Կա վարկած, որ ավելի քիչ ջուր է մտնում կամրջի տակ քան դուրս է գալիս: Դա պայմանավորված է նրանով, որ վերևից հանքային ջրեր են կաթկթում:
    
            Հնարավոր է լողալով անցնել կամրջի տակով և դուրս գալ հակառակ կողմից, բայց դա կարելի է անել միայն լավ լողալ իմացողներին, փորձառու մարդու ուղեկցությամբ, և սակավաջուր ամիսներին (օգոստոս, սեպտեմբեր):`
        }],
        img: ["https://tse3.mm.bing.net/th?id=OIP.561NCYQLb8jWmwQKooVZAQHaE8&pid=Api&P=0&h=220",
            "https://tse1.mm.bing.net/th?id=OIP.Ca2FlRzSx0_cSw5QDKGTswHaE7&pid=Api&P=0&h=220"
        ]
    },


    {

        anun: "Գառնու հեթանոսական տաճար",
        content: [{
            tit: "Ընդհանուր ակնարկ",
            parberutyun: `Ենթադրվում է, որ տաճարը նվիրված է եղել արևի աստված Արեգ-Միհրին։ Հայ արքաները, մասնավորապես Տրդատը, իրենց աստված-հովանավորն էին համարում Միթրային, և բնական է թվում այն ենթադրությունը, որ հզոր Հռոմի դեմ հաղթանակից ու նրա իսկ կողմից թագադրվելուց հետո, վերադառնալով հայրենիք, իր գահանիստ վայրում կկառուցի Գառնին, տաճար՝ նվիրված հենց իր հովանավոր-աստված Միհրին։ Միհրը, իբրև լույսի, ճշմարտության խորհրդանիշ, հաճախակի պատկերվել է ցլի (խավարի) դեմ մենամարտելիս։4-րդ դարի առաջին տարիներին տաճարի ներսում և դրսում կատարվել են բարենորոգման աշխատանքներ. այն վերափոխվում էր իբրև «տուն հովանոց»։ Վերացվել են դրսի զոհասեղանները, ներսի կուռքը, ծածկվել է երդիկի բացվածքը, վերացվել երդիկից թափվող ջրերի հեռացման համար հատակի վրա ստեղծված քարակերտ հարմարանքը, և այդ մասը սալահատակվել, վերափոխվել է տաճարի մուտքը՝ այն հարմարացնելով բնակության համար։

        `},
        {
            tit: "Պատմություն",
            parberutyun: `Գառնու պեղումների ընթացքում հայտնաբերված որոշ բեկորների ուսումնասիրությունը Մառին բերեցին այն եզրակացության, որ քրիստոնեական կրոնի ընդունումից հետո հեթանոսական տաճարը վերակառուցվել է և նրա ցելլայի մեջ ստեղծվել է եկեղեցի։ Այդ տեսակետին են Խաչատուր Դադայանը, Յա. Սմիռնովը, Կ. Վ. Տրևերը։ Դրան համակարծիք չէ Ալեքսանդր Սահինյանը։ Ըստ նրա՝ եկեղեցին եղել է, բայց այն կառուցված է եղել անտիկ տաճարի արևմտյան կողմում։ Այդ քառաբսիդ եկեղեցին կառուցվել է 7-րդ դարում, որի ավերակները ցարդ նույն տեղում են։Տաճարը հելլենիստական շրջանի ճարտարապետությանը բնորոշ պերիպտեր տիպի կառույց է (պերիպտեր՝ չորս կողմից սյունաշարերով եզերված աղոթասրահ)։ Կանգնած է բարձր պատվանդանի վրա, որի գլխավոր մուտքի առաջ ունի ինն աստիճանից բաղկացած քարե սանդուղք։ Եռանկյուն ճակտոնը (հյուսիսային ճակատ) եզերված է ատամնաշարի և բուսական ու երկրաչափական քանդակների հարուստ համադրությամբ։ Երկթեք տանիքը ծածկված է բազալտե սալիկներով՝ միացված արճճով ամրացված գամերով։ Վիմագրական, մատենագիտական ու հնագիտական նյութերի համատեղումով արդեն պարզված է, որ տաճարը կառուցել է Տրդատ Ա թագավորն իր թագավորության 11-րդ տարում, այսինքն՝ մ. թ. 77 թվականին։

            Մասնագետների մեծագույն մասը տաճարը համարում է «հռոմեական», «հունահռոմեական» հուշարձան կամ նրա ճարտարապետությունը կապում հելլենիստական ընդհանուր արվեստի հետ՝ գրեթե միշտ ընդգծելով (ավելի կամ պակաս չափով) հուշարձանի ճարտարապետական-կառուցողական արվեստում դրսևորվող տեսակի առանձնահատկությունները։
            
            Մի մասը հուշարձանը դիտում է իբրև հայկական-հելլենիստական կառուցվածք, իսկ որոշ հեղինակներ, ճիշտ հակառակը, այն համարում են միանգամայն «պատահական», «օտար մարմին» հայկական հողի վրա։ Մառը, խոսելով հայ մշակույթի, մասնավորապես ճարտարապետության մասին, դրանք չի համարում օտար երկրներից բերած բույս, այլ նշում է, որ դրանք միշտ եղել են իրենց «ինքնուրույն դրոշակակիրը»։ Հայկական ճարտարապետության մեջ նա տեսնում էր երկու ուղղություն՝ առաջինը տեղական, երկրորդը՝ կազմավորված հունահռոմեական ճարտարապետության ազդեցության ներքո։`
        }],
        img: ["https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Garni-msu-wlm-3121.jpg/450px-Garni-msu-wlm-3121.jpg",
            "https://tse3.mm.bing.net/th?id=OIP.reWm2qgoO4a_jUn-adgLyQHaFB&pid=Api&P=0&h=220"
        ]
    },


    {
        anun: "Պարզ լիճ",
        content: [{
            tit: "Ընդհանուր ակնարկ",
            parberutyun: `Պարզ լիճը աղբյուրներից սկսվող, հոսք ունեցող լիճ է։ Այն ունի 300մ երկարություն և 100մ լայնություն։ Միջին խորությունը 3 մ է, առավելագույնը 10 մ։ Մակերեսը կազմում է 0.027 քառակուսի մ, ծավալը 83.8 հազար խորանարդ մետր։ Զարգացած են սողանքային երևույթները։ Շրջապատված է անտառներով։

            `
        },
        {
            tit: "Նկարագրություն",
            parberutyun: `Լճի ջուրը թափանցիկ է, կանաչավուն երնագով: Մոտակայքում սաղարթապիտ անտառն է, որի հիասքանչ արտացոլանքը զարդարում է լճի մակերևույթը: 
            
            Ափամերձ գոտին հարթ է, հվ. գոտին՝ քարքարոտ։ Ամռանը ջրի ջերմաստիճանը հասնում է 15.50 C: Սնումը աղբյուրներից և մթն. տեղումներից է։ Ավազանն անտառածածկ է, ունի ռեկրեացիոն նշանակություն: Պարզ լիճը Կիրակոս Գանձակեցու մոտ կոչվում է «Տըզկա Ծով»։
            
            Ըստ լեգենդի, նորապսակների մի զույգ է խեղդվել այս լճում: Դարձել է ավանդույթ. բոլոր նորապսակները պսակադրման օրը այցելում են Պարզ լիճ զոհված ամուսինների հիշատակը հարգելու:`
        }],
        img: ["https://sp.yimg.com/ib/th?id=OIP.EW_bTmT7C8AaeFD1NyvYOwHaE8&pid=Api&w=148&h=148&c=7&dpr=2&rs=1",
            "https://onewaytour.com/wp-content/uploads/2018/04/SAYTINKARNER-233333333.jpg"

        ]
    },


    {

        anun: "Շաքիի ջրվեժ",
        content: [{
            tit: "Ընդհանուր ակնարկ",
            parberutyun: `Ջրվեժի տեղանքը իրենից ներկայացնում է խորը կիրճ՝ հարուստ ժայռերով և քարայրներով։ Դրանցում հայտնաբերվել են մարդու գործունեության հետքեր, ինչպես նաև մոխիր, որը թվագրվում է պալեոլիթի ժամանակաշրջանին։ Գեղատեսիլ է։ Գետի ջրի մեծ մասը տարված է Շաքիի ՀԷԿ, ջրվեժով թափնում է նրա փոքր մասը։`
        }, {
            tit: "Նկաարագրություն",
            parberutyun: `Այն գրանցված է Հայաստանի Հանրապետության Բնապահպանության նախարարության բնության պետական հուշարձանների ցանկում։ Բնության պետական հուշարձանների ցանկում ներառվել է 2008 թվականի օգոստոսի 14-ին ընդունված «Հայաստանի Հանրապետության բնության հուշարձանների ցանկը հաստատելու մասին» ՀՀ Կառավարության որոշման համաձայն։Թշնամիները Գեղարքունի գավառից 93 կույս աղջիկ են ուղարկում Մուղանում բանակ դրած իրենց առաջնորդին։ Երբ գերի աղջիկների քարավանը հասնում է այստեղ, դիմելով իրենց առևանգիչներին, նրանք ասում են՝ «Մենք երկար ճանապարհին շատ փոշոտվել ու կեղտոտվել ենք, թույլ տվեք գետում լողանանք, նոր ներկայանանք ձեր մեծին»։ Առևանգիչները համաձայնում են։ Աղջիկները մերկանալով նետվում են Որոտանի ալիքների մեջ և սուզվելով անհետանում։ Միայն Շաքե անունով մի կապուտաչյա աղջիկ Որոտանը թափվող գետակի միջով փախչելով, փորձում է ազատվել։ Թշնամիները հասնում են նրա ետևից, սակայն նույն վայրկյանին գետակի մեջ հրաշքով մի ժայռ է խոյանում, և ջուրը նրա վրայով գահավիժելով, իր ճերմակ փրփուրների տակ թաքցնում է Շաքեին։ Դրանից հետո այդ ջրվեժն ու նրա մոտ գտնվող գյուղը կոչվում են Շաքեի անունով։`
        }],
        img: ["https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/Shaki_Waterfall%2C_Armenia_-_%D5%87%D5%A1%D6%84%D5%AB%D5%AB_%D5%BB%D6%80%D5%BE%D5%A5%D5%AA%2C_%D5%80%D5%A1%D5%B5%D5%A1%D5%BD%D5%BF%D5%A1%D5%B6.jpg/390px-Shaki_Waterfall%2C_Armenia_-_%D5%87%D5%A1%D6%84%D5%AB%D5%AB_%D5%BB%D6%80%D5%BE%D5%A5%D5%AA%2C_%D5%80%D5%A1%D5%B5%D5%A1%D5%BD%D5%BF%D5%A1%D5%B6.jpg",
            "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Shaki_Waterfall2.jpg/608px-Shaki_Waterfall2.jpg"
        ]


    },


    {

        anun: "Սևանա լիճ",
        content: [{
            tit: "Ընդհանուր բնութագիր",
            parberutyun: `Սևանա լիճը Հայկական բարձրավանդակի՝ մեծությամբ երրորդ լիճն է՝ Վանա լճից և Ուրմիոյից հետո։ Ի տարբերություն այդ երկուսի՝ բաց լիճ է և ունի քաղցրահամ ջուր։ Լիճ են թափվում 28 մեծ ու փոքր գետակներ որոնցից են՝ Արգիճի, Մասրիկ, Գավառագետ, Կարճաղբյուր, Վարդենիս, Ձկնագետ, սակայն սկիզբ է առնում միայն մեկը՝ Հրազդանը։ Վերջինիս շնորհիվ ջրերի տարեկան արտահոսքը կազմում է 0.7 կմ3։

    
    Պատմական տարբեր ժամանակաշրջաններում լիճն ունեցել է տարբեր անուններ՝ Գեղարքունյաց ծով, Գեղամա ծով , պարսկական Դարյա-Շիրին, անտիկ շրջանում Լիկնիտիս , որը ծագել է հայերեն լիճ բառից։ Ուշ միջնադարում լիճը կոչվել է նաև «Գյոքչա», որը թարգմանաբար նշանակում է «կապույտ ջուր»։ 1901 թվականին հրատարակված Յուժակովի հանրագիտարանում նշված է նաև հին պարսկերեն անվանումը՝ Գաոսրավագա:`}, {
            tit: "Նկարագրություն",
            parberutyun: `Լճի ծագումնաբանական վարկածներից մեկի համաձայն՝ այն առաջացել է չորրորդական ժամանակաշրջանում։ Գոյացել է հրաբխային գործունեության հետևանքով՝ միջլեռնային տեկտոնական իջվածքում սառցադաշտային և ձնհալոցքային ջրեր լցվելու արդյունքում։ Չորս կողմում առանձնակի շրջապատում են Արեգունու, Սևանի, Վարդենիսի, Գեղամա լեռները։
    
            Սևանա լճի ջրերը Հրազդան գետի միջոցով ոռոգում են Արարատյան դաշտը։ Հրազդան գետի վրա կառուցված 6 էլեկտրակայանները ձևավորում են հանրապետության ամենամեծ՝ Սևան-Հրազդան կասկադը։ Խորհրդային իշխանության տարիներին լճի մակարդակը զգալիորեն իջել է, ինչի հետևանքով տարածաշրջանում առաջացել է էկոլոգիական խնդիր։
            
            1978 թվականին ստեղծվել է Սևան ազգային պարկը։ Ջրի մակարդակը վերականգնելու համար կառուցվել է Արփա-Սևան , ապա՝ Որոտան-Արփա ջրատարները ։
            
            Անվանում
            Երկար ժամանակ լճի անունը բացատրվում էր հայերեն սև և վանք բառերից, որոնք բնութագրում էին Սևանավանքը։ Վերջինս կառուցել էր Սյունիքի իշխանուհի Մարիամ Բագրատունին սև տուֆից ։
            
            Սևանա լճի ափին կատարված հնագիտական պեղումների ժամանակ հայտնաբերվել է ուրարտական սեպագիր արձանագրություն, որը թվագրվում է մ.թ.ա. 9-6-րդ դարերին։ Այն թույլ է տալիս եզրակացնել, որ անվանումը կարող է ուրարտերեն լինել. սունիա նշանակում է «լիճ»։
            `
        }],
        img: ["https://tse4.mm.bing.net/th?id=OIP.PA_L8hvt3vRnccYRiwkFSQHaEz&pid=Api&P=0&h=220",
            "https://tse3.mm.bing.net/th?id=OIP.wKuhsnEp-5lBBLY9pDCXkgHaD5&pid=Api&P=0&h=220"
        ]

    },

    {

        anun: "Քարահունջ՝Զորաց քարեր",
        content: [{
            tit: "Ընդհանուր ակնարկ",
            parberutyun: `Քարահունջի տարիքի մասին առկա են բազմաթիվ, հաճախ իրար հակասող և ընդդիմացող տեսակետներ։ Մինչ օրս հուշարձանի տարիքի մասին առավել խորը ուսումնասիրությունը կատարել է ակադեմիկոս Պարիս Հերունին։ Նա «Հայերը և հնագույն Հայաստանը» գրքում 3 առանձին մեթոդներով մանրամասն ներկայացրել է իր կատարած աստղագիտական, ֆիզիկական և մաթեմատիկական հաշվարկները, որով հիմնավորել է, որ Քարահունջը կառուցվել է ավելի քան 7500 տարի առաջ։ Հատկանշական է նշել, որ Սթոունհենջի տարիքը որոշվել է հենց 1-ին մեթոդով, ինչը բավականին տարածված է գիտնականների մոտ։Քարահունջը բաղկացած է մի քանի խումբ կառույցներից և առանձին քարերից, որոնք միասին կազմում են մեգալիթյան մոնումենտը։ Այդ կառույցներն են՝ կենտրոնական շրջանը, հյուսիսային և հարավային թևերը, հյուսիս–արևելյան քարուղին, շրջանը հատող լարագիծը, ինչպես նաև առանձին կանգնած քարեր։

    `}, {
            tit: "Կառուցվածք",
            parberutyun: `Քարերը բազալտից են, որոնց բարձրությունը տատանվում է 0,5-ից մինչև 3 մ, իսկ զանգվածը՝ մինչև 10 տոննա։ Քարերի մեծ մասը պահպանվել է, չնայած էրոզիայի ենթարկվելու պատճառով ծածկված են քարաքոսերով։ Անցքերը ավելի լավ են պահպանվել։ Կան նաև կոտրված քարեր։
    
            Քարահունջի քարերը բերվել են մոտակա Դար գետի ձորի քարհանքից, բարձրացվել և տեղափոխվել են հյուսված պարաններով ու լծկան կենդանիների միջոցով։ Իսկ աստղադիտարանում բացվել են քարերի անցքերը ու պատրաստվել աստղագիտական գործիքները։Քարահունջի քարերից շատերը ունեն անցքեր, որոնք եզակի երևույթ են հնագույն մոնումենտներում։ Այդ հսկա քարերի մեջ արված անցքերը ապահովում են դեպի նպատակակետը ուղղվածության բարձր ճշգրտություն և կայունություն։`
        }],
        img: ["https://tse3.mm.bing.net/th?id=OIP.yrX5vI8BSK19-Nw9_WWOoAHaE8&pid=Api&P=0&h=220",
            "https://tse2.mm.bing.net/th?id=OIP.oA4rVa5krFUoRpRKeElikwHaE8&pid=Api&P=0&h=220"
        ]

    },

    {

        anun: "Լոռի բերդ",
        content: [{
            tit: "Աշխարհագրական դիրքը",
            parberutyun: `Լոռի կամ Լոռե բերդը գտնվում է Ստեփանավանից մոտ 5 կմ հյուսիս-արևելք՝ Ձորագետի ձախ ափին։ Հիմնադրել է Դավիթ Անհողինը հավանաբար՝ 1005 - 1020 թթ.։Լոռի բերդը ընդգրկում է 35 հա տարածություն, փռված է ընդարձակ, հրվանդանանման, ծովի մակարդակից 1490 մ բարձր սարահարթի վրա, Ձորագետի և դրա վտակ Ուռուտի միջև, որոնց խորը կիրճերը երեք կողմից անմատչելի են դարձրել ամրոցը։ `
        },
        {
            tit: "Ճարտարապետություն",
            parberutyun: `Միջնաբերդի համեմատաբար դյուրամատույց կողմից՝ հյուսիս-արևմուտքից, ձգվել է 214 մ երկարությամբ, իրար հաջորդող կլոր և քառանկյունի աշտարակներով պարիսպ, որի հյուսիսարևմտյան անկյունում է գտնվում բերդի միակ մուտքը։ Պարսպի լայնությունը տեղ-տեղ հասել է 20 մ, բարձրությունը՝ 20-25 մ։ Պարսպի երկարությամբ փորվել է ջրի խանդակ։ Միջնաբերդի պարսպից մոտ 500 մ հյուսիս-արևմուտք ձգվել է քաղաքի պարիսպը, որը համարյա չի պահպանվել։ Բացի բնական արգելքներից, միջնաբերդի կիրճերում կառուցվել են նաև արհեստական պատնեշներ։ Սկզբում Կյուրիկյանները, ապա՝ Զաքարյաններն ու նրանց հաջորդները Լոռիում կառուցել են պալատներ, եկեղեցիներ, բաղնիքներ, արվարձանները քաղաքից բաժանող կիրճերում՝ կամուրջներ, կանգնեցրել խաչքարեր։ Կառուցվել է նաև գետնուղի, որը ոլորապտույտ ճանապարհով հասել է մինչև Ուռուտ գետն ու ավարտվել աշտարականման կառույցով։ Գաղտնուղու նախնական մոտավոր չափերը՝ լայնությունը 120-130 սմ է եղել, իսկ պահպանված պատերի բարձրությունը տատանվում է 80 սմ-ից մինչև մեկ մետր։ Այն տեղերում, որտեղ ժայռը բացակայել է, շինարարները սալաքարերով արհեստական պատեր են շարել:Գաղտնուղին օգտագործել են արտաքին աշխարհի հետ կապ պահպանելու և անհրաժեշտության դեպքում խմելու ջուր ձեռք բերելու համար։`
        }],
        img: ["https://tse2.mm.bing.net/th?id=OIP.7F7oeVQxmg17vqlsR8aT7QHaEi&pid=Api&P=0&h=220",
            "https://tse4.explicit.bing.net/th?id=OIP.G1EGdW9gaypelDj6qq6WfAHaEK&pid=Api&P=0&h=220"
        ]


    },


    {

        anun: "Քարի լիճ",
        content: [{
            tit: "Աշխարհագրական դիրք",
            parberutyun: `Քարի լիճը գտնվում է Արագած լեռան վրա, բացարձակ բարձրությունը՝ 3207 մ, հայելու մակերեսը՝ 0,12 կմ2, խորությունը՝ 8 մ։ Առաջացել է սառցե գոյացություններից։ Լիճը երկարատև շրջապատված է լինում ձյունով, ինչի պատճառով ջուրը բավականին սառն է մնում։`
        },
        {
            tit: "Ընդհանուր բնութագիր",
            parberutyun: `Քարի լճի արևմտյան ափից սկիզբ է առնում Արքաշեն գետը։
 
    Լճի հարավային ափին է գտնվում Երևանի ֆիզիկայի ինստիտուտի Առաջնային տիեզերական ճառագայթների գրանցման ու հետազոտման կայանը, որը 1942 թվական հիմնել են Արտեմ Ալիխանյան և Աբրահամ Ալիխանով եղբայրները։
    
    Կայանի ջրամատակարարումն ապահովելու նպատակով լճի հարավային արտահոսքը փակվել է բետոնե պատով, որի հետևանքով բարձրացել է լճի մակարդակը, ձմռանը չի սառցակալում մինչև հատակը, իսկ գարնանն ամբարված ջուրը բավարարում է կայանի կարիքները ողջ տարին։ Լճում Իշխան ձուկ կա, որի քանակը տարեցտարի լրացվում է արհեստական բազմացված մանրաձկով։`}],
        img: ["https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Lake_Kari%2C_Armenia_12%E2%80%A408%E2%80%A42018_%2812%29.jpg/450px-Lake_Kari%2C_Armenia_12%E2%80%A408%E2%80%A42018_%2812%29.jpg",
            "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Jezero_Kari.jpg/714px-Jezero_Kari.jpg"
        ]


    },



    {

        anun: "Արագած լեռ",
        content: [{
            tit: "Աշխարհագրական դիրք",
            parberutyun: `Արագածը հրաբխային քառագագաթ լեռ է Հայկական լեռնաշխարհում՝ Հայաստանի կենտրոնական հատվածում՝ Արագածոտնի և Շիրակի մարզերի սահմանագլխին։ Ամենաբարձր կետը հյուսիսային գագաթն է, որն ունի 4096 մետր բարձրություն։Հայաստանի Հանրապետության ամենաբարձր գագաթն է։ Այն շրջապատից մեկուսացած, վահանաձև փռված լեռնազանգված է՝ մոտ 200 կմ շրջագծով։Հովհարաձև տարածված լանջերի հետ միասին գրավում է մոտ 4000 կմ² տարածություն Արարատյան ու Շիրակի դաշտերի, Ախուրյան ու Քասախ գետերի միջև։ Երեք կողմից նրան հարևան են հյուսիսից՝ Շարայի, արևելքից՝ Արայի, հարավ-արևմուտքից՝ Մեծ Արտենի լեռները։`
        },
        {
            tit: "Ընդհանուր ակնարկ",
            parberutyun: ` Եղել է պատմական Մեծ Հայքի Արագածոտն, Շիրակ և Նիգ գավառների սահմաններում։Արագած անվան ծագումը կապում են Հայկի որդի Արամանյակի կամ էլ Արա աստծո անունների հետ։Արագածը վաղ անցյալում եղել է աշխարհի խոշորագույն հրաբուխներից մեկը։ Ունի 400 մ խորությամբ և 3 կմ տրամագծով հսկա խառնարան, որի քայքայված պատերի մնացորդները կազմում են լեռան չորս կատարները։ Խառնարանը հարավարևելյան կողմից բաց է և կապվում է շրջապատին գետակների ու ջրվեժների միջոցով։ Կատարները դասավորված են կիսաշրջանաձև և կազմում են 270 աստիճանի աղեղ։ Ամենաբարձրը հյուսիսային կատարն է։ Արևմտյան գագաթն ունի 3995.3 մետր, արևելյանը՝ 3908.2 մ, իսկ հարավայինը՝ 3887,8 մ բարձրություն։ Խառնարանը ջրահավաք մեծ ավազան է։ Այստեղից է սկիզբ առնում Քասաղի վտակ Գեղարոտ գետը։Արագածի հավերժական ձյունե ծածկույթը մոտ 6 կմ² է։ Լեռն ունի մի քանի փոքր սառցադաշտեր, որոնցից ամենամեծը  խառնարանում է։ Սառցադաշտերը սնվում է Քասաղի վտակ Գեղարոտը։`
        }],
        img: ["https://tse1.mm.bing.net/th?id=OIP.gBVrr3zu0Aq9qCV9BmUR1wHaE5&pid=Api&P=0&h=220",
            "https://tse2.mm.bing.net/th?id=OIP.ECxKrZzzc0PW_cgsBGHDhgAAAA&pid=Api&P=0&h=220"
        ]


    },

    {

        anun: "Ամբերդ",
        content: [{
            tit: "Ընդհանուր ակնարկ",
            parberutyun: `Տեղադրված է եռանկյունաձև հրվանդանին, ծովի մակերևույթից 2300 մետր բարձրության վրա՝ Արքաշեն և Ամբերդ գետերի միացման տեղում։

    Գտնվել է Մեծ Հայքի Այրարատ նահանգի Արագածոտն գավառում, իսկ ներկա վարչական բաժանման համաձայն՝ Արագածոտնի մարզում՝ մայրաքաղաք Երևանից 55 կիլոմետր դեպի հյուսիս։Ամբերդ անունը ծագել է աղավաղման հետևանքով, նախնական անունը եղել է Անբերդ։ Ամբերդ անունը բացատրվում է որպես ամպի բարձրության բերդ, կից-բերդ։ Հանդիպում է նաև Անբերդ տարբերակը՝ անառիկ, անմատչելի բերդ։ Կոչվել է նաև Հանբերդ, Համբերդ, Ղըզղալա անուններով։Ամբերդում ամրոց է եղել դեռևս վաղնջական ժամանակներից։ Ամբերդի տարածքում կան կիկլոպյան շինությունների մնացորդներ, իսկ մոտակայքում՝ վիշապաձկների քարակոթողներ։ Բրոնզի դարում կառուցվել է ուրարտական բերդաքաղաք, հավանաբար տեղանքի բնական ամրության պատճառով։ Որպես բերդ-ամրոց այն հատկապես հայտնի էր հելլենիստական ժամանակաշրջանում և Քրիստոսի ծնունդից հետո, երբ այն կառուցվել է հետագայում ընդարձակվելով և պարբերաբար վերանորոգվելով։

    `}, {
            tit: "Պատմություն",
            parberutyun: `Դղյակը և պարսպի որոշ հատվածներ կառուցվել են Կամսարական իշխանների կողմից, հավանաբար 7-րդ դարում։ Դա կապվում է ինչ-որ եկեղեցուց պեղումների ժամանակ գտնված ճարտարապետական դետալի հետ, որի թվագրման հետ կապված խնդիրներ կան։ Դժվարամատչելի տեղերում ամրոցներ սկսեցին կառուցել 10-րդ դարից, երբ փոփոխվում էր երկրի պաշտպանական համակարգը։ Ինչ վերաբերում է Ամբերդին, ապա ներկայիս ամրությունը 11-13-րդ դարի կառույց է։Ամբերդ ամրոցն 8-րդ դարում անցել է Բագրատունիներին՝ հետագայում դառնալով Բագրատունիների թագավորության կարևորագույն ռազմական պատվարներից մեկը։ 10-րդ դարում Բագրատունի արքաներն այն հանձնել են հայոց զորքերի սպարապետներ Պահլավունի իշխաններին։ Դրա մասին վկայում է Անիի վարդապետ Գրիգոր Մագիստրոս Պահլավունու մոտ 1050 թվականին գրված նամակը, որում նշվում է, որ 10-րդ դարի սկզբին բերդը և մերձակա շինությունները պատկանում էին հզոր Պահլավունի իշխաններին։ 1045 թվականին Անիի Բագրատունիների թագավորության կործանումից երկու տարի անց՝ 1047 թվականին, բյուզանդական զորքերը գրավեցին Ամբերդը։ 11-րդ դարի 70-ական թվականներին Ամբերդը գրավեցին սելջուկ-թուրքերը և այն դարձրեցին զորակայան։`
        }],
        img: ["https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Amberd_fortress%2C_Aragatsotn_Province%2C_Armenia._DSCF2563-2.jpg/450px-Amberd_fortress%2C_Aragatsotn_Province%2C_Armenia._DSCF2563-2.jpg",
            "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Amberd_fortress_in_July_2014.jpg/330px-Amberd_fortress_in_July_2014.jpg"
        ]

    },
]