import { useState } from 'react'


function App() {

  const [hrashaliqner, setHrashaliqner] = useState(0)

  const vernagir = [{
    name1: "Աշխարհի նոր յոթ հրաշալիքներ",

  },]
  const erkrner = [{ erkir: " Չինաստան" },
  {
    erkir: "Իտալիա",
  },
  { erkir: "Պերու" },
  { erkir: "Հորդանան" },
  { erkir: "Հնդկաստան" },
  { erkir: " Բրազիլիա" },
  { erkir: "Մեքսիկա" },
  ]
  const hrashaliq = [

    {
      name: "Չինական մեծ պարիսպ",
      dascription: "Չինական մեծ պարիսպ (長城, 长城, Chángchéng (Երկար պատ) կամ 萬里長城, 万里长城, Wànlǐ Chángchéng (Երկար պատ 10000 լի երկարությամբ), քարից, աղյուսից, հողից, փայտից և այլ նյութերից պատրաստված ամրությունների շարք։ Դրանք կառուցվել են հիմնականում արևելքից արևմուտք Չինաստանի հյուսիսային սահմանների երկայնքով՝ պաշտպանելու չինական պետություններն ու կայսրությունները Եվրասիական տափաստանների տարբեր քոչվոր խմբերի հարձակումներից և նվաճումներից։ Դեռևս մ.թ.ա. 7-րդ դարից սկսվել է պարսպի որոշ մասերի կառուցումը[3]։ Սրանք հետագայում միացվել են մյուս պարիսպներին Ցին Շի Հուանդի՝ Չինաստանի առաջին կայսեր կողմից (մ.թ.ա. 220–206 թվականներ)։ Այս պարսպից, իհարկե, շատ քիչ մասն է պահպանվել[4]։ Ավելի ուշ տարբեր դինաստիայի ներկայացուցիչներ վերակառուցել, նորոգել են հին պարիսպները՝ միևնույն ժամանակ ավելացնելով նոր շարքեր։ Պարիսպների ամենահայտնի հատվածը կառուցվել է Մին դինաստիայի (1368–1644 թվականներ) օրոք։Պաշտպանական նշանակությունից բացի Չինական մեծ պարիսպը ունեցել է նաև սահմանների վերահսկողության նշանակություն՝ թույլ տալով Մետաքսի ճանապարհով ապրանքների անվնաս տեղափոխումը, առևտրի կանոնակարգումը, արտագաղթի և ներգաղթի վերահսկողությունը։ Դեռ ավելին՝ պարսպի պաշտպանական հատկանիշները բարելավվել են պահակակետ աշտարակների, զորանոցների, կայազորի կայանների, ծխի և կրակի միջոցով ազդանշաններ տալու համակարգերի ստեղծմամբ։ Միևնույն ժամանակ պետք է նշել, որ պարիսպների վրայի ուղին ինքնին եղել է նաև տրանսպորտային միջանցք։Տարբեր դինաստիաների կողմից կառուցված սահմանամերձ պարիսպները ունեցել են մի քանի երթուղիներ։ Ընդհանուր առմամբ դրանք ձգվել են արևելքում Դանդունից մինչև արևմուտքում Լոբնոր լիճ, հյուսիսում ներկայիս ռուս-չինական սամանից մինչև հարավում Ցինհայ՝ ուրվագծելով մոնղոլական տափաստանի եզրը աղեղի ձևով։ ",
      img: "https://i1.wp.com/chydesa-mira.ru/wp-content/uploads/2015/09/%D0%92%D0%B5%D0%BB%D0%B8%D0%BA%D0%B0%D1%8F-%D0%9A%D0%B8%D1%82%D0%B0%D0%B9%D1%81%D0%BA%D0%B0%D1%8F-%D1%81%D1%82%D0%B5%D0%BD%D0%B0-%D0%B7%D0%B0%D0%BA%D0%B0%D1%82.jpg",
    },
    {
      name: "Կոլիզեյ",
      dascription: "Կոլիզեում (լատ.՝ Colosseum կամ Coliseum), հայտնի է նաև որպես Փլավիոսների ամֆիթատրոն (լատ.՝ Amphitheatrum Flavium, իտալերեն.՝ Anfiteatro Flavio կամ Colosseo), Իտալիայում՝ Հռոմ քաղաքի կենտրոնում գտնվող օվալաձև ամֆիթատրոն։ Կառուցված լինելով տրավերտինով, հրաբխային տուֆով և բետոնե աղյուսներով[1]՝ այն երբևէ կառուցված ամենամեծ ամֆիթատրոնն է։ Կոլիզեումը գտնվում է Հռոմի Ֆորումի արևելքում։ Կառուցումը սկսել է Վեսպասիանոս կայսրը մ.թ. 72 թվականին[2], ավարտել է իր իրավահաջորդ ու ժառանգ Տիտոսը[3]՝ 80 թվականին։ Հետագա ձևափոխությունները կատարվել են Դոմիցիանոս կայսեր օրոք (81–96 թթ.)[4]: Այս երեք կայսրերը հայտնի են որպես Փլավիոսների դինաստիա, ամֆիթատրոնը լատիներեն անվանվել է նրանց ազգանունով՝ Փլավիոս (Flavius)։Համարվում է, որ Կոլիզեումը կարող է տեղավորել մոտավորապես 50,000 - 80,000 հանդիսատես[5][6], միջինում ունեցել է մոտ 65,000 հանդիսատես[7][8]։ Այն օգտագործվել է գլադիատորական մրցույթների, հանրային ներկայացումների, ինչպես օրինակ՝ նավմախիայի, (միայն շատ կարճ ժամանակահատվածում, քանի որ նկուղային հարկը լցվեց այլ զբաղմունքների համար նախատեսված մեխանիզմներով) կենդանիների որսերի, մահապատիժների, հայտնի մարտերի կրկնությունների և հռոմեական դիցաբանության վրա հիմնված դրամաների համար։ Վաղ միջնադարում կառույցը դադարեցին օգտագործել զվարճանքների համար։ Հետագայում այն օգտագործվեց այլ նպատակների՝ բնակեցման, արհեստանոցների համար, որպես հոգևորականների թաղամաս, ամրոց, քարհանք և քրիստոնեական սրբավայր։Չնայած երկրաշարժերի պատճառով մասամբ ավերված լինելուն, Կոլիզեումը մինչ օրս Հռոմեական կայսրության պատմական խորհրդանիշներից է և համարվում է Աշխարհի նոր յոթ հրաշալիքներից[9] մեկը։",
      img: "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Colosseum_in_Rome%2C_Italy_-_April_2007.jpg/450px-Colosseum_in_Rome%2C_Italy_-_April_2007.jpg ",
    },
    {
      name: "Մաչու Պիկչու",
      dascription: "Մաչու Պիկչու (/ˈmɑːtʃuː ˈpiːktʃuː/[1][2][3][4][5][6] կամ /-ˈpiːtʃuː/[3][7][8], Իսպաներեն արտասանություն՝ [ˈmatʃu ˈpi(k)tʃu][9], կեչուա՝ Machu Pikchu[10], թարգմանաբար «հին գագաթ»[11]), քաղաք հին Ամերիկայում, գտնվում է ժամանակակից Պերուի տարածքում` Ագուաս Կալիենտես ավանից 6 կմ հեռու[12]։ Տեղակայված է լեռնաշղթայի գագաթին՝ ծովի մակերևույթից 2500 մետր բարձրության վրա[13][14], իշխում է Ուրուբամբա գետի հովտի վրա։ 2007 թվականին արժանացել է Աշխարհի նոր յոթ հրաշալիքներ կոչմանը[15]։Մաչու Պիկչուն անվանում են «քաղաք ավերակներում» կամ «քաղաք ամպերի մեջ», ինչպես նաև «ինկերի կորուսյալ քաղաք»։ Որոշ հնագետներ ենթադրում են, որ այս քաղաքը ստեղծել է ինկերի մեծն տիրակալ Պաչակուտեկը՝ որպես լեռնային սուրբ ապաստան, իր կայսրության նվաճումից հարյուրամյակ առաջ, այսինքն՝ մոտավորապես 1440 թվականին[16], և գործել է մինչև 1532 թվականը, երբ իսպանացիները ներխուժեցին ինկերի կայսրության տարածք[17]։ Սակայն իսպանացի կոնկիստադորները այդպես էլ չհասան Մաչու Պիկչու։ Քաղաքը չի ավերվել։ Անհայտ են այս քաղաքի կառուցման նպատակը, բնակչության թիվը, և նույնիսկ իրական անվանումը։ 1532 թվականին քաղաքի բոլոր բնակիչները խորհրդավոր կերպով անհետացան։ Մաչու Պիկչուի նմանությամբ բարձրալեռնային Չոկեկիրաո քաղաքը գոյատևել է ավելի երկար՝ մինչև 1570-ական թվականները։",
      img: "https://cdn.kastatic.org/ka-perseus-images/c37837b2922414a249dfa5c1c81e697aaa8ef9ec.jpg",

    },
    {
      name: "Պետրա	",
      dascription: "Պետրա (արաբ․՝ البتراء, հին քաղաք, Եդոմի մայրաքաղաքը, ավելի ուշ՝ Նաբաթեայի մայրաքաղաքը[1]։ Գտնվում է ժամանակակից Հորդանանի տարածքում՝ ծովի մակարդակից 900 մ և շրջակայքից 660 մ բարձրության վրա՝ Սիկ անունով նեղ կանիոնում։Դեպի հարթավայր ելքն անցնում է հյուսիսում և հարավում ընկած նեղ կիրճերով, մինչդեռ արևելքում և արևմուտքում ժայռերը միանգամից կտրատվում են՝ առաջացնելով 60 մ բարձրությամբ բնական պատեր։ Պետրայից ոչ հեռու գտնվում են Ադ-դեյր տաճարը և Ահարոնի դամբարանը։2005 թվականին Պետրան ընդգրկվել է ՅՈՒՆԵՍԿՕ-ի Համաշխարհային ժառանգության ցանկում[2]։ՊատմությունՊետրան ընկած է առևտրական երկու կարևոր ճանապարհների խաչմերուկում, որոնցից մեկը միացնում էր Կարմիր ծովը Դամասկոսին, մյուսը Միջերկրական ծովի մոտ Պարսից ծոցը կապում է Ղազային։ Պարսից ծոցից ուղևորվող քարավանները՝ բարձված թանկարժեք համեմունքներով, ստիպված էին շաբաթներ շարունակ հերոսաբար դիմակայել Արաբական անապատի դաժան պայմաններին, մինչ կհասնեին բավական նեղ Սիկ կանիոնի զովությանը. այնտեղից մոտ էր երկար սպասված Պետրան։ Այնտեղ ճանապարհորդները գտնում էին կերակուր, ծածկ և սառը, կենարար ջուր։Հարյուրավոր տարիներ առևտուրը Պետրային մեծ հարստություն է բերել։ Սակայն երբ հռոմեացիները բացահայտեցին արևելք տանող ծովային ճանապարհը, համեմունքների առևտրի ցամաքային առևտուրը անկում ապրեց, և Պետրան աստիճանաբար դատարկվեց՝ կորչելով ավազների մեջ։ Քաղաքի արաբերեն անվանումն է Ալ-Բատրա,իսկ հունարեն՝ Պետրա, որը նշանակում է《քար》:Պետրայի շատ շինություններ կառուցվել են տարբեր դարաշրջաններում և տարբեր տիրակալների օրոք, այդ թվում՝ իդումեացիների (XVIII-II դարեր մ.թ.ա.), նաբաթեացիների (II դար մ.թ.ա. - 106 թվական մ.թ.), հռոմեացիների (106-395 թվականներ մ.թ.), բյուզանդացիների և արաբների։ 12-րդ դարում այն տիրել են խաչակիրները։Ժամանակակից եվրոպացիներից առաջինը Պետրան տեսել և նկարագրել է շվեյցարացի ճանապարհորդ Յոհան Լյուդվիգ Բուրկհարդը։",
      img: "https://www.rjtravelagency.com/wp-content/uploads/2023/04/Petra-Jordan-2.jpg",

    },
    {
      name: "Թաջ Մահալ",
      dascription: "Թաջ Մահալ (հնդկերեն՝ ताज महल; պարսկերեն՝ تاج محل, /ˌtɑːdʒ məˈhɑːl, ˌtɑːʒ-/[6], թարգմանաբար՝ «Պալատի թագ»[7]), փղոսկրասպիտակ դամբարան Հնդկաստանի Ագրա քաղաքում՝ Ջամնա գետի հարավային ափին։ Հիմնադրվել է 1632 թվականին Շահ Ջահան մողոլ կայսեր (կառավարել է 1628-1658 թվականներին) կողմից իր սիրելի կնոջ՝ Մումթազ Մահալի համար, որը մահացել էր 14-րդ երեխային լույս աշխարհ բերելիս (հետագայում այստեղ է թաղվել նաև ինքը՝ Շահ Ջահանը)։ Դամբարանը, որը ունի 74 մետր բարձրություն և հինգ գմբեթներ, իսկ չորս անկյունների մոտ տեղակայված են չորս մինարեներ (դրանք փոքր-ինչ թեքված են, որ կործանվելու դեպքում չվնասեն դամբարանը), գտնվում է 17 հա տարածք[8] զբաղեցնող համալիրի կենտրոնում, որ ներառում է նաև մզկիթ և հյուրատուն և տեղակայված է երեք կողմից ատամնավոր պարսպով շրջապատված այգում։Դամբարանի կառուցումը հիմնականում ավարտվել է 1943 թվականին, սակայն առանձին աշխատանքներ շարունակվել են ևս տասը տարի, և համարվում է, որ Թաջ Մահալի կառուցումն ավարտվել է 1953 թվականին։ Համալիրի կառուցման համար ծախսվել է այն ժամանակվա գումարով շուրջ 32 մլն ռուփի, ինչը 2015 թվականին կլիներ մոտ 52,8 մլրդ ռուփի (827 մլն դոլար)։ Շինարարական աշխատանքներին մասնակցել են շուրջ 20 հազար արհեստավորներ ու վարպետներ[9] ճարտարապետների խորհրդի գլխավորությամբ, որի կազմում ընդգրկված են եղել Դեշենով Անուն, Մակրամատ Հանան և Ուստադ Ահմադ Լահաուրին։ Վերջինս եղել է պալատական ճարտարապետ և նախագծի հիմնական հեղինակը[10]։Թաջ Մահալը (որին կարճ անվանում են նաև պարզապես «Թաջ») համարվում է մոնղոլական ճարտարապետության եզակի ու փայլուն նմուշը, որն իր մեջ միաձուլում է պարսկական, հնդկական և իսլամական ճարտարապետության տարրեր[11][12]։ 1983 թվականին ՅՈՒՆԵՍԿՕ-ն Թաջ Մահալը ճանաչել է համաշխարհային ժառանգության օբյեկտ՝ այն կոչելով ««մուսուլմանական արվեստի մարգարիտ Հնդկաստանում, ժառանգության համընդհանուր ճանաչում ունեցող գլուխգործոցներից մեկը, որով հիանում են ամբողջ աշխարհում»։ Ամեն տարի Թաջ Մահալ է այցելում շուրջ 7-8 մլն մարդ։ ",
      img: "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Taj_Mahal%2C_Agra%2C_India_edit3.jpg/450px-Taj_Mahal%2C_Agra%2C_India_edit3.jpg"
    },

    {
      name: "Հիսուս Քրիստոսի արձան",
      dascription: "Արձանի կառուցումը-1921 թ., Բրազիլիայի անկախության (1822 թ.) սպասվելիք հարյուրամյակի առիթով, քաղաքի ղեկավարները որոշում կայացրին կառուցել Հիսուս Քրիստոսի արձանը։ Ռիո դե Ժանեյրոն այդ ժամանակ Բրազիլիայի մայրաքաղաքն էր (մայրաքաղաք է եղել 1763-1960 թթ.): «Կրուզեյրու» ամսագիրը հայտարարեց հուշարձանի կառուցման դրամահավաք։ Հավաքվեց ավելի քան երկուսուկես միլիոն բրազիլական ռեալ։ Դրամահավաքին միացավ նաև եկեղեցին։ Այդ ժամանակ Ռիո դե Ժանեյրոյի արքեպիսկոպոսն էր դոն Սեբաստիան Լեմեն, ով մեծ մասնակցություն ունեցավ հուշարձանի ստեղծման գործին։Հուշարձանի ստեղծումը տևեց մոտ ինը տարի՝ 1922 թվականից մինչև 1931 թվականը։Արձանի նախնական էսքիզը մշակեց նկարիչ Կառլոս Օսվալդը։ Նրա առաջարկով Հիսուս Քրիստոսը պատկերվեց խաչի նման պարզած ձեռքերով։ Նախնական գծագրում արձանի պատվանդանը գնդաձև էր՝ խորհրդանշելով երկրագունդը։ Հուշարձանի վերջնական տեսքը մշակեց բրազիլացի ճարտարագետ և ճարտարապետ Հեյտոր դա Սիլվա Կոշտան։Աշխատանքներն ընթացան Ֆրանսիայում, քանի որ Բրազիլիայում այդ ժամանակ տեխնիկապես հնարավոր չէր ստեղծել նման մեծ հուշարձան։ Բոլոր դետալները, ներառյալ նաև հիմնակմախքը, պատրաստվեցին Ֆրանսիայում։ Արձանը կառուցվեց մետաղաբետոնից և բյուրեղային հատուկ բաղադրություն ունեցող հանքաքարից։1924 թվականին ֆրանսիացի քանդակագործ Պոլ Լանդովսկին ավարտեց գլխի (3,75 մ բարձրությամբ) և ձեռքերի մոդելավորումը, իսկ 1925 թվականից մինչև 1931 թվականը ռումին քանդակագործ Գեորգե Լեոնիդան աշխատեց գլխի ստեղծման վրա։ Հուշարձանի բոլոր պատրաստի հատվածներն առանձին-առանձին տեղափոխվեցին Բրազիլիա և երկաթուղով բարձրացվեցին Կորկովադու լեռան գագաթը (ծովի մակերևույթից բարձրությունը՝ 710 մ)։1931 թվականի հոկտեմբերի 12-ին կայացավ արձանի հանդիսավոր բացումն ու օծումը։ Հիսուս Քրիստոսի արձանը դարձավ Բրազիլիայի խորհրդանիշը։1965 թվականին արձանը վերստին օծվեց Հռոմի Պողոս VI պապի կողմից։",
      img: "https://politik.am/imgs/posts/2022/01/c1879f0.jpeg",

    },

    {
      name: "Չիչեն Իցա",
      dascription: "Չիչեն Իցա, մինչկոլումբյան մայաների հսկայական քաղաք, որը կառուցվել է մայաների կողմից վերջին դասական ժամանակաշրջանի ընթացքում։ Հնագիտական տարածքը գտնվում է Մեքսիկայի Յուկատան նահանգի Տինում ինքնավար շրջանում [1]։Չիչեն Իցան խոշոր համակարգող կենտրոն է եղել հարավային մայաների հարթավայրերում։Չիչեն Իցան գլխավոր վարչական կենտրոնն է եղել հյուսիսային մայաների հարթավայրերում ուշ դասական շրջանից (Մ.թ. 800-900), ներառելով վերջին դասական շրջանը, մինչև հետդասական վաղ շրջան (Մ.թ. 900-1200)։Այն արտացոլում է մայաների ճարտարապետության տարբեր ոճեր, որի տարրերը դեռևս պահպանվում են կենտրոնական Մեքսիկայի, Պուուկի և այլ տարածքների տարբեր ոճերում։Չիչեն Իցան եղել է մայաների ամենամեծ քաղաքներից, նաև հավանաբար առասպելական մեծագույն քաղաքներից (տոլլաներ) մեկը, որը հիշատակվում է ավելի ուշ շրջանի մեզոամերիկյան գրականության մեջ[2]։Ենթադրվում է, որ քաղաքը ամենաբազմազան բնակչությունն է ունեցել մայաների աշխարհում, որն էլ հանդիսացել է տարածքի ճարտարապետական բազմազանության մեծագույն գործոններից մեկը[3]։Չիչեն Իցայի ավերակները դաշնային սեփականություն է համարվում, իսկ տարածքի պահպանությունն իրականացվում է Մեքսիկայի հնագիտության և պատմության ինստիտուտի կողմից։ Հուշարձաններով հողատարածքը մասնավոր կերպով սեփականացված է եղել մինչև 2010 թվականի մարտի 29-ը։ Այն գնվել է Յուկատան նահանգի կողմից[nb 1]Չիչեն Իցան Մեքսիկայի ամենաշատ այցելու ունեցող հնավայրերից է՝ տարեկան 1.4 միլիոն զբոսաշրջիկ։",
      img: "https://img1.advisor.travel/1314x680px-El_Castillo_Chichen_Itza_34.jpg",

    },]




  return (
    <div>
      {vernagir.map(
        (a) => <div
          style={{
            border: "1px solid black", width: "1494px", height: "45px", padding: "20px", backgroundColor: "rgb(244, 228, 240)",
            textAlign: "center", fontSize: "25px"
          }}>
          {a.name1}
        </div>
      )}
      <div style={{ display: "flex" }}>
        <div>

          {hrashaliq.map(
            (x, i) => <div
              key={i}
              onClick={() => setHrashaliqner(i)}
              style={{ border: "1px solid black", width: "190px", height: "45px", padding: "20px", backgroundColor: i === hrashaliqner ? "rgb(233, 219, 248)" : "rgb(249, 238, 252)", cursor: "poynter", cursor: 'pointer' }}>
              {x.name} </div>)}</div>
        <div style={{ display: "flex" }}>
          <div>
            {erkrner.map(
              (d,) => <div

                style={{ border: "1px solid black", width: "90px", height: "45px", padding: "20px", }}>{d.erkir}</div>)}

          </div>
          <div style={{ border: "1px solid black", width: "691px", height: "561px", padding: "22px", }}>
            {hrashaliq[hrashaliqner].dascription}</div>




          <div >

            <img src={hrashaliq[hrashaliqner].img} style={{ width: "436px", height: "300px" }} /></div></div>



      </div>
    </div>



  )
}




export default App
