import { useState } from "react"


function App() {
  const [regionN, setRegionN] = useState(0)

  const regions = [
    {
      name: "Արագածոտն ",
      description: [
        {
          title: "Արագածոտնի մարզ",
          paragraph: "Մարզի կարգավիճակ ունեցող վարչատարածքային միավոր Հայաստանում։ Մարզկենտրոնը Աշտարակ քաղաքն է։Տարածքը՝ 2753 կմ2, բնակչությունը՝ 141 հազար մարդ։Հայաստանի մարզերի շարքում տարածքի մեծությամբ միջին տեղ է գրավում,բնակչության թվով գերազանցում է միայն Վայոց ձորի և Տավուշի մարզերին։"
        },
        {
          title: "Աշխարհագրական դիրք",
          paragraph: "Մարզի աշխարհագրական դիրքի կարևոր առանձնահատկությունն այն է, որ գտնվում է մայրաքաղաք Երևանի և Հայաստանի ամենաբարձր լեռնագագաթի՝ Արագածի միջև։ Կիսաօղակաձև գոտևորելով Արագած լեռնազանգվածը՝ մարզի տարածքը արևմուտքում ձգվում է մինչև Թուրքիայի հետ պետական սահմանը։ Հայաստանի Արագածոտնի մարզի տարածքով են անցնում հանրապետական նշանակություն ունեցող 3 ավտոխճուղիները՝ Երևան – Աշտարակ—Թալին—Գյումրի, Երևան—Աշտարակ—Սպիտակ և Երևան—Արմավիր—Քարակերտ—Գյումրի։ Մարզի տարածքը հատում է նաև Հայաստանի գլխավոր երկաթուղին (միայն արևմտյան հատվածով և մարզի տնտեսական զարգացման վրա էական ազդեցություն չի թողնում)։"
        },
        {
          title: "Բնական պայմաններ և հարստություններ",
          paragraph: "Արագածոտնի մարզն զբաղեցնում է Արարատյան ֆիզիկա-աշխարհագրական շրջանի հյուսիսարևմտյան մասը (950 մետրից մինչև 4090 մ բացարձակ բարձրությունները)։ Հարավում լեռնալանջերը ձուլում են Արարատյան դաշտին, հյուսիսում ձգվում են մինչև Արագածի լեռնագագաթը։ Արագածոտնը Հայաստանի այն մարզերից է, որտեղ հանդիպում են հայտնի բոլոր վերընթաց լանդշտաֆտային գոտիները։  Մարզի մակերևույթի մեծ մասը կազմված է տարբեր տիպի ու բնույթի երիտասարդ հրաբխային լավաներից։ Այստեղ են գտնվում Թալինի, Կարմրաշենի, Ապարանի սարավանդները, որոնց մակերևույթին բնորոշ են խարամային կոները, տուֆային դաշտերը, քարակարկառները։ Այստեղ է գտնվում Փոքր Սիփան լեռը (հայտնի է նաև որպես Սիփան)։  Բազմաթիվ են լավային ծածկույթների տակից բխող սառնորակ աղբյուրները, որոնցից սնվում են գետակները։ Մարզի հիմնական զարկերակը Քասաղ գետն է՝ Գեղարոտ և Ամբերդ գլխավոր վտակներով։ Քասաղի վրա կառուցվել է Ապարանի ջրամբարը։Հայտնի է Մաստարայի սելավային գետակը, որը հաճախ վարարելով մեծ վնաս է հասցնում ցանքատարածություններին։Արագածի մերձգագաթային սարավանդի վրա գտնվում է Քարի լիճը։ Մակերևույթի բարձրությունների մեծ տատանումների շնորհիվ կլիման նույնպես բազմազան է։ Մեծ են ցածրադիր և բարձրադիր մասերի կլիմայական պայմանների տարբերությունները։ Եթե տարվա ամենատաք ամսվա՝ հուլիսի միջին ջերմաստիճանը լեռան ստորոտում լինում է 24-ից ոչ պակաս, ապա բարձրլեռնային գոտում չի բարձրանում 6-ից։ Արագածի մերձգագաթային հատվածում նույնիսկ ամռանը կարելի է հանդիպել ձնաբծերի։ Նույն օրինաչափությամբ էլ լանջերն ի վեր փոխվում է մթնոլորտային տեղումների քանակը՝ 400 մմ-ից մինչև 1000 մմ։Մարզի տարածքը մեծ մասը զբաղեցնում են լեռնային սևահողերը՝ ծածկված տափաստանային բուսականությամբ։Բարձր լեռնային մասերում, լեռնամարգագետնային հողերի վրա տարածվում են մերձալպյան և ալպյան մարգագետիններ, որոնք հաճախ ընդմիջվում են քարակարկառներով ու լերկ ժայռերով։Որոշ վայրերում հանդիպում են կաղնու ոչ ընդարձակ անտառակներ։ Օգտակար հանածոները բազմազան չեն, բայց պաշարները մեծ են։ Դրանք հիմնականում հրաբխային ապարատեսակներին են՝ բազմագույն տուֆերը, բազալտը, պեռիլտը, հրաբխային խարամը, որոնք իրենց գոյությամբ պարտական են Արագած լեռան հրաբխային ժայթքումներին և ծառայում են որպես որակյալ շինանյութ։ Մարզը հարուստ է նաև բարձրորակ խմելու ջրի պաշարներով։ Մարզում շատ են ոչ միայն բնական, այլև պատմական ու ճարտարապետական հուշարձանները։ Մարզկենտրոնի հարևանությամբ գտնվող Օշական գյուղում է գտնվում հայ գրերի ստեղծող սուրբ Մեսրոպ Մաշտոցի շիրիմ-դամբարանը։ Մարզի տարածքով մեկ ցրված են միջնադարյան բազմաթիվ կառույցներ՝ կանգուն կամ ավերակ վիճակում։ Հայտնի են հատկապես Ամբերդը, Թալինի, Սաղմոսավանի, Աշտարակի եկեղիցիներն ու վանքերը։Արագածոտնի մարզում է գտնվում Բյուրականի նշանավոր աստղադիտարանը, որը հիմնադրվել և տասնամյակներ անընդմեջ ղեկավարել է աշխարհռչակ գիտնական Վիկտոր Համբարձումյանը։"
        },
        {
          title: "Տնտեսություն",
          paragraph: "Մարզի տնտեսության հիմքն արդյունաբերությունը և գուղատնտեսությունն են։ Արդյունաբերությունը մասնագիտացած է սննդամթերքի և ըմպելիքի, թանկարժեք իրերի արտադրության ու շինանյութերի հանքավայրերի շահագործման ուղղություններում։Մարզի աշխարհագրական դիրքը և բնակլիմայական պայմանները նպաստավոր են ինչպես բուսաբուծության (հացահատիկ, կարտոֆիլ, բազմամյա տնկարկներ, կերային մշակաբույսեր), այնպես էլ անասնաբուծության զարգացման համար։ Գյուղատնտեսությունը հիմնականում մասնագիտացած է բուսաբուծության (մասնավորապես, հացահատիկային մշակաբույսերի արտադրության) և անասնաբուծության մեջ։ Բեռնաուղևորափոխադրումները մարզում իրականացվում են ավտոմոբիլային տրանսպորտով։"
        }
      ],

      img: [
        {
          src: "https://upload.wikimedia.org/wikipedia/commons/3/30/Amberd_fortress%2C_Aragatsotn_Province%2C_Armenia._DSCF2563-2.jpg",
          imgDescripion: "Ամբերդ"
        },

        {
          src: "https://d31qtdfy11mjj9.cloudfront.net/places/1511523264764378978.jpg",
          imgDescripion: "Սաղմոսավանք"
        },

        {
          src: "https://www.advantour.com/img/armenia/aragatsotn/mount-aragats.jpg",
          imgDescripion: "Արագած լեռ"
        },

        {
          src: "https://img.freepik.com/fotos-premium/hovhannavank-ubicado-pueblo-ohanavan-provincia-aragatsotn-armenia_220166-4555.jpg?w=2000",
          imgDescripion: "Հովհաննավանք"
        },

        {
          src: "https://cdn.araratour.com/file_manager/files/The%20towns%20of%20Armenia/big_1444379492_3779893.jpg",
          imgDescripion: "Աշտարակ"
        },

        {
          src: "https://c1.mediamax.am/datas/znews/big_1445588622_6470179.jpg",
          imgDescripion: "Ապարան"
        },

        {
          src: "https://upload.wikimedia.org/wikipedia/commons/6/6c/Talin_town.jpg",
          imgDescripion: "Թալին"
        }]
    },

    {
      name: "Արարատ",
      description: [
        {
          title: "Արարատի մարզ  ",
          paragraph: "Արարատի մարզ, մարզի կարգավիճակ ունեցող վարչատարածքային միավոր Հայաստանում։ Մարզկենտրոնն Արտաշատ քաղաքն է։ Տարածքը 2096 կմ² է։ Արարատի մարզը գտնվում է Հայաստանի հարավ-արևմուտքում։ Հյուսիս-արևմուտքից սահմանակից է Արմավիրի մարզին, հյուսիսից՝ Երևանին ու Կոտայքի մարզին, արևելքից Գեղարքունիքի և Վայոց ձորի մարզերին, հարավից՝ Ադրբեջանի մասը կազմող Նախիջևանին, իսկ հարավ-արևմուտքից Թուրքիային։"
        },
        {
          title: "Բնական պայմաններ",
          paragraph: "Արարատի մարզի հարավարևմտյան եզրին զուգահեռ 6-13 կմ լայնությամբ ընկած է Արարատյան հարթավայրի հարավարևելյան մասը։ Հյուսիսում Երանոսի լեռնաշղթան է։ Հյուսիսային սահմանն անցնում է Ազատ և դրա վտակ Գողթ գետերով։ Հյուսիս-արևելքում Գեղամա լեռնաշղթայի հարավարևմտյան հատվածն է։ Արևելքում Մժկատարի լեռներն են, որից արևմուտք ընկած է Դահնակի լեռնաշղթան, սրանից էլ հարավ գտնվում է Ուրծի լեռնաշղթան։ Մարզի կենտրոնում Երասխի լեռներն են, Կոտուց, Խոսրովասար լեռնագագաթները և այլ լեռնազանգվածներ։ Տարածքի ամենացածր կետը հարավում է՝ Արաքսի հունի մոտ՝ 801 մ։ Ամենաբարձր կետը հյուսիս-արևելքում գտնվող Սպիտակասար լեռնագագաթն է՝ 3555,7 մ։Տարածքի միայն մոտ 30%-ն է հարթավայրային։ Մարզի խոշոր գետերն են Արաքսը, Հրազդանը, Ազատը, Վեդին։ Համեմատաբար փոքր գետերից են Արածոն, Չորասու հեղեղատարը, Ազատի ու Վեդիի վտակները՝ Քաջառուն (Դարբանդ), Խոսրովը, և այլն։ Արարատյան հարթավայրով անցնող գետերը ունեն ոռոգիչ նշանակություն։ Ազատի վրա Լանջազատ գյուղի մոտ կառուցված է Զովաշենի ջրամբարը և համանուն ՀԷԿ-ը։ Արարատի մարզում տարածված են Հայաստանում առկա բոլոր 8 լանդշաֆտային գոտիները։ Ցածրադիր շրջաններից մինչև բարձրադիր շրջաններ դրանք հաջորդում են իրար այս հերթականությամբ. անապատային, կիսաանապատային, չոր տափաստանային, տափաստանային, լեռնաանտառային, մերձալպյան, ալպյան, ձյունամերձ։ Բայց սրանցից հիմնականներն են կիսաանապատային (Արարատյան հարթավայրում), չոր տափաստանային (միջին բարձրության լեռներում), ալպյան (Գեղամա լեռնաշղթայի լանջերին)։Պայմանավորված Հայկական լեռնաշխարհի լեռնային մակերևույթով՝ այս ամբողջ տարածաշրջանում՝ այդ թվում Արարատի մարզում, կլիման ենթակա է վերընթաց գոտիականության։ Մասնավորապես այս մարզում առկա են Հայաստանում տարածված կլիմայի 8 տիպերից 6-ը, որոնք հարթավայրային շրջաններից մինչև լեռնային շրջաններ իրար հաջորդում են հետևյալ հաջորդականությամբ. Արարատի մարզում տարեկան միջին ջերմաստիճանը ցածրադիր և բարձր լեռնային շրջանների միջև տատանվում է +10 °C-ի և -2 °C-ի միջև։ Ձմռանն անհողմ եղանակի պայմաններում տեղի է ունենում ջերմաստիճանային շրջադասություն. սառն ու ծանր օդը կուտակվում է Արարատյան դաշտում։ Այդ պատճառով միջին գոտում՝ մինչև 2000 մետր բարձրությունները, ձմեռը լինում է ավելի տաք և արևոտ, քան Արարատյան գոգավորությունում։ Գարունն անցողիկ է և կարճատև։ Մայիսի երկրորդ տասնօրյակից օդի ջերմաստիճանն անցնում է 15 °C-ից, սկսվում է չոր, հաճախ խորշակներով երկարատև ամառը, որը շարունակվում է մինչև սեպտեմբերի երկրորդ կեսը։ Աշունը մեղմ է, անհողմ, հաճախ են թույլ անձրևները։ Մարզի հարթավայրային շրջանների համար բնորոշ են լեռնահովտային քամիները։ Ամռանը՝ կեսօրից հետո, քամին Գեղամա լեռներից փչում է հովիտներ՝ մեղմացնելով ամառվա տապը։ Հունվարյան միջին ջերմաստիճանն է այդ շրջաններում համապատասխանաբար -6 °C և -12 °C, հուլիսյան ջերմաստիճանը՝ +26 °C և +8 °C, միջին տարեկան տեղումները՝ 200 մմ և 1000 մմ։ Ցածրադիր շրջաններում դիտված բացարձակ առավելագույն և նվազագույն ջերմաստիճաններն են -33 °C և +42 °C, ընդ որում վերջինս Հայկական լեռնաշխարհում դիտարկված բացարձակ առավելագույն ջերմաստիճանն է և այն գրանցվել է Արարատյան հարթավայրի հարավ-արևելքում։ Ընդհանուր առմամբ Արարատի մարզն աչքի է ընկնում կլիմայի չորությամբ[2]։"
        },
        {
          title: "Տնտեսություն",
          paragraph: "Արարատի մարզը տնտեսապես Հայաստանի ամենազարգացած մարզերից է, հատկապես կարևոր է մարզի գյուղատնտեսական նշանակությունը։ Ունենալով Արարատյան դաշտի մի մեծ հատված՝ մարզը տալիս է Հայաստանի գյուղատնտեսական արտադրանքի զգալի մասը։ Առավել զարգացած է երկրագործությունը։ Հիմնական պտղատու այգիներն են խաղողի, ծիրանի, դեղձի այգիները, մշակվում են նաև կեռաս, սալոր, խնձոր, տանձ և այլն։ Մարզի հիմնական մշակաբույսերն են ձմերուկ, սեխ, լոլիկ, վարունգ, լոբի, սիսեռ, կանաչ պղպեղ, սմբուկ, ցորեն։ Երկրագործությունը 90 տոկոսով ոռոգովի է։ Այդ նպատակով օգտագործվում է ինչպես գետերի ջրերը՝ իրենց ջրանցքներով, այնպես էլ արտեզյան հորերի ջրերը։ Լեռնային հատվածներում զարգացած է նաև անասնապահությունը՝ հիմնականում ոչխարաբուծություն, ավելի քիչ՝ խոշոր եղջերավոր անասնապահություն։ Արարատի մարզի արդյունաբերությունում, կարևոր տեղ ունի լեռնահանքային արդյունաբերությունը։ Արարատ քաղաքի մոտ արդյունահանվում է տրավերտին, կրաքար, ավազ, մարզի այլ հատվածներում նույնպես կան տրավերտինի, ավազի, մարմարի, բազալտի հանքեր։ Կան հանքային ջրեր՝ Արարատ և Վեդի։ Մետաղական հանածոների արդյունաբերական պաշարներ չկան։ Շատ մեծ է սննդի արդյունաբերության նշանակությունը։ Գոյություն ունեն մի շարք գործարաններ, որոնք զբաղվում են մարզում արտադրված գյուղմթերքի վերամշակմամբ՝ մուրաբաների, բնական հյութերի, պահածոների, տոմատի մածուկների արտադրությամբ։ Մարզը նաև ալկոհոլային խմիչքների արտադրության առանցքային կենտրոններից է։ Հիմնական արտադրատեսակներն են կոնյակ, գինի, օղի։ Զբոսաշրջային խոշոր կենտրոն է Խոր Վիրապի վանական համալիրը։"
        },
        {
          title: "Խոսրովի անտառ պետական արգելոց",
          paragraph: "Խոսրովի անտառ պետական արգելոց (նաև Խոսրովի անտառ), պետության կողմից պահպանվող տարածքի կարգավիճակ ունեցող տարածք Հայաստանի Արարատի մարզում[2]։ Պահպանվող տարածքը ստեղծվել է 330-338 թվականներին Խոսրով Գ.Կոտակ թագավորի կողմից ստեղծված անտառի տարածքի մի մասի վրա։ Այն ունի շուրջ 1700 տարվա պատմություն։ Արգելոցի ներկայիս տարածքը պատմական անցյալում գտնվել է Մեծ Հայքի Այրարատ նահանգում։ «Խոսրովի անտառ» պետական արգելոցը ստեղծվել է 1958 թվականին Խորհրդային Հայաստանի կենտրոնական մասի չոր նոսրանտառային, ֆրիգանային և կիսաանապատային լանդշաֆտների, բուսական և կենդանական եզակի համարվող համակեցությունների պահպանության նպատակով։ Արգելոցը տեղակայված է Հայաստանի Արարատի մարզի հյուսիսարևելյան մասում, Գեղամա լեռնավահանի և Մերձարաքսյան ծալքաբեկորավոր լեռնաշղթաների միջև։ Արգելոցն ունի հարավարևելյան ձգվածություն, զբաղեցնում է 23,213․5 հա տարածք և կազմված է Գառնի (4253 հա), Կաքավաբերդ (4745 հա), Խոսրով (6860,8 հա), Խաչաձոր (7354,7 հա) տեղամասերից[3]։ Խոսրովի անտառ պետական արգելոցը գտնվում է «Խոսրովի անտառ» պետական արգելոց» ՊՈԱԿ-ի ենթակայության տակ։ 2013 թվականի օգոստոսի 26-ին «Խոսրովի անտառ» պետական արգելոց» ՊՈԱԿ շնորհվել է Պահպանվող տարածքների Եվրոպական դիպլոմ[4]։"
        }
      ],

      img: [
        {
          src: "https://armenia-tour.am/wp-content/uploads/st_uploadfont/xorvirap1.jpg",
          imgDescripion: "Խոր Վիրապ"
        },
        {
          src: "https://live.staticflickr.com/65535/49012324328_e5618d7f74_b.jpg",
          imgDescripion: "Արարատ"
        },
        {
          src: "https://anrinersesyan.files.wordpress.com/2016/04/xosrov.jpg?w=640",
          imgDescripion: "Խոսրովի անտառ"
        },
        {
          src: "https://janarmenia.com/uploads/0000/1/2020/07/22/4-9.jpg"
        },
        {
          src: "https://econews.am/disk/14-04-16/0a8bc6351b910e9027511f310da73272.jpg"
        },
        {
          src: "https://www.president.am/files/pics/2015/05/31/11926_b.jpg",
          imgDescripion: "Արտաշատ"
        },
        {
          src: "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Barkly_St_to_the_Grampians%2C_Ararat%2C_Vic%2C_jjron%2C_12.01.2011.jpg/320px-Barkly_St_to_the_Grampians%2C_Ararat%2C_Vic%2C_jjron%2C_12.01.2011.jpg",
          imgDescripion: "Արարատ"
        },
        {
          src: "https://www.1tv.am/images/video/8/36427/v.jpeg",
          imgDescripion: "Մասիս"
        },
        {
          src: "https://c1.mediamax.am/datas/znews/big_1444976653_6535209.jpg",
          imgDescripion: "Վեդի"

        }
      ],

    },

    {
      name: "Արմավիր",
      description: [{
        title: "Արմավիրի մարզ",
        paragraph: "Արմավիրի մարզ, վարչատարածքային միավոր Հայաստանում։ Արմավիրի մարզկենտրոնն Արմավիր քաղաքն է։ Տարածքը 1242 կմ² է, բնակչությունը 284 հազար մարդ։ Գտնվում է 800-1000 մ բարձրություններում։ Մարգարա գյուղի մոտ Արաքս գետի վրա կառուցված ավտոճանապարհային կամուրջը Հայաստանը միացնում է Թուրքիային։ Մարզի տարածքը եղել է պատմական Հայաստանի Այրարատ նահանգի մի մասը։"
      },
      {
        title: "Կլիմա",
        paragraph: " Կլիման խիստ ցամաքային է։ Մթնոլորտային տեղումների քանակը չի գերազանցում 300 մմ։ Ամառը շոգ է, տևական (4-5 ամիս)։ Հաճախ ջերմաստիճանը բարձրանում է մինչև 40-42 °C։ Բնորոշ են լեռնահովտային քամիները։ Ձմեռը ցուրտ է, անամպ, անհողմ։ Գարունը կարճատև է։ Առանձնապես հաճելի է արևոտ, անհողմ, տևական աշունը, երբ հասունանում են այգիների ու դաշտերի բարիքները։ Հարթավայրային մասի բնական կիսաանապատային լանդշաֆտները խիստ փոփոխված են։ Ներկայումս տիրապետում են մարդածին լանդշաֆտները։ Բնական ծածկույթը, որը հումուսով աղքատ գորշահողեր են, հազարամյակների ընթացքում ոռոգովի երկրագործրության պայմաններում վերածվել է կուլտուր-ոռոգելի հողերի։ Հարթության ցածրադիր մասերում գոյացել են ճահճուտներ։"
      },
      {
        title: "Հուշարձաններ",
        paragraph: "Մարզը հարուստ չէ օգտակար հանածոներով։ Բազմաթիվ են պատմական և ճարտարապետական հուշարձանները։ Հայտնաբերվել են Մեծամորի բրոնզեդարյան մետաղաձուլարանը, Վանի թագավորության քաղաք Արգիշտիխինիլիի ավերակները։ Պատմաճարտարապետական մեծագույն արժեք են ներկայացնում Էջմիածնի վանական կառույցները, Զվարթնոց տաճարի ավերակները, Վաղարշապատում Սուրբ Հռիփսիմե, Սուրբ Գայանե, Շողակաթ եկեղեցիները, ինչպես նաև Սարդարապատի հուշահամալիրը։"
      },
      {
        title: "Բնակչություն",
        paragraph: "Արմավիրի մարզը բնակչության թվով և խտությամբ Հայաստանում գրավում է առաջին տեղը։ Մարզին բնորոշ է այն, որ չնայած ռելիեֆային պայմանների միատարրությանը՝ բնակչության տեղաբաշխումը հավասարաչափ չէ։ Նրա ամենամեծ կուտակումը մարզի արևելյան հատվածում է։ Դեպի արևմուտք շարժվելիս այն կտրուկ նվազում է։ Արմավիրի մարզի խոշոր գյուղերն են՝ Նալբանդյան, Արշալույս, Փարաքար, Սարդարապատ։ Արմավիրի մարզն ունի երեք քաղաք՝ Արմավիրը (29,319 բնակիչ), Վաղարշապատը (46,540 բնակիչ) և Մեծամորը (9,191 բնակիչ)։"
      }
      ],

      img: [
        {
          src: "https://mediahub.am/uploads/images/2022/08/image_750x_630a2062663f5.jpg",
          imgDescripion: "Զվարթնոցի տաճար"
        },
        {
          src: "https://fairytour.am/upload/nyuter/5cb8b7.jpg",
          imgDescripion: "Սուրբ Հռիփսիմե"
        },
        {
          src: "https://upload.wikimedia.org/wikipedia/commons/b/b3/Gayane3.jpg",
          imgDescripion: "Սուրբ Գայանե"
        },
        {
          src: "https://live.staticflickr.com/65535/49834169256_a3a062c605_b.jpg",
          imgDescripion: "Շողակաթ եկեղեցի"
        }
      ]
    },

    {
      name: "Գեղարքունիք",
      description: "Տարածքի մեծությամբ այն առաջինն է Հայաստանում։ Մարզն այնքան մեծ է, որ նրանում հանգիստ կտեղավորվեն Արարատի, Արմավիրի և Կոտայքի մարզերն ամբողջությամբ։ Ամբողջ տարածքի շուրջ 1/4-ը զբաղեցնում է Սևանա լիճը։ Հյուսիսից սահմանակից է Տավուշի մարզին, արևելքից՝ Ադրբեջանին և Արցախին, արևմուտքից՝ Կոտայքի և Արարատի մարզերին, իսկ հարավից՝ Վայոց ձորի մարզին։ Տրանսպորտաաշխարհագրական դիրքը, ի տարբերություն Հայաստանի այլ մարզերի, անբարենպաստ է։ Գլխավոր ճանապարհներն են՝ Ճամբարակ-Բերդ, Մարտունի-Եղեգնաձոր և Երևան-Սևան-Սոթք երկաթուղին։Տարածքում շատ են հրաբխային կոները, որոնցից հայտնի են հատկապես Արմաղանն ու Աժդահակը, որոնց խառնարաններում գտնվում են համանուն լճերը։ Գլխավոր լեռնաշղթաներն են Գեղամա, Արեգունի, Սևանի, Արևելյան Սևանի, Վարդենիսի։ Սևանի ավազանն արգավանդ հողերով հարուստ է, հատկապես կարևոր է Մասրիկի դաշտը՝ 1900-2200 մ բարձրություններում։ Կլիման բարեխառն լեռնային է. ձմեռները ցուրտ են, առաջանում է կայուն ձնածածկույթ։ Հունվարյան միջին ջերմաստիճանը -5˚-10˚ է։ Ամառները տաք են, արևոտ։ Միջին ջերմաստիճանն հասնում է +18˚+20˚։ Տեղումները քիչ են՝ 400-450 մմ, իսկ բարձրադիր շրջաններում մինչև 1000 մմ։ Օգտակար հանածոներից մեծ արժեք են ներկայացնում ոսկու (Սոթք), քրոմիտի (Շորժա), բնական շինանյութերի, հանքային ջրերի (Լիճք) և այլ պաշարները։ Սևանա լիճը ամբողջությամբ գտնվում է Գեղարքունիքի մարզում։ Գեղարքունիքի մարզում է գտնվում Սոթքի ոսկու խոշոր հանքավայրերը։",
      img: ["https://www.wideworldtrips.com/wp-content/uploads/2020/05/things-to-do-in-gegharkunik.jpg", "https://www.iarmenia.org/wp-content/uploads/2018/06/1676044_603x354-e1528842580374.jpg"]
    },

    {
      name: "Շիրակ ",
      description: "Մարզի տարածքում են գտնվում Արփի լիճ-ջրամբարը, Ախուրյանի ջրամբարի հայկական հատվածը և Մանթաշի ջրամբարը։ Շիրակի մարզի կենտրոնական և հարավային հատվածում տարածվում է Շիրակի դաշտը, իսկ հյուսիսային շրջանում՝ Աշոցքի սարահարթը, միաժամանակ Շիրակի մարզում են տարածվում Փամբակի, Բազումի լեռնաշղթաների, Եղնախաղի, Ջավախքի, Արագածի լեռնազանգվածների մի մասը։ Երկրաբանական կառուցվածքի տեսակետից տարածքը ընդհանուր առմամբ ունի համեմատաբար միատարր հրաբխային կազմություն և երիտասարդ հասակ։ Հայկական լեռնաշխարհի հետ միասին մարզի տարածքն անցել է երկրաբանական զարգացման բարդ ուղի։ Եռանդուն տեկտոնական շարժումները, որոնց շնորհիվ երկրակեղևը ծալքավորվել ու կոտրվել է, տեղի է ունեցել երկրաբանական տարբեր ժամանակաշրջաններում։ Սակայն մարզի ռելիեֆի ձևավորման գործում գլխավոր դերը պատկանում է ալպյան լեռնակազմությանը, երբ տարածքը բարձրացել է ծովի հատակից և թևակոխել ցամաքային զարգացման փուլ։ Հետագայում, շարունակվելով վերընթաց տեկտոնական շարժումները, ձևավորվել են միջին բարձրության լեռներ։ Նեոգենի ժամանակաշրջանի կեսերին տեղի ունեցած հզոր լեռնակազմական պրոցեսների հետևանքով տարածքի շրջակա լեռները դարձել են ավելի բարձր, հովիտները` ավելի խորը։ Այդ ժամանակաշրջանում է, որ այստեղ գոյանում են երկրակեղևի տարբեր ուղղություններով ձգվող Սևան-Շիրակի, Ջավախք-Արագած-Մասիսի և Աշոցքի բեկվածքները[2]։ Եռանդուն տեկտոնական շարժումները ուղեկցվել են բուռն հրաբխականությամբ, որն ընդգրկել է մարզի ամբողջ տարածքը` սկսած Եղնախաղից, Աշոցքից մինչև Արագած։ Հրաբխային արտավիժման և ժայթքման նյութերը ծածկել են հսկայական տարածություններ` իրենց տակ թողնելով ծալքավոր և ծալքաբեկորավոր լեռների խղզման գծերի զգալի մասը` դրանց վրա գոյացնելով հրաբխային լեռնավահաններ, առանձին լեռնազանգվածներ, սարավանդներ։ Նման եղանակով են գոյացել Արագած լեռնազանգվածը, Ջավախքի, Աշոցքի, Եղնախաղի լեռնավահանները, Աշոցքի և Շիրակի սարահարթերը։ Մի քանի փուլով հանդես եկած սառցապատումների ներգործությամբ Արագածի, Ջավախքի, Եղնախաղի լեռների բարձր մասերում առաջացել են կրկեսանման գոգավորություններ, տաշտականման լայն հովիտներ։ Սառցադաշտերի հալոցքային ջրերը լեռների լանջերին և ստորոտներին գոյացրել են մորենային և սառցադաշտաջրաբերուկային կուտակումներ[2]։",
      img: ["https://app.conciergetravel.am/storage/5df4bA6F819XdX16TmcsqMReagKPF4aZJy2KZnJA.jpg", "https://app.conciergetravel.am/storage/7r31P6BO3k1Quiypmg2BfEXQLWs91dkCjAcdTYLU.jpg"]
    },

    {
      name: "Լոռի",
      description: `Լոռու մարզ, մարզի կարգավիճակ ունեցող վարչատարածքային միավոր Հայաստանի հյուսիսում։ Զբաղեցնում է պատմական Հայաստանի Գուգարաց նահանգի արևելյան հատվածն ու Այրարատ նահանգի Նիգ գավառի հյուսիսային տիրույթները։Լոռու մարզն ունի ցայտուն արտահայտված բնական սահմաններ։ Այն ընդգրկում է Դեբեդ գետի ավազանն ամբողջությամբ և հիմնականում ունի լեռնային ռելիեֆ՝ բարձրադիր լեռներ, անդնդախոր, երբեմն սուր կտրվածքով կիրճեր։ Նրա տարածքում են ձգվում Ջավախքի, Բազումի, Փամբակի, Գուգարաց, Վիրահայոց և Հալաբի լեռնաշղթաները։ Առանձնանում են Լոռու,Փամբակի գոգավորությունները և Լոռվա ձորը։ Բնակավայրերը գտնվում են ծովի մակերևույթից 520-ից մինչև 1800 մետր բարձրության վրա։Մարզի վարչական կենտրոն հանդիսացող Վանաձոր քաղաքը համարվում է Հայաստանի երրորդ խոշորագույն քաղաքը՝ շուրջ 80 հազար բնակչությամբ։ Մյուս խոշոր բնակավայրերն են Ալավերդին, Ստեփանավանը, Սպիտակը, Թումանյանը, Ախթալան և Տաշիրը։ Ըստ 2020 թվականի տարեսկզբի տվյալների՝ մարզի բնակչությունը կազմում է 213․3 հազար մարդ, որի ճնշող մեծամասնությունը հայերն են, սակայն համեմատականորեն քիչ չեն նաև ազգային փոքրամասնությունների (ռուսական, հունական, եզդիական, ուկրաինական և այլն) համայնքները։Լոռին Հայաստանի արդյունաբերական մարզերից է։ Այստեղ են գործում Հայաստանի տնտեսության արդյունաբերական ճյուղի անկյունաքարային նշանակություն ունեցող մի շարք օբյեկտներ։ Արդյունաբերության զարգացվածության ֆոնին ավելի քիչ զարգացած է գյուղատնտեսությունը։Լոռին աչքի է ընկնում նաև հարուստ մշակութային ժառանգությամբ և պատմական անցյալով, որի մասին վկայում են տասնյակ վանքերը, բերդերը, ամրոցներն ու հուշակոթողները։ Պատմամշակութային ինքնատիպ հուշարձանների բազմազանությունը որոշակիորեն պայմանավորված է այն հանգամանքով, որ 10-12-րդ դարերում այստեղ գոյություն է ունեցել անկախ հայկական պետականություն՝ ի դեմս Լոռու կամ Տաշիր-Ձորագետի թագավորության։ Հայաստանում ՅՈՒՆԵՍԿՕ-ի Համաշխարհային ժառանգության ցանկում ներառված օբյեկտներից երկուսը՝ Հաղպատի ու Սանահինի միջնադարյան վանական համալիրները գտնվում են Լոռու մարզում։`,
      img: ["https://media-cdn.tripadvisor.com/media/photo-s/1c/b0/95/93/lori-province-from-yaghdan.jpg", "https://onewaytour.com/wp-content/uploads/2019/05/dorb1.jpg"]
    },




    {
      name: "Տավուշ ",
      description: `Տավուշի մարզը գտնվում է Հայաստանի հյուսիսարևելյան հատվածում։ Ընդգրկում է Իջևանի, Տավուշի (նախկինում՝ Շամշադին), Նոյեմբերյանի, Դիլիջանի տարածաշրջանները և 5 քաղաքներ՝ Իջևան, Նոյեմբերյան, Բերդ, Դիլիջան և Այրու Մարզը սահմանակից է Վրաստանին, հյուսիսում և արևելքում՝ Ադրբեջանին։ Հայաստանի պետական սահմանից մարզին բաժին է ընկնում 400 կմ հատված, որից 352-ը՝ Ադրբեջանի հետ։ Մարզի կենտրոնով դեպի հյուսիս-արևելք հոսում է Աղստև գետը։ Ամենացածր կետը գտնվում է Դեբեդավան գյուղի մոտ (380 մ), ամենաբարձր կետը՝ Միափորի լեռնաշղթայի Մուրղուզ լեռն է (2993 մ)։ Հայաստանի Տավուշի մարզը տարածվում է Փոքր Կովկասի լեռնաշղթաների արտաքին շարի վրա (Վիրահայոց, Գուգարաց և Միափորի լեռներ)։ Գտնվում է Հայաստանի չափավոր խոնավ տարածաշրջանում։ [Գետ]]երը պատկանում են Կասպից ծովի (Կուր գետի) ավազանին և սնվում են հալոցքային, ստորերկրյա և անձրևային ջրերից։ Գտնվում է Երևանից 137 կմ հեռավորության վրա։`,
      img: ["https://tsayg.am/wp-content/uploads/2020/08/1_701311_02-1170x658.jpg", "https://destinationarmenia.am/storage/article/16177400542911272.jpg"],
    },

    {
      name: "Վայոց Ձոր",
      description: "Վայոց ձորի մարզ, մարզի կարգավիճակ ունեցող վարչատարածքային միավոր Հայաստանի հարավարևելյան վերջույթում։ Զբաղեցնում է պատմական Հայաստանի Սյունյաց նահանգի նույնանուն գավառի հիմնական տարածքը։ Ներկայիս վարչատարածքային միավորը ձևավորվել է Հայկական ԽՍՀ-ի մաս կազմած Եղեգնաձորի և Վայքի (Ազիզբեկովի) շրջանների միավորման հետևանքով՝ 1995 թվականի բարեփոխումների արդյունքում։Վայոց ձորի մարզը զբաղեցնում է 2,308 կմ² տարածք (7-րդը Հայաստանի մարզերի շարքում)։ Ընդգրկում է երեք հիմնական աշխարհագրական շրջաններ՝ Արփայի գոգավորություն, Վայքի ծալքաբեկորավոր լեռնաշղթա (ձգվում է հարավում) և Վարդենիսի հրաբխային լեռնավահան։ Հյուսիսում սահմանակցում է Գեղարքունիքի մարզին, հյուսիս-արևելքում՝ Արցախի Հանրապետությանը, հարավ-արևմուտքում՝ Սյունիքի մարզին, հարավային հատվածում՝ Նախիջևանին, իսկ արևմուտքում՝ Արարատի մարզին։ Մայրաքաղաք Երևանին անմիջապես չի հարում։ Վայոց ձորի մարզի վարչական կենտրոնը Եղեգնաձոր համայնքն է (բնակչությունը՝ 7800 մարդ), որը հանդիսանում է նաև մարզի խոշորագույն քաղաքը։ Վարչատարածքային միավորի մյուս քաղաքային բնակավայրերն են Վայքն ու Ջերմուկը։ Վերջինս համարվում է զբոսաշրջային կարևոր նշանակություն ունեցող առողջարանային քաղաք։ Ըստ 2019 թվականի մարդահամարի տվյալների՝ մարզի բնակչությունը կազմում է 49 հազար մարդ, որը ճնշող մեծամասնությունը հայերն են (99 % և ավելի)։ Վայոց ձորը համարվում է Հայաստանի ամենաքիչ և ամենանոսր բնակեցված մարզը։ Վայոց ձորը Հայաստանի տնտեսապես ամենաթույլ զարգացած մարզերից մեկն է։ Տնտեսության առաջատար ճյուղը գյուղատնտեսությունը, որի ավանդական ուղղություններից մեկն էլ խաղողագործությունն է։ Ինքնին, Վայոց ձորը հանդիսանում է Հայաստանի խաղողագործական չորս շրջաններից մեկը, որը աչքի է ընկնում գինեգործության հազարամյա ավանդույթներով։ «Արենի» տեսակի խաղողից այստեղ պատրաստվում է նույնանուն հանրահայտ գինին։Վայոց ձորը աչքի է ընկնում նաև հարուստ մշակութային ժառանգությամբ և պատմական անցյալով։ Հայաստանի պատմագրության մեջ Վայոց ձորն առաջին անգամ հիշատակվել է քերթողահայր Մովսես Խորենացու կողմից՝ դեռևս հնագույն ժամանակներից ընդգրկված լինելով հայկական պետական կազմավորումների մեջ։ Թռչունների քարայրում հայտնաբերված կաշվե տրեխը համարվում է մինչ օրս հայտնի ամենահին կոշիկի նմուշը։ Արենիում հայտնաբերվել են նաև գինու կարասների մի ամբողջ շարք (հավանական է, որ դա գինու արտադրության ամենահին ցիկլն է աշխարհում)։ Վայոց ձորի մարզային տարածքում են գտնվում է նաև միջնադարյան շրջանի Թանահատի վանքը (8-րդ դար), 10-րդ դարին թվագրվող Սմբատաբերդը կամ Ջաղաց Քարի բերդը և վաղմիջնադարյան հայկական ճարտարապետության մարգարիտներից մեկը՝ Նորավանքը։ Այստեղ է գտնվել նաև միջնադարյան Հայաստանի կարևորագույն ուսումնագիտական կենտրոնը՝ Գլաձորի համալսարանը։",
      img: ["https://vayotsdzorwineroute.com/wp-content/uploads/2017/11/2daysheader.jpg", "https://www.landofnoah.com/uploads/0000/1/2020/09/03/vayots-dzor-province-of-armenia-1.jpg",
      ]
    },

    {
      name: "Սյունիք",
      description: [
        {
          title: "",
          paragraph: ""
        }
      ]
    },

    {
      name: "Կոտայք",
      description: [
        {
          title: "",
          paragraph: ""
        }
      ]
    },




  ]



  return (

    <div >

      <div style={{}}>
        <div style={{ textAlign: "center", fontSize: "40px", border: "2px solid black", backgroundColor: "rgb(193, 225, 252)", padding: "5px", fontFamily: "fantasy", }}>Հայաստանի մարզերը</div>
      </div>
      <div style={{ display: "flex", }}>
        <div>
          {regions.map(
            (x, i) =>
              <div
                key={i}
                onClick={() => setRegionN(i)}
                style={{ border: "1px solid black", padding: "33px", backgroundColor: i === regionN ? "rgb(193, 225, 252)" : "azure", cursor: "pointer", fontFamily: "initial" }}>
                {x.name}</div>)}
        </div>
        <div style={{ paddingTop: "5px", padding: "5px" }}>
          {
            regions[regionN].description.map(
              (x, i) => (
                <div key={i} style={{ border: "ridge 2px azure", }}>
                  <div style={{ textAlign: "center", fontSize: "25px", fontFamily: "revert" }}>{x.title}</div>
                  <div style={{ padding: "20px", }}>{x.paragraph}</div>
                </div>
              )
            )
          }
        </div>

        <div>
          {regions[regionN].img.map(
            (x, i) => (
              <div key={i} >
                <div style={{ border: "2px solid rgb(193, 225, 252)", textAlign: "center", backgroundColor: "azure", fontFamily: "initial" }}>{x.imgDescripion}</div>
                <div> <img alt="" style={{ width: "200px", height: "150px" }} src={x.src} /> </div>

              </div>
            )
          )
          }
        </div>





        <div>

        </div>

      </div>

    </div>
  )
}

export default App
