import { useState } from "react"


function App() {
  const [regionN, setRegionN] = useState(0)

  const regions = [
    {
      name: "Արագածոտնի մարզ",
      description: [
        {
          title: 'paragraoh 1',
          content: 'content of paragraph 1'
        },
        {
          title: 'paragraoh 2',
          content: 'content of paragraph 2'
        },
        {
          title: 'paragraoh 3',
          content: 'content of paragraph 3'
        },
        {
          title: 'paragraoh 1',
          content: 'content of paragraph 1'
        },
        {
          title: 'paragraoh 2',
          content: 'content of paragraph 2'
        },
        {
          title: 'paragraoh 3',
          content: 'content of paragraph 3'
        },
      ],
      img: ["https://upload.wikimedia.org/wikipedia/commons/3/30/Amberd_fortress%2C_Aragatsotn_Province%2C_Armenia._DSCF2563-2.jpg", "https://d31qtdfy11mjj9.cloudfront.net/places/1511523264764378978.jpg"]
    },

    {
      name: "Արարատի մարզ",
      description: "Արարատ (ավանդական հայերեն՝ Սիս և Մասիս) հանգած հրաբուխ Արաքս գետի աջ ափին, Հայաստանի սահմանից 32 կմ հեռավորության վրա, իսկ Իրանի սահմանից՝ 16 կմ։ Ունի երկու գագաթ՝ մեծ (Մասիս՝ 5165 մ) և փոքր (Սիս՝ 3925 մ)[2]։ Հայկական լեռնաշխարհի ամենաբարձր լեռն է[3]։ Արարատի լեռնային զանգվածն ունի շուրջ 40 կմ տրամագիծ։Մասիսն ունի դեպի հյուսիս թեքված զառիթափ ու ժայռոտ գագաթ՝ 12 կմ² հիմքի մակերեսով, աշխարհի ամենաբարձր գագաթներից է (բարձրությունը՝ 5165 մ), իսկ հարաբերական բարձրությամբ (ստորոտից՝ մինչև գագաթ) առաջինը՝ 4300 մ։ Հյուսիսարևելյան լանջին է «Վիհ Մասեաց» կամ «Փլած Մեծի լերինն» անունով խորխորատը, որը ձգվում է ստորոտից գագաթ շուրջ 10 կմ, իսկ գագաթի մոտ նրա առավելագույն խորությունը հասնում է 1000 մետրի։ Գագաթը պատված է հավերժական ձյունով, որից սկիզբ է առնում մոտ 30 սառցադաշտ։ Հարավարևմտյան լանջին դրանք իջնում են մինչև 3850-3950 մ, բայց Մասյաց վիհում սառույցն իջած է մինչև 2754 մ բարձրության։ Արարատը բիբլիական սուրբ լեռն է, որի վրա իջևանել է Նոյյան տապանը՝ ջրհեղեղից հետո։ Համաշխարհային ջրհեղեղից լեռան գագաթին փրկվել են ութ հոգի՝ նոր մարդկության նախահայր Նոյը, իր կինը, որդիները և որդիների կանայք։ Նոյի և իր ընտանիքի փրկության պատմությունն արձանագրված է Աստվածաշնչում (Ծննդ. 7,8): Արարատից Նոյն իջել է դեպի հարավ-արևելք, որտեղից և առաջացել է այդ տարածաշրջանի անվանումը՝ Նախիջևան։1829 թվականին, առաջին անգամ Արարատի գագաթը բարձրացավ Դորպատի համալսարանի պրոֆեսոր Իոհանն Ֆրիդրիխ Պարրոտը, որին ուղեկցում էին՝ Խաչատուր Աբովյանը, երկու գյուղացիներ՝ Հովհաննես Այվազյան, Մուրադ Պողոսյան և երկու ռուս զինվորներ՝ Ալեկսեյ Զդոռովենկո, Մատվեյ Չալպանով։ Նրանք կատարեցին ֆիզիկական և բուսա-կլիմայական հետազոտություններ։ 1845 թվականի հուլիսին ակադեմիկոս Աբիխը մանրակրկիտ ուսումնասիրելով Արարատի առանձնահատկությունները, որոշեց Մասիսի գագաթը տանող ամենամատչելի ուղին (հարավ արևելյան լանջը) և կատարեց փայլուն վերելք։",
      img: ["https://armenia-tour.am/wp-content/uploads/st_uploadfont/xorvirap1.jpg", "https://cdn-images.nyc3.digitaloceanspaces.com/photolure/198706/198709/original.jpg"]
    },

    {
      name: "Արմավիրի մարզ",
      description: "Արմավիրի մարզ, վարչատարածքային միավոր Հայաստանում։ Արմավիրի մարզկենտրոնն Արմավիր քաղաքն է։ Տարածքը 1242 կմ² է, բնակչությունը 284 հազար մարդ։ Գտնվում է 800-1000 մ բարձրություններում։ Մարգարա գյուղի մոտ Արաքս գետի վրա կառուցված ավտոճանապարհային կամուրջը Հայաստանը միացնում է Թուրքիային։ Մարզի տարածքը եղել է պատմական Հայաստանի Այրարատ նահանգի մի մասը։ Կլիման խիստ ցամաքային է։ Մթնոլորտային տեղումների քանակը չի գերազանցում 300 մմ։ Ամառը շոգ է, տևական (4-5 ամիս)։Հաճախ ջերմաստիճանը բարձրանում է մինչև 40-42 °C։ Բնորոշ են լեռնահովտային քամիները։ Ձմեռը ցուրտ է, անամպ, անհողմ։ Գարունը կարճատև է։ Առանձնապես հաճելի է արևոտ, անհողմ, տևական աշունը, երբ հասունանում են այգիների ու դաշտերի բարիքները։ Հարթավայրային մասի բնական կիսաանապատային լանդշաֆտները խիստ փոփոխված են։ Ներկայումս տիրապետում են մարդածին լանդշաֆտները։ Բնական ծածկույթը, որը հումուսով աղքատ գորշահողեր են, հազարամյակների ընթացքում ոռոգովի երկրագործրության պայմաններում վերածվել է կուլտուր-ոռոգելի հողերի։ Հարթության ցածրադիր մասերում գոյացել են ճահճուտներ։Մարզը հարուստ չէ օգտակար հանածոներով։ Բազմաթիվ են պատմական և ճարտարապետական հուշարձանները։ Հայտնաբերվել են Մեծամորի բրոնզեդարյան մետաղաձուլարանը, Վանի թագավորության քաղաք Արգիշտիխինիլիի ավերակները։Պատմաճարտարապետական մեծագույն արժեք են ներկայացնում Էջմիածնի վանական կառույցները, Զվարթնոց տաճարի ավերակները, Վաղարշապատում Սուրբ Հռիփսիմե, Սուրբ Գայանե, Շողակաթ եկեղեցիները, ինչպես նաև Սարդարապատի հուշահամալիրը։Արմավիրի մարզը բնակչության թվով և խտությամբ Հայաստանում գրավում է առաջին տեղը։ Մարզին բնորոշ է այն, որ չնայած ռելիեֆային պայմանների միատարրությանը՝ բնակչության տեղաբաշխումը հավասարաչափ չէ։ Նրա ամենամեծ կուտակումը մարզի արևելյան հատվածում է։ Դեպի արևմուտք շարժվելիս այն կտրուկ նվազում է։Արմավիրի մարզի խոշոր գյուղերն են՝ Նալբանդյան, Արշալույս, Փարաքար, Սարդարապատ։Արմավիրի մարզն ունի երեք քաղաք՝ Արմավիրը (29,319 բնակիչ), Վաղարշապատը (46,540 բնակիչ) և Մեծամորը (9,191 բնակիչ)։",
      img: ["https://upload.wikimedia.org/wikipedia/commons/f/ff/Armavir.jpg", "https://armenia-tour.am/wp-content/uploads/2016/01/30_big-1.jpg", "https://fastly.4sqi.net/img/general/600x600/11675667_nX6G32C-JoKTDC3Ys7U5WPuo9gNayS4fjlh-WN5QNaI.jpg"]
    },

    {
      name: "Գեղարքունիքի մարզ",
      description: "Տարածքի մեծությամբ այն առաջինն է Հայաստանում։ Մարզն այնքան մեծ է, որ նրանում հանգիստ կտեղավորվեն Արարատի, Արմավիրի և Կոտայքի մարզերն ամբողջությամբ։ Ամբողջ տարածքի շուրջ 1/4-ը զբաղեցնում է Սևանա լիճը։ Հյուսիսից սահմանակից է Տավուշի մարզին, արևելքից՝ Ադրբեջանին և Արցախին, արևմուտքից՝ Կոտայքի և Արարատի մարզերին, իսկ հարավից՝ Վայոց ձորի մարզին։ Տրանսպորտաաշխարհագրական դիրքը, ի տարբերություն Հայաստանի այլ մարզերի, անբարենպաստ է։ Գլխավոր ճանապարհներն են՝ Ճամբարակ-Բերդ, Մարտունի-Եղեգնաձոր և Երևան-Սևան-Սոթք երկաթուղին։Տարածքում շատ են հրաբխային կոները, որոնցից հայտնի են հատկապես Արմաղանն ու Աժդահակը, որոնց խառնարաններում գտնվում են համանուն լճերը։ Գլխավոր լեռնաշղթաներն են Գեղամա, Արեգունի, Սևանի, Արևելյան Սևանի, Վարդենիսի։ Սևանի ավազանն արգավանդ հողերով հարուստ է, հատկապես կարևոր է Մասրիկի դաշտը՝ 1900-2200 մ բարձրություններում։ Կլիման բարեխառն լեռնային է. ձմեռները ցուրտ են, առաջանում է կայուն ձնածածկույթ։ Հունվարյան միջին ջերմաստիճանը -5˚-10˚ է։ Ամառները տաք են, արևոտ։ Միջին ջերմաստիճանն հասնում է +18˚+20˚։ Տեղումները քիչ են՝ 400-450 մմ, իսկ բարձրադիր շրջաններում մինչև 1000 մմ։ Օգտակար հանածոներից մեծ արժեք են ներկայացնում ոսկու (Սոթք), քրոմիտի (Շորժա), բնական շինանյութերի, հանքային ջրերի (Լիճք) և այլ պաշարները։ Սևանա լիճը ամբողջությամբ գտնվում է Գեղարքունիքի մարզում։ Գեղարքունիքի մարզում է գտնվում Սոթքի ոսկու խոշոր հանքավայրերը։",
      img: ["https://www.wideworldtrips.com/wp-content/uploads/2020/05/things-to-do-in-gegharkunik.jpg", "https://www.iarmenia.org/wp-content/uploads/2018/06/1676044_603x354-e1528842580374.jpg"]
    },

    {
      name: "Շիրակի մարզ",
      description: "Մարզի տարածքում են գտնվում Արփի լիճ-ջրամբարը, Ախուրյանի ջրամբարի հայկական հատվածը և Մանթաշի ջրամբարը։ Շիրակի մարզի կենտրոնական և հարավային հատվածում տարածվում է Շիրակի դաշտը, իսկ հյուսիսային շրջանում՝ Աշոցքի սարահարթը, միաժամանակ Շիրակի մարզում են տարածվում Փամբակի, Բազումի լեռնաշղթաների, Եղնախաղի, Ջավախքի, Արագածի լեռնազանգվածների մի մասը։ Երկրաբանական կառուցվածքի տեսակետից տարածքը ընդհանուր առմամբ ունի համեմատաբար միատարր հրաբխային կազմություն և երիտասարդ հասակ։ Հայկական լեռնաշխարհի հետ միասին մարզի տարածքն անցել է երկրաբանական զարգացման բարդ ուղի։ Եռանդուն տեկտոնական շարժումները, որոնց շնորհիվ երկրակեղևը ծալքավորվել ու կոտրվել է, տեղի է ունեցել երկրաբանական տարբեր ժամանակաշրջաններում։ Սակայն մարզի ռելիեֆի ձևավորման գործում գլխավոր դերը պատկանում է ալպյան լեռնակազմությանը, երբ տարածքը բարձրացել է ծովի հատակից և թևակոխել ցամաքային զարգացման փուլ։ Հետագայում, շարունակվելով վերընթաց տեկտոնական շարժումները, ձևավորվել են միջին բարձրության լեռներ։ Նեոգենի ժամանակաշրջանի կեսերին տեղի ունեցած հզոր լեռնակազմական պրոցեսների հետևանքով տարածքի շրջակա լեռները դարձել են ավելի բարձր, հովիտները` ավելի խորը։ Այդ ժամանակաշրջանում է, որ այստեղ գոյանում են երկրակեղևի տարբեր ուղղություններով ձգվող Սևան-Շիրակի, Ջավախք-Արագած-Մասիսի և Աշոցքի բեկվածքները[2]։ Եռանդուն տեկտոնական շարժումները ուղեկցվել են բուռն հրաբխականությամբ, որն ընդգրկել է մարզի ամբողջ տարածքը` սկսած Եղնախաղից, Աշոցքից մինչև Արագած։ Հրաբխային արտավիժման և ժայթքման նյութերը ծածկել են հսկայական տարածություններ` իրենց տակ թողնելով ծալքավոր և ծալքաբեկորավոր լեռների խղզման գծերի զգալի մասը` դրանց վրա գոյացնելով հրաբխային լեռնավահաններ, առանձին լեռնազանգվածներ, սարավանդներ։ Նման եղանակով են գոյացել Արագած լեռնազանգվածը, Ջավախքի, Աշոցքի, Եղնախաղի լեռնավահանները, Աշոցքի և Շիրակի սարահարթերը։ Մի քանի փուլով հանդես եկած սառցապատումների ներգործությամբ Արագածի, Ջավախքի, Եղնախաղի լեռների բարձր մասերում առաջացել են կրկեսանման գոգավորություններ, տաշտականման լայն հովիտներ։ Սառցադաշտերի հալոցքային ջրերը լեռների լանջերին և ստորոտներին գոյացրել են մորենային և սառցադաշտաջրաբերուկային կուտակումներ[2]։",
      img: ["https://app.conciergetravel.am/storage/5df4bA6F819XdX16TmcsqMReagKPF4aZJy2KZnJA.jpg", "https://app.conciergetravel.am/storage/7r31P6BO3k1Quiypmg2BfEXQLWs91dkCjAcdTYLU.jpg"]
    },

    {
      name: "Լոռու մարզ",
      description: `Լոռու մարզ, մարզի կարգավիճակ ունեցող վարչատարածքային միավոր Հայաստանի հյուսիսում։ Զբաղեցնում է պատմական Հայաստանի Գուգարաց նահանգի արևելյան հատվածն ու Այրարատ նահանգի Նիգ գավառի հյուսիսային տիրույթները։Լոռու մարզն ունի ցայտուն արտահայտված բնական սահմաններ։ Այն ընդգրկում է Դեբեդ գետի ավազանն ամբողջությամբ և հիմնականում ունի լեռնային ռելիեֆ՝ բարձրադիր լեռներ, անդնդախոր, երբեմն սուր կտրվածքով կիրճեր։ Նրա տարածքում են ձգվում Ջավախքի, Բազումի, Փամբակի, Գուգարաց, Վիրահայոց և Հալաբի լեռնաշղթաները։ Առանձնանում են Լոռու,Փամբակի գոգավորությունները և Լոռվա ձորը։ Բնակավայրերը գտնվում են ծովի մակերևույթից 520-ից մինչև 1800 մետր բարձրության վրա։Մարզի վարչական կենտրոն հանդիսացող Վանաձոր քաղաքը համարվում է Հայաստանի երրորդ խոշորագույն քաղաքը՝ շուրջ 80 հազար բնակչությամբ։ Մյուս խոշոր բնակավայրերն են Ալավերդին, Ստեփանավանը, Սպիտակը, Թումանյանը, Ախթալան և Տաշիրը։ Ըստ 2020 թվականի տարեսկզբի տվյալների՝ մարզի բնակչությունը կազմում է 213․3 հազար մարդ, որի ճնշող մեծամասնությունը հայերն են, սակայն համեմատականորեն քիչ չեն նաև ազգային փոքրամասնությունների (ռուսական, հունական, եզդիական, ուկրաինական և այլն) համայնքները։Լոռին Հայաստանի արդյունաբերական մարզերից է։ Այստեղ են գործում Հայաստանի տնտեսության արդյունաբերական ճյուղի անկյունաքարային նշանակություն ունեցող մի շարք օբյեկտներ։ Արդյունաբերության զարգացվածության ֆոնին ավելի քիչ զարգացած է գյուղատնտեսությունը։Լոռին աչքի է ընկնում նաև հարուստ մշակութային ժառանգությամբ և պատմական անցյալով, որի մասին վկայում են տասնյակ վանքերը, բերդերը, ամրոցներն ու հուշակոթողները։ Պատմամշակութային ինքնատիպ հուշարձանների բազմազանությունը որոշակիորեն պայմանավորված է այն հանգամանքով, որ 10-12-րդ դարերում այստեղ գոյություն է ունեցել անկախ հայկական պետականություն՝ ի դեմս Լոռու կամ Տաշիր-Ձորագետի թագավորության։ Հայաստանում ՅՈՒՆԵՍԿՕ-ի Համաշխարհային ժառանգության ցանկում ներառված օբյեկտներից երկուսը՝ Հաղպատի ու Սանահինի միջնադարյան վանական համալիրները գտնվում են Լոռու մարզում։`,
      img: ["https://media-cdn.tripadvisor.com/media/photo-s/1c/b0/95/93/lori-province-from-yaghdan.jpg", "https://onewaytour.com/wp-content/uploads/2019/05/dorb1.jpg"]
    },

    {
      name: "Շիրակի մարզ",
      description: "Շիրակի մարզ, մարզի կարգավիճակ ունեցող վարչատարածքային միավոր Հայաստանում։ Վարչական կենտրոնը Գյումրի քաղաքն է։ Պետական սահմանով արևմուտքից սահմանակից է Թուրքիային, հյուսիսից՝ Վրաստանին, արևելքից սահմանակից է՝ Հայաստանի Լոռու մարզին և հարավից՝ Հայաստանի Արագածոտնի մարզին։ Գտնվում է Հայ Առաքելական Եկեղեցու Շիրակի թեմի հովվապետության ներքո (առաջնորդարանը՝ քաղաք Գյումրիում), սակայն մարզի տարածքում կան զգալի թվով կաթոլիկ հայեր, ինչպես նաև կաթոլիկ գյուղեր։",
      img: ["https://www.hayernaysor.am/uploads/thumb/1606905905.png", "https://d31qtdfy11mjj9.cloudfront.net/places/1503141718.jpg"]
    },


    {
      name: "Տավուշի մարզ",
      description: `Տավուշի մարզը գտնվում է Հայաստանի հյուսիսարևելյան հատվածում։ Ընդգրկում է Իջևանի, Տավուշի (նախկինում՝ Շամշադին), Նոյեմբերյանի, Դիլիջանի տարածաշրջանները և 5 քաղաքներ՝ Իջևան, Նոյեմբերյան, Բերդ, Դիլիջան և Այրու Մարզը սահմանակից է Վրաստանին, հյուսիսում և արևելքում՝ Ադրբեջանին։ Հայաստանի պետական սահմանից մարզին բաժին է ընկնում 400 կմ հատված, որից 352-ը՝ Ադրբեջանի հետ։ Մարզի կենտրոնով դեպի հյուսիս-արևելք հոսում է Աղստև գետը։ Ամենացածր կետը գտնվում է Դեբեդավան գյուղի մոտ (380 մ), ամենաբարձր կետը՝ Միափորի լեռնաշղթայի Մուրղուզ լեռն է (2993 մ)։ Հայաստանի Տավուշի մարզը տարածվում է Փոքր Կովկասի լեռնաշղթաների արտաքին շարի վրա (Վիրահայոց, Գուգարաց և Միափորի լեռներ)։ Գտնվում է Հայաստանի չափավոր խոնավ տարածաշրջանում։ [Գետ]]երը պատկանում են Կասպից ծովի (Կուր գետի) ավազանին և սնվում են հալոցքային, ստորերկրյա և անձրևային ջրերից։ Գտնվում է Երևանից 137 կմ հեռավորության վրա։`,
      img: ["https://tsayg.am/wp-content/uploads/2020/08/1_701311_02-1170x658.jpg", "https://destinationarmenia.am/storage/article/16177400542911272.jpg"],
    },
    {
      name: "Վայոց Ձոր",
      description: "Վայոց ձորի մարզ, մարզի կարգավիճակ ունեցող վարչատարածքային միավոր Հայաստանի հարավարևելյան վերջույթում։ Զբաղեցնում է պատմական Հայաստանի Սյունյաց նահանգի նույնանուն գավառի հիմնական տարածքը։ Ներկայիս վարչատարածքային միավորը ձևավորվել է Հայկական ԽՍՀ-ի մաս կազմած Եղեգնաձորի և Վայքի (Ազիզբեկովի) շրջանների միավորման հետևանքով՝ 1995 թվականի բարեփոխումների արդյունքում։Վայոց ձորի մարզը զբաղեցնում է 2,308 կմ² տարածք (7-րդը Հայաստանի մարզերի շարքում)։ Ընդգրկում է երեք հիմնական աշխարհագրական շրջաններ՝ Արփայի գոգավորություն, Վայքի ծալքաբեկորավոր լեռնաշղթա (ձգվում է հարավում) և Վարդենիսի հրաբխային լեռնավահան։ Հյուսիսում սահմանակցում է Գեղարքունիքի մարզին, հյուսիս-արևելքում՝ Արցախի Հանրապետությանը, հարավ-արևմուտքում՝ Սյունիքի մարզին, հարավային հատվածում՝ Նախիջևանին, իսկ արևմուտքում՝ Արարատի մարզին։ Մայրաքաղաք Երևանին անմիջապես չի հարում։ Վայոց ձորի մարզի վարչական կենտրոնը Եղեգնաձոր համայնքն է (բնակչությունը՝ 7800 մարդ), որը հանդիսանում է նաև մարզի խոշորագույն քաղաքը։ Վարչատարածքային միավորի մյուս քաղաքային բնակավայրերն են Վայքն ու Ջերմուկը։ Վերջինս համարվում է զբոսաշրջային կարևոր նշանակություն ունեցող առողջարանային քաղաք։ Ըստ 2019 թվականի մարդահամարի տվյալների՝ մարզի բնակչությունը կազմում է 49 հազար մարդ, որը ճնշող մեծամասնությունը հայերն են (99 % և ավելի)։ Վայոց ձորը համարվում է Հայաստանի ամենաքիչ և ամենանոսր բնակեցված մարզը։ Վայոց ձորը Հայաստանի տնտեսապես ամենաթույլ զարգացած մարզերից մեկն է։ Տնտեսության առաջատար ճյուղը գյուղատնտեսությունը, որի ավանդական ուղղություններից մեկն էլ խաղողագործությունն է։ Ինքնին, Վայոց ձորը հանդիսանում է Հայաստանի խաղողագործական չորս շրջաններից մեկը, որը աչքի է ընկնում գինեգործության հազարամյա ավանդույթներով։ «Արենի» տեսակի խաղողից այստեղ պատրաստվում է նույնանուն հանրահայտ գինին։Վայոց ձորը աչքի է ընկնում նաև հարուստ մշակութային ժառանգությամբ և պատմական անցյալով։ Հայաստանի պատմագրության մեջ Վայոց ձորն առաջին անգամ հիշատակվել է քերթողահայր Մովսես Խորենացու կողմից՝ դեռևս հնագույն ժամանակներից ընդգրկված լինելով հայկական պետական կազմավորումների մեջ։ Թռչունների քարայրում հայտնաբերված կաշվե տրեխը համարվում է մինչ օրս հայտնի ամենահին կոշիկի նմուշը։ Արենիում հայտնաբերվել են նաև գինու կարասների մի ամբողջ շարք (հավանական է, որ դա գինու արտադրության ամենահին ցիկլն է աշխարհում)։ Վայոց ձորի մարզային տարածքում են գտնվում է նաև միջնադարյան շրջանի Թանահատի վանքը (8-րդ դար), 10-րդ դարին թվագրվող Սմբատաբերդը կամ Ջաղաց Քարի բերդը և վաղմիջնադարյան հայկական ճարտարապետության մարգարիտներից մեկը՝ Նորավանքը։ Այստեղ է գտնվել նաև միջնադարյան Հայաստանի կարևորագույն ուսումնագիտական կենտրոնը՝ Գլաձորի համալսարանը։",
      img: ["https://vayotsdzorwineroute.com/wp-content/uploads/2017/11/2daysheader.jpg", "https://www.landofnoah.com/uploads/0000/1/2020/09/03/vayots-dzor-province-of-armenia-1.jpg"]
    }





  ]

  const [n, setN] = useState(0)

  return (

    <div >
      <div style={{ display: "flex", }}>
        <div>
          {regions.map(
            (x, i) =>
              <div
                key={i}
                onClick={() => setRegionN(i)}
                style={{ border: "1px solid black", padding: "33px", }}>
                <div
                  onClick={() => setN(i)}
                  style={{ backgroundColor: i === n ? "gray" : "", cursor: "pointer" }}>
                  {x.name}</div></div>)}




        </div>


        <div style={{ border: "1px solid black", padding: "10px" }}>
          {regions[regionN].description.map(
            (x, i) => <div style={{ backgroundColor: i % 2 === 0 ? "rgb(200, 200, 200)" : null }}>
              <div>
                <span style={{ color: "red" }}>{x.title}</span>
              </div>
              <div>
                <span>{x.content}</span>
              </div>
            </div>
          )} </div>

        <div>
          {regions[regionN].img.map(im => <img height={"200"} width={"300"} src={im} />)}
        </div>









        <div>

        </div>

      </div>

    </div>
  )
}

export default App
